espressif/esp-bist/src/soc/esp32c5/esp32c5.svd
<?xml version="1.0" encoding="UTF-8"?>
<device schemaVersion="1.1" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="CMSIS-SVD_Schema_1_1.xsd">
  <vendor>ESPRESSIF SYSTEMS (SHANGHAI) CO., LTD.</vendor>
  <vendorID>ESPRESSIF</vendorID>
  <name>ESP32-C5</name>
  <series>ESP32 C-Series</series>
  <version>1</version>
  <description>32-bit RISC-V MCU &amp; 2.4 and 5 GHz Wi-Fi 6 &amp; Bluetooth 5 (LE) &amp; IEEE 802.15.4</description>
  <licenseText>Copyright 2025 Espressif Systems (Shanghai) PTE LTD

    Licensed under the Apache License, Version 2.0 (the "License");
    you may not use this file except in compliance with the License.
    You may obtain a copy of the License at

        http://www.apache.org/licenses/LICENSE-2.0

    Unless required by applicable law or agreed to in writing, software
    distributed under the License is distributed on an "AS IS" BASIS,
    WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
    See the License for the specific language governing permissions and
    limitations under the License.</licenseText>
  <cpu>
    <name>RV32IMAC</name>
    <revision>r0p0</revision>
    <endian>little</endian>
    <mpuPresent>false</mpuPresent>
    <fpuPresent>false</fpuPresent>
    <nvicPrioBits>0</nvicPrioBits>
    <vendorSystickConfig>false</vendorSystickConfig>
  </cpu>
  <addressUnitBits>32</addressUnitBits>
  <width>32</width>
  <resetValue>0x00000000</resetValue>
  <resetMask>0xFFFFFFFF</resetMask>
  <peripherals>
    <peripheral>
      <name>CLINT</name>
      <description>Core Local Interrupts</description>
      <groupName>CLINT</groupName>
      <baseAddress>0x20000000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x180</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>MSIP</name>
          <addressOffset>0x1800</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>MSIP</name>
              <description>Configures the pending status of the machine software interrupt.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MTIMECTL</name>
          <addressOffset>0x1804</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>MTCE</name>
              <description>Configures whether to enable the CLINT timer counter.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MTIE</name>
              <description>Write 1 to enable the machine timer interrupt.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MTIP</name>
              <description>Represents the pending status of the machine timer interrupt.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MTOF</name>
              <description>Configures whether the machine timer overflows.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MTIME</name>
          <addressOffset>0x1808</addressOffset>
          <size>0x40</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>MTIME</name>
              <description>Configures the 64-bit CLINT timer counter value.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>64</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MTIMECMP</name>
          <addressOffset>0x1810</addressOffset>
          <size>0x40</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>MTIMECMP</name>
              <description>Configures the 64-bit machine timer compare value.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>64</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USIP</name>
          <addressOffset>0x1C00</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>USIP</name>
              <description>Configures the pending status of the user software interrupt.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UTIMECTL</name>
          <addressOffset>0x1C04</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>UTIE</name>
              <description>Write 1 to enable the user timer interrupt.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UTIP</name>
              <description>Represents the pending status of the user timer interrupt.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>UTOF</name>
              <description>Configures whether the user timer overflows.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UTIME</name>
          <addressOffset>0x1C08</addressOffset>
          <size>0x40</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>UTIME</name>
              <description>Represents the read-only 64-bit CLINT timer counter value.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>64</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UTIMECMP</name>
          <addressOffset>0x1C10</addressOffset>
          <size>0x40</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>UTIMECMP</name>
              <description>Configures the 64-bit user timer compare value.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>64</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
