espressif/esp-bist/src/soc/esp32c5/esp32c5.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>CLIC</name>
      <description>Core Local Interrupt Controller</description>
      <groupName>CLIC</groupName>
      <baseAddress>0x20800000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x10C0</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>INT_CONFIG</name>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>UNLBITS</name>
              <description>User mode interrupt priority effective digits, the maximum value is 8.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SNLBITS</name>
              <description>Supervisor mode interrupt priority effective digits, the maximum value is 8.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NMBITS</name>
              <description>The effective number of bits in the privileged state.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MNLBITS</name>
              <description>Machine mode interrupt priority effective digits, the maximum value is 8.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_INFO</name>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>CTLBITS</name>
              <description>The effective bits of priority in the CLICINTCTL register.</description>
              <bitOffset>21</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>VERSION</name>
              <description>The lower 4 bits are the modified version of the hardware implementation; the upper 4 bits are the CLIC architecture version information.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>NUM_INT</name>
              <description>The number of interrupt sources.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>13</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>48</dim>
          <dimIncrement>0x4</dimIncrement>
          <dimIndex>0-47</dimIndex>
          <name>INT_IP%s</name>
          <description>Interrupt pending register.</description>
          <addressOffset>0x1000</addressOffset>
          <size>0x8</size>
          <fields>
            <field>
              <name>INT_IP</name>
              <description>Interrupt pending bit.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>48</dim>
          <dimIncrement>0x4</dimIncrement>
          <dimIndex>0-47</dimIndex>
          <name>INT_IE%s</name>
          <description>Interrupt enable register.</description>
          <addressOffset>0x1001</addressOffset>
          <size>0x8</size>
          <fields>
            <field>
              <name>INT_IE</name>
              <description>Interrupt enable bit.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>48</dim>
          <dimIncrement>0x4</dimIncrement>
          <dimIndex>0-47</dimIndex>
          <name>INT_ATTR%s</name>
          <description>Interrupt attribute register.</description>
          <addressOffset>0x1002</addressOffset>
          <size>0x8</size>
          <fields>
            <field>
              <name>SHV</name>
              <description>Configures hardware vectoring for the ith CLIC machine mode interrupt.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <name>SHV</name>
                <enumeratedValue>
                  <name>SOFTWARE</name>
                  <description>Not hardware vectored. Upon taking this interrupt, the CPU will jump to the address configured in mtvec.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HARDWARE</name>
                  <description>Hardware vectored. Upon taking this interrupt, the CPU will jump to the word address stored at (mtvt + 4*i) relative to the base address configured in mtvt.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TRIG</name>
              <description>Configures the trigger type and polarity of the ith CLIC machine mode interrupt.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <name>TRIG</name>
                <enumeratedValue>
                  <name>POSITIVE_LEVEL</name>
                  <description>interrupt is positive level-triggered</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POSITIVE_EDGE</name>
                  <description>interrupt is positive edge-triggered</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NEGATIVE_LEVEL</name>
                  <description>interrupt is negative level-triggered</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NEGATIVE_EDGE</name>
                  <description>interrupt is negative edge-triggered</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MODE</name>
              <description>Configures the privilege mode of the ith CLIC interrupt. This is hardwired to 0x3 as user mode interrupts are not supported.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>48</dim>
          <dimIncrement>0x4</dimIncrement>
          <dimIndex>0-47</dimIndex>
          <name>INT_CTL%s</name>
          <description>Interrupt level control register.</description>
          <addressOffset>0x1003</addressOffset>
          <size>0x8</size>
          <fields>
            <field>
              <name>CTL</name>
              <description>Configures the level and priority of the ith CLIC machine mode interrupt.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RESERVED</name>
              <description>Reserved bits.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
