espressif/esp-bist/src/soc/esp32c5/esp32c5.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>AES</name>
      <description>AES (Advanced Encryption Standard) Accelerator</description>
      <groupName>AES</groupName>
      <baseAddress>0x60088000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0xD4</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>AES</name>
        <value>78</value>
      </interrupt>
      <registers>
        <register>
          <dim>8</dim>
          <dimIncrement>0x4</dimIncrement>
          <dimIndex>0-7</dimIndex>
          <name>KEY%s</name>
          <description>AES key data register %s</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>KEY</name>
              <description>This bits stores key_0 that is a part of key material.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4294967295</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <dim>4</dim>
          <dimIncrement>0x4</dimIncrement>
          <dimIndex>0-3</dimIndex>
          <name>TEXT_IN%s</name>
          <description>Source text data register %s</description>
          <addressOffset>0x20</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>TEXT_IN</name>
              <description>This bits stores text_in_0 that is a part of source text material.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4294967295</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <dim>4</dim>
          <dimIncrement>0x4</dimIncrement>
          <dimIndex>0-3</dimIndex>
          <name>TEXT_OUT%s</name>
          <description>Result text data register %s</description>
          <addressOffset>0x30</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>TEXT_OUT</name>
              <description>This bits stores text_out_0 that is a part of result text material.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MODE</name>
          <description>Defines key length and encryption / decryption</description>
          <addressOffset>0x40</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>MODE</name>
              <description>Configures the key length and encryption / decryption of the AES accelerator.\\
0: AES-128 encryption\\
1: AES-192 encryption\\
2: AES-256 encryption\\
3: Reserved\\
4: AES-128 decryption\\
5: AES-192 decryption\\
6: AES-256 decryption\\
7: Reserved\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ENDIAN</name>
          <description>AES Endian configure register</description>
          <addressOffset>0x44</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>ENDIAN</name>
              <description>endian. [1:0] key endian, [3:2] text_in endian or in_stream endian,  [5:4] text_out endian or out_stream endian</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TRIGGER</name>
          <description>Operation start controlling register</description>
          <addressOffset>0x48</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>TRIGGER</name>
              <description>Configures whether or not to start AES operation. \\
0: No effect\\
1: Start\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STATE</name>
          <description>Operation status register</description>
          <addressOffset>0x4C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>STATE</name>
              <description>Represents the working status of the AES accelerator. \\
In Typical AES working mode:\\
0: IDLE\\
1: WORK\\
2: No effect\\
3: No effect\\
In DMA-AES working mode:\\
0: IDLE\\
1: WORK\\
2: DONE\\
3: No effect\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>4</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>IV_MEM[%s]</name>
          <description>The memory that stores initialization vector</description>
          <addressOffset>0x50</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <dim>4</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>H_MEM[%s]</name>
          <description>The memory that stores GCM hash subkey</description>
          <addressOffset>0x60</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <dim>4</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>J0_MEM[%s]</name>
          <description>The memory that stores J0</description>
          <addressOffset>0x70</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <dim>4</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>T0_MEM[%s]</name>
          <description>The memory that stores T0</description>
          <addressOffset>0x80</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>DMA_ENABLE</name>
          <description>Selects the working mode of the AES accelerator</description>
          <addressOffset>0x90</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>DMA_ENABLE</name>
              <description>Configures the working mode of the AES accelerator. \\
0: Typical AES\\
1: DMA-AES\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BLOCK_MODE</name>
          <description>Defines the block cipher mode</description>
          <addressOffset>0x94</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>BLOCK_MODE</name>
              <description>Configures the block cipher mode of the AES accelerator operating under the DMA-AES working mode. \\
0: ECB (Electronic Code Block)\\
1: CBC (Cipher Block Chaining)\\
2: OFB (Output FeedBack)\\
3: CTR (Counter)\\
4: CFB8 (8-bit Cipher FeedBack)\\
5: CFB128 (128-bit Cipher FeedBack)\\
6: GCM\\
7: Reserved\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BLOCK_NUM</name>
          <description>Block number configuration register</description>
          <addressOffset>0x98</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>BLOCK_NUM</name>
              <description>Represents the Block Number of plaintext or ciphertext when the AES accelerator operates under the DMA-AES working mode. For details, see Section &lt;a href=sec:aes-block-number"&gt;link&lt;/a&gt;. "</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INC_SEL</name>
          <description>Standard incrementing function register</description>
          <addressOffset>0x9C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>INC_SEL</name>
              <description>Configures the Standard Incrementing Function for CTR block operation. \\
0: INC&lt;SUB&gt;32&lt;/SUB&gt;\\
1: INC&lt;SUB&gt;128&lt;/SUB&gt;\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AAD_BLOCK_NUM</name>
          <description>Additional Authential Data block number register</description>
          <addressOffset>0xA0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>AAD_BLOCK_NUM</name>
              <description>Those bits stores the number of AAD block.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REMAINDER_BIT_NUM</name>
          <description>AES remainder bit number register</description>
          <addressOffset>0xA4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>REMAINDER_BIT_NUM</name>
              <description>Those bits stores the number of remainder bit.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CONTINUE</name>
          <description>AES continue register</description>
          <addressOffset>0xA8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CONTINUE</name>
              <description>Set this bit to continue GCM operation.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_CLR</name>
          <description>DMA-AES interrupt clear register</description>
          <addressOffset>0xAC</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>INT_CLR</name>
              <description>Configures whether or not to clear AES interrupt. \\
0: No effect \\
1: Clear \\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_ENA</name>
          <description>DMA-AES interrupt enable register</description>
          <addressOffset>0xB0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>INT_ENA</name>
              <description>Configures whether or not to enable AES interrupt.\\
0: Disable\\
1: Enable \\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DATE</name>
          <description>AES version control register</description>
          <addressOffset>0xB4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <name>DMA_EXIT</name>
          <description>Operation exit controlling register</description>
          <addressOffset>0xB8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>DMA_EXIT</name>
              <description>Configures whether or not to exit AES operation. \\
0: No effect\\
1: Exit\\
Only valid for DMA-AES operation.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RX_RESET</name>
          <description>AES-DMA reset rx-fifo register</description>
          <addressOffset>0xC0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>RX_RESET</name>
              <description>Set this bit to reset rx_fifo under dma_aes working mode.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TX_RESET</name>
          <description>AES-DMA reset tx-fifo register</description>
          <addressOffset>0xC4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>TX_RESET</name>
              <description>Set this bit to reset tx_fifo under dma_aes working mode.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PSEUDO</name>
          <description>AES PSEUDO function configure register</description>
          <addressOffset>0xD0</addressOffset>
          <size>0x20</size>
          <resetValue>0x000003C4</resetValue>
          <fields>
            <field>
              <name>EN</name>
              <description>This bit decides whether the pseudo round function is enable or not.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BASE</name>
              <description>Those bits decides the basic number of pseudo round number.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INC</name>
              <description>Those bits decides the increment number of pseudo round number</description>
              <bitOffset>5</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RNG_CNT</name>
              <description>Those bits decides the update frequency of the pseudo-key.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
