espressif/esp-bist/src/soc/esp32c5/esp32c5.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>DMA</name>
      <description>AHB_DMA Peripheral</description>
      <groupName>AHB_DMA</groupName>
      <baseAddress>0x60080000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x204</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>DMA_IN_CH0</name>
        <value>71</value>
      </interrupt>
      <interrupt>
        <name>DMA_IN_CH1</name>
        <value>72</value>
      </interrupt>
      <interrupt>
        <name>DMA_IN_CH2</name>
        <value>73</value>
      </interrupt>
      <interrupt>
        <name>DMA_OUT_CH0</name>
        <value>74</value>
      </interrupt>
      <interrupt>
        <name>DMA_OUT_CH1</name>
        <value>75</value>
      </interrupt>
      <interrupt>
        <name>DMA_OUT_CH2</name>
        <value>76</value>
      </interrupt>
      <registers>
        <cluster>
          <dim>3</dim>
          <dimIncrement>0x10</dimIncrement>
          <dimIndex>0-2</dimIndex>
          <name>IN_INT_CH%s</name>
          <description>Cluster IN_INT_CH%s, containing IN_INT_RAW_CH?, IN_INT_ST_CH?, IN_INT_ENA_CH?, IN_INT_CLR_CH?</description>
          <addressOffset>0x0</addressOffset>
          <register>
            <name>RAW</name>
            <description>Raw interrupt status of RX channel 0</description>
            <addressOffset>0x0</addressOffset>
            <size>0x20</size>
            <fields>
              <field>
                <name>IN_DONE</name>
                <description>The raw interrupt status of AHB_DMA_IN_DONE_CH%s_INT.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>IN_SUC_EOF</name>
                <description>The raw interrupt status of AHB_DMA_IN_SUC_EOF_CH%s_INT.</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>IN_ERR_EOF</name>
                <description>The raw interrupt status of AHB_DMA_IN_ERR_EOF_CH%s_INT.</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>IN_DSCR_ERR</name>
                <description>The raw interrupt status of AHB_DMA_IN_DSCR_ERR_CH%s_INT.</description>
                <bitOffset>3</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>IN_DSCR_EMPTY</name>
                <description>The raw interrupt status of AHB_DMA_IN_DSCR_EMPTY_CH%s_INT.</description>
                <bitOffset>4</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>INFIFO_OVF</name>
                <description>The raw interrupt status of AHB_DMA_INFIFO_OVF_CH%s_INT.</description>
                <bitOffset>5</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>INFIFO_UDF</name>
                <description>The raw interrupt status of AHB_DMA_INFIFO_UDF_CH%s_INT.</description>
                <bitOffset>6</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>ST</name>
            <description>Masked interrupt status of RX channel 0</description>
            <addressOffset>0x4</addressOffset>
            <size>0x20</size>
            <fields>
              <field>
                <name>IN_DONE</name>
                <description>The masked interrupt status of AHB_DMA_IN_DONE_CH%s_INT.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>IN_SUC_EOF</name>
                <description>The masked interrupt status of AHB_DMA_IN_SUC_EOF_CH%s_INT.</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>IN_ERR_EOF</name>
                <description>The masked interrupt status of AHB_DMA_IN_ERR_EOF_CH%s_INT.</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>IN_DSCR_ERR</name>
                <description>The masked interrupt status of AHB_DMA_IN_DSCR_ERR_CH%s_INT.</description>
                <bitOffset>3</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>IN_DSCR_EMPTY</name>
                <description>The masked interrupt status of AHB_DMA_IN_DSCR_EMPTY_CH%s_INT.</description>
                <bitOffset>4</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>INFIFO_OVF</name>
                <description>The masked interrupt status of AHB_DMA_INFIFO_OVF_CH%s_INT.</description>
                <bitOffset>5</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>INFIFO_UDF</name>
                <description>The masked interrupt status of AHB_DMA_INFIFO_UDF_CH%s_INT.</description>
                <bitOffset>6</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>ENA</name>
            <description>Interrupt enable bits of RX channel 0</description>
            <addressOffset>0x8</addressOffset>
            <size>0x20</size>
            <fields>
              <field>
                <name>IN_DONE</name>
                <description>Write 1 to enable AHB_DMA_IN_DONE_CH%s_INT.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>IN_SUC_EOF</name>
                <description>Write 1 to enable AHB_DMA_IN_SUC_EOF_CH%s_INT.</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>IN_ERR_EOF</name>
                <description>Write 1 to enable AHB_DMA_IN_ERR_EOF_CH%s_INT.</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>IN_DSCR_ERR</name>
                <description>Write 1 to enable AHB_DMA_IN_DSCR_ERR_CH%s_INT.</description>
                <bitOffset>3</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>IN_DSCR_EMPTY</name>
                <description>Write 1 to enable AHB_DMA_IN_DSCR_EMPTY_CH%s_INT.</description>
                <bitOffset>4</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>INFIFO_OVF</name>
                <description>Write 1 to enable AHB_DMA_INFIFO_OVF_CH%s_INT.</description>
                <bitOffset>5</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>INFIFO_UDF</name>
                <description>Write 1 to enable AHB_DMA_INFIFO_UDF_CH%s_INT.</description>
                <bitOffset>6</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>CLR</name>
            <description>Interrupt clear bits of RX channel 0</description>
            <addressOffset>0xC</addressOffset>
            <size>0x20</size>
            <fields>
              <field>
                <name>IN_DONE</name>
                <description>Write 1 to clear AHB_DMA_IN_DONE_CH%s_INT.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>write-only</access>
                <modifiedWriteValues>oneToClear</modifiedWriteValues>
              </field>
              <field>
                <name>IN_SUC_EOF</name>
                <description>Write 1 to clear AHB_DMA_IN_SUC_EOF_CH%s_INT.</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <access>write-only</access>
                <modifiedWriteValues>oneToClear</modifiedWriteValues>
              </field>
              <field>
                <name>IN_ERR_EOF</name>
                <description>Write 1 to clear AHB_DMA_IN_ERR_EOF_CH%s_INT.</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
                <access>write-only</access>
                <modifiedWriteValues>oneToClear</modifiedWriteValues>
              </field>
              <field>
                <name>IN_DSCR_ERR</name>
                <description>Write 1 to clear AHB_DMA_IN_DSCR_ERR_CH%s_INT.</description>
                <bitOffset>3</bitOffset>
                <bitWidth>1</bitWidth>
                <access>write-only</access>
                <modifiedWriteValues>oneToClear</modifiedWriteValues>
              </field>
              <field>
                <name>IN_DSCR_EMPTY</name>
                <description>Write 1 to clear AHB_DMA_IN_DSCR_EMPTY_CH%s_INT.</description>
                <bitOffset>4</bitOffset>
                <bitWidth>1</bitWidth>
                <access>write-only</access>
                <modifiedWriteValues>oneToClear</modifiedWriteValues>
              </field>
              <field>
                <name>INFIFO_OVF</name>
                <description>Write 1 to clear AHB_DMA_INFIFO_OVF_CH%s_INT.</description>
                <bitOffset>5</bitOffset>
                <bitWidth>1</bitWidth>
                <access>write-only</access>
                <modifiedWriteValues>oneToClear</modifiedWriteValues>
              </field>
              <field>
                <name>INFIFO_UDF</name>
                <description>Write 1 to clear AHB_DMA_INFIFO_UDF_CH%s_INT.</description>
                <bitOffset>6</bitOffset>
                <bitWidth>1</bitWidth>
                <access>write-only</access>
                <modifiedWriteValues>oneToClear</modifiedWriteValues>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <dim>3</dim>
          <dimIncrement>0x10</dimIncrement>
          <dimIndex>0-2</dimIndex>
          <name>OUT_INT_CH%s</name>
          <description>Cluster OUT_INT_CH%s, containing OUT_INT_RAW_CH?, OUT_INT_ST_CH?, OUT_INT_ENA_CH?, OUT_INT_CLR_CH?</description>
          <addressOffset>0x30</addressOffset>
          <register>
            <name>RAW</name>
            <description>Raw interrupt status of TX channel 0</description>
            <addressOffset>0x0</addressOffset>
            <size>0x20</size>
            <fields>
              <field>
                <name>OUT_DONE</name>
                <description>The raw interrupt status of AHB_DMA_OUT_DONE_CH%s_INT.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>OUT_EOF</name>
                <description>The raw interrupt status of AHB_DMA_OUT_EOF_CH%s_INT.</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>OUT_DSCR_ERR</name>
                <description>The raw interrupt status of AHB_DMA_OUT_DSCR_ERR_CH%s_INT.</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>OUT_TOTAL_EOF</name>
                <description>The raw interrupt status of AHB_DMA_OUT_TOTAL_EOF_CH%s_INT.</description>
                <bitOffset>3</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>OUTFIFO_OVF</name>
                <description>The raw interrupt status of AHB_DMA_OUTFIFO_OVF_CH%s_INT.</description>
                <bitOffset>4</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>OUTFIFO_UDF</name>
                <description>The raw interrupt status of AHB_DMA_OUTFIFO_UDF_CH%s_INT.</description>
                <bitOffset>5</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>ST</name>
            <description>Masked interrupt status of TX channel 0</description>
            <addressOffset>0x4</addressOffset>
            <size>0x20</size>
            <fields>
              <field>
                <name>OUT_DONE</name>
                <description>The masked interrupt status of AHB_DMA_OUT_DONE_CH%s_INT.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>OUT_EOF</name>
                <description>The masked interrupt status of AHB_DMA_OUT_EOF_CH%s_INT.</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>OUT_DSCR_ERR</name>
                <description>The masked interrupt status of AHB_DMA_OUT_DSCR_ERR_CH%s_INT.</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>OUT_TOTAL_EOF</name>
                <description>The masked interrupt status of AHB_DMA_OUT_TOTAL_EOF_CH%s_INT.</description>
                <bitOffset>3</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>OUTFIFO_OVF</name>
                <description>The masked interrupt status of AHB_DMA_OUTFIFO_OVF_CH%s_INT.</description>
                <bitOffset>4</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>OUTFIFO_UDF</name>
                <description>The masked interrupt status of AHB_DMA_OUTFIFO_UDF_CH%s_INT.</description>
                <bitOffset>5</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>ENA</name>
            <description>Interrupt enable bits of TX channel 0</description>
            <addressOffset>0x8</addressOffset>
            <size>0x20</size>
            <fields>
              <field>
                <name>OUT_DONE</name>
                <description>Write 1 to enable AHB_DMA_OUT_DONE_CH%s_INT.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>OUT_EOF</name>
                <description>Write 1 to enable AHB_DMA_OUT_EOF_CH%s_INT.</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>OUT_DSCR_ERR</name>
                <description>Write 1 to enable AHB_DMA_OUT_DSCR_ERR_CH%s_INT.</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>OUT_TOTAL_EOF</name>
                <description>Write 1 to enable AHB_DMA_OUT_TOTAL_EOF_CH%s_INT.</description>
                <bitOffset>3</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>OUTFIFO_OVF</name>
                <description>Write 1 to enable AHB_DMA_OUTFIFO_OVF_CH%s_INT.</description>
                <bitOffset>4</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>OUTFIFO_UDF</name>
                <description>Write 1 to enable AHB_DMA_OUTFIFO_UDF_CH%s_INT.</description>
                <bitOffset>5</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>CLR</name>
            <description>Interrupt clear bits of TX channel 0</description>
            <addressOffset>0xC</addressOffset>
            <size>0x20</size>
            <fields>
              <field>
                <name>OUT_DONE</name>
                <description>Write 1 to clear AHB_DMA_OUT_DONE_CH%s_INT.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>write-only</access>
                <modifiedWriteValues>oneToClear</modifiedWriteValues>
              </field>
              <field>
                <name>OUT_EOF</name>
                <description>Write 1 to clear AHB_DMA_OUT_EOF_CH%s_INT.</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <access>write-only</access>
                <modifiedWriteValues>oneToClear</modifiedWriteValues>
              </field>
              <field>
                <name>OUT_DSCR_ERR</name>
                <description>Write 1 to clear AHB_DMA_OUT_DSCR_ERR_CH%s_INT.</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
                <access>write-only</access>
                <modifiedWriteValues>oneToClear</modifiedWriteValues>
              </field>
              <field>
                <name>OUT_TOTAL_EOF</name>
                <description>Write 1 to clear AHB_DMA_OUT_TOTAL_EOF_CH%s_INT.</description>
                <bitOffset>3</bitOffset>
                <bitWidth>1</bitWidth>
                <access>write-only</access>
                <modifiedWriteValues>oneToClear</modifiedWriteValues>
              </field>
              <field>
                <name>OUTFIFO_OVF</name>
                <description>Write 1 to clear AHB_DMA_OUTFIFO_OVF_CH%s_INT.</description>
                <bitOffset>4</bitOffset>
                <bitWidth>1</bitWidth>
                <access>write-only</access>
                <modifiedWriteValues>oneToClear</modifiedWriteValues>
              </field>
              <field>
                <name>OUTFIFO_UDF</name>
                <description>Write 1 to clear AHB_DMA_OUTFIFO_UDF_CH%s_INT.</description>
                <bitOffset>5</bitOffset>
                <bitWidth>1</bitWidth>
                <access>write-only</access>
                <modifiedWriteValues>oneToClear</modifiedWriteValues>
              </field>
            </fields>
          </register>
        </cluster>
        <register>
          <name>AHB_TEST</name>
          <description>reserved</description>
          <addressOffset>0x60</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>AHB_TESTMODE</name>
              <description>reserved</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AHB_TESTADDR</name>
              <description>reserved</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MISC_CONF</name>
          <description>Miscellaneous register</description>
          <addressOffset>0x64</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>AHBM_RST_INTER</name>
              <description>Write 1 and then 0 to reset the internal AHB FSM.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ARB_PRI_DIS</name>
              <description>Configures whether or not to disable the fixed-priority channel arbitration.\\0: Enable\\1: Disable\\</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CLK_EN</name>
              <description>Configures clock gating.\\0: Support clock only when the application writes registers.\\ 1: Always force the clock on for registers.\\</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register derivedFrom="AES.DATE">
          <name>DATE</name>
          <description>Version control register</description>
          <addressOffset>0x68</addressOffset>
        </register>
