espressif/esp-bist/src/soc/esp32c5/esp32c5.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>ASSIST_DEBUG</name>
      <description>ASSIST_DEBUG (BUS_MONITOR) Peripheral</description>
      <groupName>ASSIST_DEBUG</groupName>
      <baseAddress>0x600C2000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x88</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>ASSIST_DEBUG</name>
        <value>27</value>
      </interrupt>
      <registers>
        <cluster>
          <dim>1</dim>
          <dimIncrement>0x9C</dimIncrement>
          <dimIndex>0-0</dimIndex>
          <name>CPU%s</name>
          <description>Cluster CPU%s, containing CORE_?_DEBUG_MODE, CORE_?_AREA_DRAM0_0_MAX, CORE_?_AREA_DRAM0_0_MIN, CORE_?_AREA_DRAM0_1_MAX, CORE_?_AREA_DRAM0_1_MIN, CORE_?_AREA_PC, CORE_?_AREA_PIF_0_MAX, CORE_?_AREA_PIF_0_MIN, CORE_?_AREA_PIF_1_MAX, CORE_?_AREA_PIF_1_MIN, CORE_?_AREA_SP, CORE_?_DRAM0_EXCEPTION_MONITOR_0, CORE_?_DRAM0_EXCEPTION_MONITOR_1, CORE_?_DRAM0_EXCEPTION_MONITOR_2, CORE_?_DRAM0_EXCEPTION_MONITOR_3, CORE_?_INTR_CLR, CORE_?_INTR_ENA, CORE_?_INTR_RAW, CORE_?_IRAM0_EXCEPTION_MONITOR_0, CORE_?_IRAM0_EXCEPTION_MONITOR_1, CORE_?_LASTPC_BEFORE_EXCEPTION, CORE_?_MONTR_ENA, CORE_?_RCD_EN, CORE_?_RCD_PDEBUGPC, CORE_?_RCD_PDEBUGSP, CORE_?_SP_MAX, CORE_?_SP_MIN, CORE_?_SP_PC</description>
          <addressOffset>0x0</addressOffset>
          <register>
            <name>DEBUG_MODE</name>
            <description>cpu status register</description>
            <addressOffset>0x74</addressOffset>
            <size>0x20</size>
            <fields>
              <field>
                <name>DEBUG_MODE</name>
                <description>Represents whether RISC-V CPU (HP CPU) is in debugging mode.\\
1: In debugging mode\\
0: Not in debugging mode\\</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>DEBUG_MODULE_ACTIVE</name>
                <description>Represents the status of the RISC-V CPU (HP CPU) debug module.\\
1: Active status\\
Other: Inactive status\\</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>AREA_DRAM0_0_MAX</name>
            <description>Configures upper boundary address of region 0 monitored on Data bus</description>
            <addressOffset>0x14</addressOffset>
            <size>0x20</size>
            <fields>
              <field>
                <name>AREA_DRAM0_0_MAX</name>
                <description>Configures the upper bound address of Data bus region 0.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>AREA_DRAM0_0_MIN</name>
            <description>Configures lower boundary address of region 0 monitored on Data bus</description>
            <addressOffset>0x10</addressOffset>
            <size>0x20</size>
            <resetValue>0xFFFFFFFF</resetValue>
            <fields>
              <field>
                <name>AREA_DRAM0_0_MIN</name>
                <description>Configures the lower bound address of Data bus region 0.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>AREA_DRAM0_1_MAX</name>
            <description>Configures upper boundary address of region 1 monitored on Data bus</description>
            <addressOffset>0x1C</addressOffset>
            <size>0x20</size>
            <fields>
              <field>
                <name>AREA_DRAM0_1_MAX</name>
                <description>Configures the upper bound address of Data bus region 1.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>AREA_DRAM0_1_MIN</name>
            <description>Configures lower boundary address of region 1 monitored on Data bus</description>
            <addressOffset>0x18</addressOffset>
            <size>0x20</size>
            <resetValue>0xFFFFFFFF</resetValue>
            <fields>
              <field>
                <name>AREA_DRAM0_1_MIN</name>
                <description>Configures the lower bound address of Data bus region 1.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>AREA_PC</name>
            <description>Region monitoring HP CPU PC status register</description>
            <addressOffset>0x30</addressOffset>
            <size>0x20</size>
            <fields>
              <field>
                <name>AREA_PC</name>
                <description>Represents the PC value when an interrupt is triggered during region monitoring.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>AREA_PIF_0_MAX</name>
            <description>Configures upper boundary address of region 0 monitored on Peripheral bus</description>
            <addressOffset>0x24</addressOffset>
            <size>0x20</size>
            <fields>
              <field>
                <name>AREA_PIF_0_MAX</name>
                <description>Configures the upper bound address of Peripheral bus region 0.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>AREA_PIF_0_MIN</name>
            <description>Configures lower boundary address of region 0 monitored on Peripheral bus</description>
            <addressOffset>0x20</addressOffset>
            <size>0x20</size>
            <resetValue>0xFFFFFFFF</resetValue>
            <fields>
              <field>
                <name>AREA_PIF_0_MIN</name>
                <description>Configures the lower bound address of Peripheral bus region 0.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>AREA_PIF_1_MAX</name>
            <description>Configures upper boundary address of region 1 monitored on Peripheral bus</description>
            <addressOffset>0x2C</addressOffset>
            <size>0x20</size>
            <fields>
              <field>
                <name>AREA_PIF_1_MAX</name>
                <description>Configures the upper bound address of Peripheral bus region 1.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>AREA_PIF_1_MIN</name>
            <description>Configures lower boundary address of region 1 monitored on Peripheral bus</description>
            <addressOffset>0x28</addressOffset>
            <size>0x20</size>
            <resetValue>0xFFFFFFFF</resetValue>
            <fields>
              <field>
                <name>AREA_PIF_1_MIN</name>
                <description>Configures the lower bound address of Peripheral bus region 1.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>AREA_SP</name>
            <description>Region monitoring HP CPU SP status register</description>
            <addressOffset>0x34</addressOffset>
            <size>0x20</size>
            <fields>
              <field>
                <name>AREA_SP</name>
                <description>Represents the SP value when an interrupt is triggered during region monitoring.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>DRAM0_EXCEPTION_MONITOR_0</name>
            <description>exception monitor status register2</description>
            <addressOffset>0x58</addressOffset>
            <size>0x20</size>
            <fields>
              <field>
                <name>DRAM0_RECORDING_WR_0</name>
                <description>reg_core_0_dram0_recording_wr_0</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>DRAM0_RECORDING_BYTEEN_0</name>
                <description>reg_core_0_dram0_recording_byteen_0</description>
                <bitOffset>1</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>DRAM0_EXCEPTION_MONITOR_1</name>
            <description>exception monitor status register3</description>
            <addressOffset>0x5C</addressOffset>
            <size>0x20</size>
            <fields>
              <field>
                <name>DRAM0_RECORDING_ADDR_0</name>
                <description>reg_core_0_dram0_recording_addr_0</description>
                <bitOffset>0</bitOffset>
                <bitWidth>30</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>DRAM0_EXCEPTION_MONITOR_2</name>
            <description>exception monitor status register4</description>
            <addressOffset>0x60</addressOffset>
            <size>0x20</size>
            <fields>
              <field>
                <name>DRAM0_RECORDING_PC_0</name>
                <description>reg_core_0_dram0_recording_pc_0</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>DRAM0_EXCEPTION_MONITOR_3</name>
            <description>exception monitor status register5</description>
            <addressOffset>0x64</addressOffset>
            <size>0x20</size>
            <fields>
              <field>
                <name>DRAM0_RECORDING_WR_1</name>
                <description>reg_core_0_dram0_recording_wr_1</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>DRAM0_RECORDING_BYTEEN_1</name>
                <description>reg_core_0_dram0_recording_byteen_1</description>
                <bitOffset>1</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>INTR_CLR</name>
            <description>core0 monitor interrupt clear register</description>
            <addressOffset>0xC</addressOffset>
            <size>0x20</size>
            <fields>
              <field>
                <name>AREA_DRAM0_0_RD_CLR</name>
                <description>Write 1 to clear the interrupt for read operations in region 0 by Data bus.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>write-only</access>
              </field>
              <field>
                <name>AREA_DRAM0_0_WR_CLR</name>
                <description>Write 1 to clear the interrupt for write operations in region 0 by Data bus.</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <access>write-only</access>
              </field>
              <field>
                <name>AREA_DRAM0_1_RD_CLR</name>
                <description>Write 1 to clear the interrupt for read operations in region 1 by Data bus.</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
                <access>write-only</access>
              </field>
              <field>
                <name>AREA_DRAM0_1_WR_CLR</name>
                <description>Write 1 to clear the interrupt for write operations in region 1 by Data bus.</description>
                <bitOffset>3</bitOffset>
                <bitWidth>1</bitWidth>
                <access>write-only</access>
              </field>
              <field>
                <name>AREA_PIF_0_RD_CLR</name>
                <description>Write 1 to clear the interrupt for read operations in region 0 by Peripheral bus.</description>
                <bitOffset>4</bitOffset>
                <bitWidth>1</bitWidth>
                <access>write-only</access>
              </field>
              <field>
                <name>AREA_PIF_0_WR_CLR</name>
                <description>Write 1 to clear the interrupt for write operations in region 0 by Peripheral bus.</description>
                <bitOffset>5</bitOffset>
                <bitWidth>1</bitWidth>
                <access>write-only</access>
              </field>
              <field>
                <name>AREA_PIF_1_RD_CLR</name>
                <description>Write 1 to clear the interrupt for read operations in region 1 by Peripheral bus.</description>
                <bitOffset>6</bitOffset>
                <bitWidth>1</bitWidth>
                <access>write-only</access>
              </field>
              <field>
                <name>AREA_PIF_1_WR_CLR</name>
                <description>Write 1 to clear the interrupt for write operations in region 1 by Peripheral bus.</description>
                <bitOffset>7</bitOffset>
                <bitWidth>1</bitWidth>
                <access>write-only</access>
              </field>
              <field>
                <name>SP_SPILL_MIN_CLR</name>
                <description>Write 1 to clear the interrupt for SP exceeding the lower bound address of SP monitored region.</description>
                <bitOffset>8</bitOffset>
                <bitWidth>1</bitWidth>
                <access>write-only</access>
              </field>
              <field>
                <name>SP_SPILL_MAX_CLR</name>
                <description>Write 1 to clear the interrupt for SP exceeding the upper bound address of SP monitored region.</description>
                <bitOffset>9</bitOffset>
                <bitWidth>1</bitWidth>
                <access>write-only</access>
              </field>
              <field>
                <name>IRAM0_EXCEPTION_MONITOR_CLR</name>
                <description>IBUS busy monitor interrupt clr</description>
                <bitOffset>10</bitOffset>
                <bitWidth>1</bitWidth>
                <access>write-only</access>
              </field>
              <field>
                <name>DRAM0_EXCEPTION_MONITOR_CLR</name>
                <description>DBUS busy monitor interrupt clr</description>
                <bitOffset>11</bitOffset>
                <bitWidth>1</bitWidth>
                <access>write-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>INTR_ENA</name>
            <description>core0 monitor interrupt enable register</description>
            <addressOffset>0x8</addressOffset>
            <size>0x20</size>
            <fields>
              <field>
                <name>AREA_DRAM0_0_RD_INTR_ENA</name>
                <description>Core0 dram0 area0 read monitor interrupt enable</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>AREA_DRAM0_0_WR_INTR_ENA</name>
                <description>Core0 dram0 area0 write monitor interrupt enable</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>AREA_DRAM0_1_RD_INTR_ENA</name>
                <description>Core0 dram0 area1 read monitor interrupt enable</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>AREA_DRAM0_1_WR_INTR_ENA</name>
                <description>Core0 dram0 area1 write monitor interrupt enable</description>
                <bitOffset>3</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>AREA_PIF_0_RD_INTR_ENA</name>
                <description>Core0 PIF area0 read monitor interrupt enable</description>
                <bitOffset>4</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>AREA_PIF_0_WR_INTR_ENA</name>
                <description>Core0 PIF area0 write monitor interrupt enable</description>
                <bitOffset>5</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>AREA_PIF_1_RD_INTR_ENA</name>
                <description>Core0 PIF area1 read monitor interrupt enable</description>
                <bitOffset>6</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>AREA_PIF_1_WR_INTR_ENA</name>
                <description>Core0 PIF area1 write monitor interrupt enable</description>
                <bitOffset>7</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>SP_SPILL_MIN_INTR_ENA</name>
                <description>Core0 stackpoint underflow monitor interrupt enable</description>
                <bitOffset>8</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>SP_SPILL_MAX_INTR_ENA</name>
                <description>Core0 stackpoint overflow monitor interrupt enable</description>
                <bitOffset>9</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>IRAM0_EXCEPTION_MONITOR_INTR_ENA</name>
                <description>IBUS busy monitor interrupt enable</description>
                <bitOffset>10</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DRAM0_EXCEPTION_MONITOR_INTR_ENA</name>
                <description>DBUS busy monitor interrupt enbale</description>
                <bitOffset>11</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
