espressif/esp-bist/src/soc/esp32c5/esp32c5.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>DS</name>
      <description>Digital Signature</description>
      <groupName>DS</groupName>
      <baseAddress>0x6008C000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0xA5C</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <dim>128</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>Y_MEM[%s]</name>
          <description>memory that stores Y</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <dim>128</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>M_MEM[%s]</name>
          <description>memory that stores M</description>
          <addressOffset>0x200</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <dim>128</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>RB_MEM[%s]</name>
          <description>memory that stores Rb</description>
          <addressOffset>0x400</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <dim>12</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>BOX_MEM[%s]</name>
          <description>memory that stores BOX</description>
          <addressOffset>0x600</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <dim>4</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>IV_MEM[%s]</name>
          <description>memory that stores IV</description>
          <addressOffset>0x630</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <dim>128</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>X_MEM[%s]</name>
          <description>memory that stores X</description>
          <addressOffset>0x800</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <dim>128</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>Z_MEM[%s]</name>
          <description>memory that stores Z</description>
          <addressOffset>0xA00</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>SET_START</name>
          <description>DS start control register</description>
          <addressOffset>0xE00</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SET_START</name>
              <description>set this bit to start DS operation.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SET_CONTINUE</name>
          <description>DS continue control register</description>
          <addressOffset>0xE04</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SET_CONTINUE</name>
              <description>set this bit to continue DS operation.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SET_FINISH</name>
          <description>DS finish control register</description>
          <addressOffset>0xE08</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SET_FINISH</name>
              <description>Set this bit to finish DS process.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>QUERY_BUSY</name>
          <description>DS query busy register</description>
          <addressOffset>0xE0C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>QUERY_BUSY</name>
              <description>digital signature state. 1'b0: idle, 1'b1: busy</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>QUERY_KEY_WRONG</name>
          <description>DS query key-wrong counter register</description>
          <addressOffset>0xE10</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>QUERY_KEY_WRONG</name>
              <description>digital signature key wrong counter</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>QUERY_CHECK</name>
          <description>DS query check result register</description>
          <addressOffset>0xE14</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>MD_ERROR</name>
              <description>MD checkout result. 1'b0: MD check pass, 1'b1: MD check fail</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PADDING_BAD</name>
              <description>padding checkout result. 1'b0: a good padding, 1'b1: a bad padding</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register derivedFrom="AES.DATE">
          <name>DATE</name>
          <description>DS version control register</description>
          <addressOffset>0xE20</addressOffset>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>ECC</name>
      <description>ECC (ECC Hardware Accelerator)</description>
      <groupName>ECC_MULT</groupName>
      <baseAddress>0x6008B000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0xD8</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>ECC</name>
        <value>81</value>
      </interrupt>
      <registers>
        <register>
          <name>INT_RAW</name>
          <description>ECC raw interrupt status register</description>
          <addressOffset>0xC</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CALC_DONE</name>
              <description>The raw interrupt status of the ECC_CALC_DONE_INT interrupt.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_ST</name>
          <description>ECC masked interrupt status register</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CALC_DONE</name>
              <description>The masked interrupt status of the ECC_CALC_DONE_INT interrupt.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_ENA</name>
          <description>ECC interrupt enable register</description>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CALC_DONE</name>
              <description>Write 1 to enable the ECC_CALC_DONE_INT interrupt.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_CLR</name>
          <description>ECC interrupt clear register</description>
          <addressOffset>0x18</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CALC_DONE</name>
              <description>Write 1 to clear the ECC_CALC_DONE_INT interrupt.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
          </fields>
        </register>
        <register>
          <name>MULT_CONF</name>
          <description>ECC configuration register</description>
          <addressOffset>0x1C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>START</name>
              <description>Configures whether to start calculation of ECC Accelerator. This bit will be self-cleared after the calculation is done. \\
0: No effect\\
1: Start calculation of ECC Accelerator\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RESET</name>
              <description>Configures whether to reset ECC Accelerator. \\
0: No effect\\
1: Reset\\</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>KEY_LENGTH</name>
              <description>Configures the key length mode bit of ECC Accelerator. \\
0: P-192\\
1: P-256\\
2: P-384\\</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <name>KEY_LENGTH</name>
                <enumeratedValue>
                  <name>P192</name>
                  <description>P-192 elliptic curve</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P256</name>
                  <description>P-256 elliptic curve</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P384</name>
                  <description>P-384 elliptic curve</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MOD_BASE</name>
              <description>Configures the mod base of mod operation, only valid in work_mode 8-11. \\
0: n(order of curve)\\
1: p(mod base of curve)\\</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WORK_MODE</name>
              <description>Configures the work mode of ECC Accelerator.\\
0: Point Multi mode\\
1: Reserved\\
2: Point Verif mode\\
3: Point Verif + Multi mode\\
4: Jacobian Point Multi mode\\
5: Reserved\\
6: Jacobian Point Verif mode\\
7: Point Verif + Jacobian Point Multi mode\\
8: Mod Add mode\\
9. Mod Sub mode\\
10: Mod Multi mode\\
11: Mod Div mode\\</description>
              <bitOffset>5</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SECURITY_MODE</name>
              <description>Configures the security mode of ECC Accelerator.\\
0: no secure function enabled.\\
1: enable constant-time calculation in all point multiplication modes.\\</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VERIFICATION_RESULT</name>
              <description>Represents the verification result of ECC Accelerator, valid only when calculation is done.</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CLK_EN</name>
              <description>Configures whether to force on register clock gate. \\
0: No effect\\
1: Force on\\</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MEM_CLOCK_GATE_FORCE_ON</name>
              <description>Configures whether to force on ECC memory clock gate. \\
0: No effect\\
1: Force on\\</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register derivedFrom="AES.DATE">
          <name>DATE</name>
          <description>Version control register</description>
          <addressOffset>0xFC</addressOffset>
        </register>
        <register>
          <dim>12</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>K_MEM[%s]</name>
          <description>The memory that stores k.</description>
          <addressOffset>0x100</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <dim>12</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>PX_MEM[%s]</name>
          <description>The memory that stores Px.</description>
          <addressOffset>0x130</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <dim>12</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>PY_MEM[%s]</name>
          <description>The memory that stores Py.</description>
          <addressOffset>0x160</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <dim>12</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>QX_MEM[%s]</name>
          <description>The memory that stores Qx.</description>
          <addressOffset>0x190</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <dim>12</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>QY_MEM[%s]</name>
          <description>The memory that stores Qy.</description>
          <addressOffset>0x1C0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <dim>12</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>QZ_MEM[%s]</name>
          <description>The memory that stores Qz.</description>
          <addressOffset>0x1F0</addressOffset>
          <size>0x20</size>
        </register>
