espressif/esp-bist/src/soc/esp32c5/esp32c5.svd
        <register>
          <name>BLK6_W4</name>
          <description>eFuse apb2otp block6 data register4.</description>
          <addressOffset>0x634</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>BLOCK6_W4</name>
              <description>Otp block6 word4 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BLK6_W5</name>
          <description>eFuse apb2otp block6 data register5.</description>
          <addressOffset>0x638</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>BLOCK6_W5</name>
              <description>Otp block6 word5 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BLK6_W6</name>
          <description>eFuse apb2otp block6 data register6.</description>
          <addressOffset>0x63C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>BLOCK6_W6</name>
              <description>Otp block6 word6 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BLK6_W7</name>
          <description>eFuse apb2otp block6 data register7.</description>
          <addressOffset>0x640</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>BLOCK6_W7</name>
              <description>Otp block6 word7 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BLK6_W8</name>
          <description>eFuse apb2otp block6 data register8.</description>
          <addressOffset>0x644</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>BLOCK6_W8</name>
              <description>Otp block6 word8 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BLK6_W9</name>
          <description>eFuse apb2otp block6 data register9.</description>
          <addressOffset>0x648</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>BLOCK6_W9</name>
              <description>Otp block6 word9 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BLK6_W10</name>
          <description>eFuse apb2otp block6 data register10.</description>
          <addressOffset>0x64C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>BLOCK6_W10</name>
              <description>Otp block6 word10 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BLK6_W11</name>
          <description>eFuse apb2otp block6 data register11.</description>
          <addressOffset>0x650</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>BLOCK6_W11</name>
              <description>Otp block6 word11 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BLK7_W1</name>
          <description>eFuse apb2otp block7 data register1.</description>
          <addressOffset>0x654</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>BLOCK7_W1</name>
              <description>Otp block7 word1 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BLK7_W2</name>
          <description>eFuse apb2otp block7 data register2.</description>
          <addressOffset>0x658</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>BLOCK7_W2</name>
              <description>Otp block7 word2 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BLK7_W3</name>
          <description>eFuse apb2otp block7 data register3.</description>
          <addressOffset>0x65C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>BLOCK7_W3</name>
              <description>Otp block7 word3 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BLK7_W4</name>
          <description>eFuse apb2otp block7 data register4.</description>
          <addressOffset>0x660</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>BLOCK7_W4</name>
              <description>Otp block7 word4 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BLK7_W5</name>
          <description>eFuse apb2otp block7 data register5.</description>
          <addressOffset>0x664</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>BLOCK7_W5</name>
              <description>Otp block7 word5 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BLK7_W6</name>
          <description>eFuse apb2otp block7 data register6.</description>
          <addressOffset>0x668</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>BLOCK7_W6</name>
              <description>Otp block7 word6 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BLK7_W7</name>
          <description>eFuse apb2otp block7 data register7.</description>
          <addressOffset>0x66C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>BLOCK7_W7</name>
              <description>Otp block7 word7 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BLK7_W8</name>
          <description>eFuse apb2otp block7 data register8.</description>
          <addressOffset>0x670</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>BLOCK7_W8</name>
              <description>Otp block7 word8 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BLK7_W9</name>
          <description>eFuse apb2otp block7 data register9.</description>
          <addressOffset>0x674</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>BLOCK7_W9</name>
              <description>Otp block7 word9 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BLK7_W10</name>
          <description>eFuse apb2otp block7 data register10.</description>
          <addressOffset>0x678</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>BLOCK7_W10</name>
              <description>Otp block7 word10 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BLK7_W11</name>
          <description>eFuse apb2otp block7 data register11.</description>
          <addressOffset>0x67C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>BLOCK7_W11</name>
              <description>Otp block7 word11 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BLK8_W1</name>
          <description>eFuse apb2otp block8 data register1.</description>
          <addressOffset>0x680</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>BLOCK8_W1</name>
              <description>Otp block8 word1 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BLK8_W2</name>
          <description>eFuse apb2otp block8 data register2.</description>
          <addressOffset>0x684</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>BLOCK8_W2</name>
              <description>Otp block8 word2 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BLK8_W3</name>
          <description>eFuse apb2otp block8 data register3.</description>
          <addressOffset>0x688</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>BLOCK8_W3</name>
              <description>Otp block8 word3 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BLK8_W4</name>
          <description>eFuse apb2otp block8 data register4.</description>
          <addressOffset>0x68C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>BLOCK8_W4</name>
              <description>Otp block8 word4 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BLK8_W5</name>
          <description>eFuse apb2otp block8 data register5.</description>
          <addressOffset>0x690</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>BLOCK8_W5</name>
              <description>Otp block8 word5 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BLK8_W6</name>
          <description>eFuse apb2otp block8 data register6.</description>
          <addressOffset>0x694</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>BLOCK8_W6</name>
              <description>Otp block8 word6 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BLK8_W7</name>
          <description>eFuse apb2otp block8 data register7.</description>
          <addressOffset>0x698</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>BLOCK8_W7</name>
              <description>Otp block8 word7 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BLK8_W8</name>
          <description>eFuse apb2otp block8 data register8.</description>
          <addressOffset>0x69C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>BLOCK8_W8</name>
              <description>Otp block8 word8 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BLK8_W9</name>
          <description>eFuse apb2otp block8 data register9.</description>
          <addressOffset>0x6A0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>BLOCK8_W9</name>
              <description>Otp block8 word9 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BLK8_W10</name>
          <description>eFuse apb2otp block8 data register10.</description>
          <addressOffset>0x6A4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>BLOCK8_W10</name>
              <description>Otp block8 word10 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BLK8_W11</name>
          <description>eFuse apb2otp block8 data register11.</description>
          <addressOffset>0x6A8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>BLOCK8_W11</name>
              <description>Otp block8 word11 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BLK9_W1</name>
          <description>eFuse apb2otp block9 data register1.</description>
          <addressOffset>0x6AC</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>BLOCK9_W1</name>
              <description>Otp block9 word1 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BLK9_W2</name>
          <description>eFuse apb2otp block9 data register2.</description>
          <addressOffset>0x6B0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>BLOCK9_W2</name>
              <description>Otp block9 word2 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BLK9_W3</name>
          <description>eFuse apb2otp block9 data register3.</description>
          <addressOffset>0x6B4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>BLOCK9_W3</name>
              <description>Otp block9 word3 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BLK9_W4</name>
          <description>eFuse apb2otp block9 data register4.</description>
          <addressOffset>0x6B8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>BLOCK9_W4</name>
              <description>Otp block9 word4 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BLK9_W5</name>
          <description>eFuse apb2otp block9 data register5.</description>
          <addressOffset>0x6BC</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>BLOCK9_W5</name>
              <description>Otp block9 word5 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BLK9_W6</name>
          <description>eFuse apb2otp block9 data register6.</description>
          <addressOffset>0x6C0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>BLOCK9_W6</name>
              <description>Otp block9 word6 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BLK9_W7</name>
          <description>eFuse apb2otp block9 data register7.</description>
          <addressOffset>0x6C4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>BLOCK9_W7</name>
              <description>Otp block9 word7 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BLK9_W8</name>
          <description>eFuse apb2otp block9 data register8.</description>
          <addressOffset>0x6C8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>BLOCK9_W8</name>
              <description>Otp block9 word8 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BLK9_W9</name>
          <description>eFuse apb2otp block9 data register9.</description>
          <addressOffset>0x6CC</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>BLOCK9_W9</name>
              <description>Otp block9 word9 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BLK9_W10</name>
          <description>eFuse apb2otp block9 data register10.</description>
          <addressOffset>0x6D0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>BLOCK9_W10</name>
              <description>Otp block9 word10 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BLK9_W11</name>
          <description>eFuse apb2otp block9 data register11.</description>
          <addressOffset>0x6D4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>BLOCK9_W11</name>
              <description>Otp block9 word11 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BLK10_W1</name>
          <description>eFuse apb2otp block10 data register1.</description>
          <addressOffset>0x6D8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>BLOCK10_W1</name>
              <description>Otp block10 word1 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BLK10_W2</name>
          <description>eFuse apb2otp block10 data register2.</description>
          <addressOffset>0x6DC</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>BLOCK10_W2</name>
              <description>Otp block10 word2 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BLK10_W3</name>
          <description>eFuse apb2otp block10 data register3.</description>
          <addressOffset>0x6E0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>BLOCK10_W3</name>
              <description>Otp block10 word3 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BLK10_W4</name>
          <description>eFuse apb2otp block10 data register4.</description>
          <addressOffset>0x6E4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>BLOCK10_W4</name>
              <description>Otp block10 word4 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BLK10_W5</name>
          <description>eFuse apb2otp block10 data register5.</description>
          <addressOffset>0x6E8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>BLOCK10_W5</name>
              <description>Otp block10 word5 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
