espressif/esp-bist/src/soc/esp32c5/esp32c5.svd
For the detailed signal list, see Table &lt;a href=tab:iomuxgpio-periph-signals-via-gpio-matrix"&gt;link&lt;/a&gt;.
"</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INV_SEL</name>
              <description>Configures whether or not to invert the output value.\\
0: Not invert\\
1: Invert\\</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OEN_SEL</name>
              <description>Configures to select the source of output enable signal.\\
0: Use output enable signal from peripheral.\\
1: Force the output enable signal to be sourced from bit 10 of GPIO_ENABLE_REG. \\</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OEN_INV_SEL</name>
              <description>Configures whether or not to invert the output enable signal.\\
0: Not invert\\
1: Invert\\</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FUNC30_OUT_SEL_CFG</name>
          <description>Configuration register for GPIO$n output</description>
          <addressOffset>0xB4C</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000100</resetValue>
          <fields>
            <field>
              <name>OUT_SEL</name>
              <description>Configures to select a signal 0 (0 &lt;= 0 &lt; 256) from 256 peripheral signals to be output from GPIO0.\\
0: Select signal 0\\
1: Select signal 1\\
......\\
254: Select signal 254\\
255: Select signal 255\\
Or\\
256: Bit 0 of GPIO_OUT_REG and GPIO_ENABLE_REG are selected as the output value and output enable.

For the detailed signal list, see Table &lt;a href=tab:iomuxgpio-periph-signals-via-gpio-matrix"&gt;link&lt;/a&gt;.
"</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INV_SEL</name>
              <description>Configures whether or not to invert the output value.\\
0: Not invert\\
1: Invert\\</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OEN_SEL</name>
              <description>Configures to select the source of output enable signal.\\
0: Use output enable signal from peripheral.\\
1: Force the output enable signal to be sourced from bit 10 of GPIO_ENABLE_REG. \\</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OEN_INV_SEL</name>
              <description>Configures whether or not to invert the output enable signal.\\
0: Not invert\\
1: Invert\\</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FUNC31_OUT_SEL_CFG</name>
          <description>Configuration register for GPIO$n output</description>
          <addressOffset>0xB50</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000100</resetValue>
          <fields>
            <field>
              <name>OUT_SEL</name>
              <description>Configures to select a signal 0 (0 &lt;= 0 &lt; 256) from 256 peripheral signals to be output from GPIO0.\\
0: Select signal 0\\
1: Select signal 1\\
......\\
254: Select signal 254\\
255: Select signal 255\\
Or\\
256: Bit 0 of GPIO_OUT_REG and GPIO_ENABLE_REG are selected as the output value and output enable.

For the detailed signal list, see Table &lt;a href=tab:iomuxgpio-periph-signals-via-gpio-matrix"&gt;link&lt;/a&gt;.
"</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INV_SEL</name>
              <description>Configures whether or not to invert the output value.\\
0: Not invert\\
1: Invert\\</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OEN_SEL</name>
              <description>Configures to select the source of output enable signal.\\
0: Use output enable signal from peripheral.\\
1: Force the output enable signal to be sourced from bit 10 of GPIO_ENABLE_REG. \\</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OEN_INV_SEL</name>
              <description>Configures whether or not to invert the output enable signal.\\
0: Not invert\\
1: Invert\\</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FUNC32_OUT_SEL_CFG</name>
          <description>Configuration register for GPIO$n output</description>
          <addressOffset>0xB54</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000100</resetValue>
          <fields>
            <field>
              <name>OUT_SEL</name>
              <description>Configures to select a signal 0 (0 &lt;= 0 &lt; 256) from 256 peripheral signals to be output from GPIO0.\\
0: Select signal 0\\
1: Select signal 1\\
......\\
254: Select signal 254\\
255: Select signal 255\\
Or\\
256: Bit 0 of GPIO_OUT_REG and GPIO_ENABLE_REG are selected as the output value and output enable.

For the detailed signal list, see Table &lt;a href=tab:iomuxgpio-periph-signals-via-gpio-matrix"&gt;link&lt;/a&gt;.
"</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INV_SEL</name>
              <description>Configures whether or not to invert the output value.\\
0: Not invert\\
1: Invert\\</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OEN_SEL</name>
              <description>Configures to select the source of output enable signal.\\
0: Use output enable signal from peripheral.\\
1: Force the output enable signal to be sourced from bit 10 of GPIO_ENABLE_REG. \\</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OEN_INV_SEL</name>
              <description>Configures whether or not to invert the output enable signal.\\
0: Not invert\\
1: Invert\\</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CLOCK_GATE</name>
          <description>GPIO clock gate register</description>
          <addressOffset>0xDF8</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>CLK_EN</name>
              <description>Configures whether or not to enable clock gate.\\
0: Not enable\\
1: Enable, the clock is free running. \\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register derivedFrom="AES.DATE">
          <name>DATE</name>
          <description>GPIO version register</description>
          <addressOffset>0xDFC</addressOffset>
        </register>
