espressif/esp-bist/src/soc/esp32c5/esp32c5.svd
        <register>
          <name>ETM_TASK_P2_CFG</name>
          <description>GPIO selection register 2 for ETM</description>
          <addressOffset>0x160</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>ETM_TASK_GPIO10_SEL</name>
              <description>Configures to select an ETM task channel for GPIO0.\\
0: Select channel 0\\
1: Select channel 1\\
......\\
7: Select channel 7\\%\label{fielddesc:GPIOSDETMTASKGPIO1EN}- [GPIOSD_ETM_TASK_GPIO1_EN] Enable bit of GPIO response etm task. %\label{fielddesc:GPIOSDETMTASKGPIO1SEL}- [GPIOSD_ETM_TASK_GPIO1_SEL] GPIO choose a etm task channel. %\label{fielddesc:GPIOSDETMTASKGPIO2EN}- [GPIOSD_ETM_TASK_GPIO2_EN] Enable bit of GPIO response etm task. %\label{fielddesc:GPIOSDETMTASKGPIO2SEL}- [GPIOSD_ETM_TASK_GPIO2_SEL] GPIO choose a etm task channel. %\label{fielddesc:GPIOSDETMTASKGPIO3EN}\item [GPIOSD_ETM_TASK_GPIO3_EN] Enable bit of GPIO response etm task. %\label{fielddesc:GPIOSDETMTASKGPIO3SEL}\item [GPIOSD_ETM_TASK_GPIO3_SEL] GPIO choose a etm task channel.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ETM_TASK_GPIO10_EN</name>
              <description>Configures whether or not to enable GPIO5 to response ETM task.\\
0: Not enable\\
1: Enable\\</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ETM_TASK_GPIO11_SEL</name>
              <description>Configures to select an ETM task channel for GPIO6.\\
0: Select channel 0\\
1: Select channel 1\\
......\\
7: Select channel 7\\%\label{fielddesc:GPIOSDETMTASKGPIO1EN}- [GPIOSD_ETM_TASK_GPIO1_EN] Enable bit of GPIO response etm task. %\label{fielddesc:GPIOSDETMTASKGPIO1SEL}- [GPIOSD_ETM_TASK_GPIO1_SEL] GPIO choose a etm task channel. %\label{fielddesc:GPIOSDETMTASKGPIO2EN}- [GPIOSD_ETM_TASK_GPIO2_EN] Enable bit of GPIO response etm task. %\label{fielddesc:GPIOSDETMTASKGPIO2SEL}- [GPIOSD_ETM_TASK_GPIO2_SEL] GPIO choose a etm task channel. %\label{fielddesc:GPIOSDETMTASKGPIO3EN}\item [GPIOSD_ETM_TASK_GPIO3_EN] Enable bit of GPIO response etm task. %\label{fielddesc:GPIOSDETMTASKGPIO3SEL}\item [GPIOSD_ETM_TASK_GPIO3_SEL] GPIO choose a etm task channel.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ETM_TASK_GPIO11_EN</name>
              <description>Configures whether or not to enable GPIO11 to response ETM task.\\
0: Not enable\\
1: Enable\\</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ETM_TASK_GPIO12_SEL</name>
              <description>Configures to select an ETM task channel for GPIO12.\\
0: Select channel 0\\
1: Select channel 1\\
......\\
7: Select channel 7\\%\label{fielddesc:GPIOSDETMTASKGPIO1EN}- [GPIOSD_ETM_TASK_GPIO1_EN] Enable bit of GPIO response etm task. %\label{fielddesc:GPIOSDETMTASKGPIO1SEL}- [GPIOSD_ETM_TASK_GPIO1_SEL] GPIO choose a etm task channel. %\label{fielddesc:GPIOSDETMTASKGPIO2EN}- [GPIOSD_ETM_TASK_GPIO2_EN] Enable bit of GPIO response etm task. %\label{fielddesc:GPIOSDETMTASKGPIO2SEL}- [GPIOSD_ETM_TASK_GPIO2_SEL] GPIO choose a etm task channel. %\label{fielddesc:GPIOSDETMTASKGPIO3EN}\item [GPIOSD_ETM_TASK_GPIO3_EN] Enable bit of GPIO response etm task. %\label{fielddesc:GPIOSDETMTASKGPIO3SEL}\item [GPIOSD_ETM_TASK_GPIO3_SEL] GPIO choose a etm task channel.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ETM_TASK_GPIO12_EN</name>
              <description>Configures whether or not to enable GPIO17 to response ETM task.\\
0: Not enable\\
1: Enable\\</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ETM_TASK_GPIO13_SEL</name>
              <description>Configures to select an ETM task channel for GPIO18.\\
0: Select channel 0\\
1: Select channel 1\\
......\\
7: Select channel 7\\%\label{fielddesc:GPIOSDETMTASKGPIO1EN}- [GPIOSD_ETM_TASK_GPIO1_EN] Enable bit of GPIO response etm task. %\label{fielddesc:GPIOSDETMTASKGPIO1SEL}- [GPIOSD_ETM_TASK_GPIO1_SEL] GPIO choose a etm task channel. %\label{fielddesc:GPIOSDETMTASKGPIO2EN}- [GPIOSD_ETM_TASK_GPIO2_EN] Enable bit of GPIO response etm task. %\label{fielddesc:GPIOSDETMTASKGPIO2SEL}- [GPIOSD_ETM_TASK_GPIO2_SEL] GPIO choose a etm task channel. %\label{fielddesc:GPIOSDETMTASKGPIO3EN}\item [GPIOSD_ETM_TASK_GPIO3_EN] Enable bit of GPIO response etm task. %\label{fielddesc:GPIOSDETMTASKGPIO3SEL}\item [GPIOSD_ETM_TASK_GPIO3_SEL] GPIO choose a etm task channel.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ETM_TASK_GPIO13_EN</name>
              <description>Configures whether or not to enable GPIO23 to response ETM task.\\
0: Not enable\\
1: Enable\\</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ETM_TASK_GPIO14_SEL</name>
              <description>Configures to select an ETM task channel for GPIO24.\\
0: Select channel 0\\
1: Select channel 1\\
......\\
7: Select channel 7\\%\label{fielddesc:GPIOSDETMTASKGPIO1EN}- [GPIOSD_ETM_TASK_GPIO1_EN] Enable bit of GPIO response etm task. %\label{fielddesc:GPIOSDETMTASKGPIO1SEL}- [GPIOSD_ETM_TASK_GPIO1_SEL] GPIO choose a etm task channel. %\label{fielddesc:GPIOSDETMTASKGPIO2EN}- [GPIOSD_ETM_TASK_GPIO2_EN] Enable bit of GPIO response etm task. %\label{fielddesc:GPIOSDETMTASKGPIO2SEL}- [GPIOSD_ETM_TASK_GPIO2_SEL] GPIO choose a etm task channel. %\label{fielddesc:GPIOSDETMTASKGPIO3EN}\item [GPIOSD_ETM_TASK_GPIO3_EN] Enable bit of GPIO response etm task. %\label{fielddesc:GPIOSDETMTASKGPIO3SEL}\item [GPIOSD_ETM_TASK_GPIO3_SEL] GPIO choose a etm task channel.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ETM_TASK_GPIO14_EN</name>
              <description>Configures whether or not to enable GPIO29 to response ETM task.\\
0: Not enable\\
1: Enable\\</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ETM_TASK_P3_CFG</name>
          <description>GPIO selection register 3 for ETM</description>
          <addressOffset>0x164</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>ETM_TASK_GPIO15_SEL</name>
              <description>Configures to select an ETM task channel for GPIO0.\\
0: Select channel 0\\
1: Select channel 1\\
......\\
7: Select channel 7\\%\label{fielddesc:GPIOSDETMTASKGPIO1EN}- [GPIOSD_ETM_TASK_GPIO1_EN] Enable bit of GPIO response etm task. %\label{fielddesc:GPIOSDETMTASKGPIO1SEL}- [GPIOSD_ETM_TASK_GPIO1_SEL] GPIO choose a etm task channel. %\label{fielddesc:GPIOSDETMTASKGPIO2EN}- [GPIOSD_ETM_TASK_GPIO2_EN] Enable bit of GPIO response etm task. %\label{fielddesc:GPIOSDETMTASKGPIO2SEL}- [GPIOSD_ETM_TASK_GPIO2_SEL] GPIO choose a etm task channel. %\label{fielddesc:GPIOSDETMTASKGPIO3EN}\item [GPIOSD_ETM_TASK_GPIO3_EN] Enable bit of GPIO response etm task. %\label{fielddesc:GPIOSDETMTASKGPIO3SEL}\item [GPIOSD_ETM_TASK_GPIO3_SEL] GPIO choose a etm task channel.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ETM_TASK_GPIO15_EN</name>
              <description>Configures whether or not to enable GPIO5 to response ETM task.\\
0: Not enable\\
1: Enable\\</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ETM_TASK_GPIO16_SEL</name>
              <description>Configures to select an ETM task channel for GPIO6.\\
0: Select channel 0\\
1: Select channel 1\\
......\\
7: Select channel 7\\%\label{fielddesc:GPIOSDETMTASKGPIO1EN}- [GPIOSD_ETM_TASK_GPIO1_EN] Enable bit of GPIO response etm task. %\label{fielddesc:GPIOSDETMTASKGPIO1SEL}- [GPIOSD_ETM_TASK_GPIO1_SEL] GPIO choose a etm task channel. %\label{fielddesc:GPIOSDETMTASKGPIO2EN}- [GPIOSD_ETM_TASK_GPIO2_EN] Enable bit of GPIO response etm task. %\label{fielddesc:GPIOSDETMTASKGPIO2SEL}- [GPIOSD_ETM_TASK_GPIO2_SEL] GPIO choose a etm task channel. %\label{fielddesc:GPIOSDETMTASKGPIO3EN}\item [GPIOSD_ETM_TASK_GPIO3_EN] Enable bit of GPIO response etm task. %\label{fielddesc:GPIOSDETMTASKGPIO3SEL}\item [GPIOSD_ETM_TASK_GPIO3_SEL] GPIO choose a etm task channel.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ETM_TASK_GPIO16_EN</name>
              <description>Configures whether or not to enable GPIO11 to response ETM task.\\
0: Not enable\\
1: Enable\\</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ETM_TASK_GPIO17_SEL</name>
              <description>Configures to select an ETM task channel for GPIO12.\\
0: Select channel 0\\
1: Select channel 1\\
......\\
7: Select channel 7\\%\label{fielddesc:GPIOSDETMTASKGPIO1EN}- [GPIOSD_ETM_TASK_GPIO1_EN] Enable bit of GPIO response etm task. %\label{fielddesc:GPIOSDETMTASKGPIO1SEL}- [GPIOSD_ETM_TASK_GPIO1_SEL] GPIO choose a etm task channel. %\label{fielddesc:GPIOSDETMTASKGPIO2EN}- [GPIOSD_ETM_TASK_GPIO2_EN] Enable bit of GPIO response etm task. %\label{fielddesc:GPIOSDETMTASKGPIO2SEL}- [GPIOSD_ETM_TASK_GPIO2_SEL] GPIO choose a etm task channel. %\label{fielddesc:GPIOSDETMTASKGPIO3EN}\item [GPIOSD_ETM_TASK_GPIO3_EN] Enable bit of GPIO response etm task. %\label{fielddesc:GPIOSDETMTASKGPIO3SEL}\item [GPIOSD_ETM_TASK_GPIO3_SEL] GPIO choose a etm task channel.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ETM_TASK_GPIO17_EN</name>
              <description>Configures whether or not to enable GPIO17 to response ETM task.\\
0: Not enable\\
1: Enable\\</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ETM_TASK_GPIO18_SEL</name>
              <description>Configures to select an ETM task channel for GPIO18.\\
0: Select channel 0\\
1: Select channel 1\\
......\\
7: Select channel 7\\%\label{fielddesc:GPIOSDETMTASKGPIO1EN}- [GPIOSD_ETM_TASK_GPIO1_EN] Enable bit of GPIO response etm task. %\label{fielddesc:GPIOSDETMTASKGPIO1SEL}- [GPIOSD_ETM_TASK_GPIO1_SEL] GPIO choose a etm task channel. %\label{fielddesc:GPIOSDETMTASKGPIO2EN}- [GPIOSD_ETM_TASK_GPIO2_EN] Enable bit of GPIO response etm task. %\label{fielddesc:GPIOSDETMTASKGPIO2SEL}- [GPIOSD_ETM_TASK_GPIO2_SEL] GPIO choose a etm task channel. %\label{fielddesc:GPIOSDETMTASKGPIO3EN}\item [GPIOSD_ETM_TASK_GPIO3_EN] Enable bit of GPIO response etm task. %\label{fielddesc:GPIOSDETMTASKGPIO3SEL}\item [GPIOSD_ETM_TASK_GPIO3_SEL] GPIO choose a etm task channel.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ETM_TASK_GPIO18_EN</name>
              <description>Configures whether or not to enable GPIO23 to response ETM task.\\
0: Not enable\\
1: Enable\\</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ETM_TASK_GPIO19_SEL</name>
              <description>Configures to select an ETM task channel for GPIO24.\\
0: Select channel 0\\
1: Select channel 1\\
......\\
7: Select channel 7\\%\label{fielddesc:GPIOSDETMTASKGPIO1EN}- [GPIOSD_ETM_TASK_GPIO1_EN] Enable bit of GPIO response etm task. %\label{fielddesc:GPIOSDETMTASKGPIO1SEL}- [GPIOSD_ETM_TASK_GPIO1_SEL] GPIO choose a etm task channel. %\label{fielddesc:GPIOSDETMTASKGPIO2EN}- [GPIOSD_ETM_TASK_GPIO2_EN] Enable bit of GPIO response etm task. %\label{fielddesc:GPIOSDETMTASKGPIO2SEL}- [GPIOSD_ETM_TASK_GPIO2_SEL] GPIO choose a etm task channel. %\label{fielddesc:GPIOSDETMTASKGPIO3EN}\item [GPIOSD_ETM_TASK_GPIO3_EN] Enable bit of GPIO response etm task. %\label{fielddesc:GPIOSDETMTASKGPIO3SEL}\item [GPIOSD_ETM_TASK_GPIO3_SEL] GPIO choose a etm task channel.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ETM_TASK_GPIO19_EN</name>
              <description>Configures whether or not to enable GPIO29 to response ETM task.\\
0: Not enable\\
1: Enable\\</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ETM_TASK_P4_CFG</name>
          <description>GPIO selection register 4 for ETM</description>
          <addressOffset>0x168</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>ETM_TASK_GPIO20_SEL</name>
              <description>Configures to select an ETM task channel for GPIO0.\\
0: Select channel 0\\
1: Select channel 1\\
......\\
7: Select channel 7\\%\label{fielddesc:GPIOSDETMTASKGPIO1EN}- [GPIOSD_ETM_TASK_GPIO1_EN] Enable bit of GPIO response etm task. %\label{fielddesc:GPIOSDETMTASKGPIO1SEL}- [GPIOSD_ETM_TASK_GPIO1_SEL] GPIO choose a etm task channel. %\label{fielddesc:GPIOSDETMTASKGPIO2EN}- [GPIOSD_ETM_TASK_GPIO2_EN] Enable bit of GPIO response etm task. %\label{fielddesc:GPIOSDETMTASKGPIO2SEL}- [GPIOSD_ETM_TASK_GPIO2_SEL] GPIO choose a etm task channel. %\label{fielddesc:GPIOSDETMTASKGPIO3EN}\item [GPIOSD_ETM_TASK_GPIO3_EN] Enable bit of GPIO response etm task. %\label{fielddesc:GPIOSDETMTASKGPIO3SEL}\item [GPIOSD_ETM_TASK_GPIO3_SEL] GPIO choose a etm task channel.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ETM_TASK_GPIO20_EN</name>
              <description>Configures whether or not to enable GPIO5 to response ETM task.\\
0: Not enable\\
1: Enable\\</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ETM_TASK_GPIO21_SEL</name>
              <description>Configures to select an ETM task channel for GPIO6.\\
0: Select channel 0\\
1: Select channel 1\\
......\\
7: Select channel 7\\%\label{fielddesc:GPIOSDETMTASKGPIO1EN}- [GPIOSD_ETM_TASK_GPIO1_EN] Enable bit of GPIO response etm task. %\label{fielddesc:GPIOSDETMTASKGPIO1SEL}- [GPIOSD_ETM_TASK_GPIO1_SEL] GPIO choose a etm task channel. %\label{fielddesc:GPIOSDETMTASKGPIO2EN}- [GPIOSD_ETM_TASK_GPIO2_EN] Enable bit of GPIO response etm task. %\label{fielddesc:GPIOSDETMTASKGPIO2SEL}- [GPIOSD_ETM_TASK_GPIO2_SEL] GPIO choose a etm task channel. %\label{fielddesc:GPIOSDETMTASKGPIO3EN}\item [GPIOSD_ETM_TASK_GPIO3_EN] Enable bit of GPIO response etm task. %\label{fielddesc:GPIOSDETMTASKGPIO3SEL}\item [GPIOSD_ETM_TASK_GPIO3_SEL] GPIO choose a etm task channel.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ETM_TASK_GPIO21_EN</name>
              <description>Configures whether or not to enable GPIO11 to response ETM task.\\
0: Not enable\\
1: Enable\\</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ETM_TASK_GPIO22_SEL</name>
              <description>Configures to select an ETM task channel for GPIO12.\\
0: Select channel 0\\
1: Select channel 1\\
......\\
7: Select channel 7\\%\label{fielddesc:GPIOSDETMTASKGPIO1EN}- [GPIOSD_ETM_TASK_GPIO1_EN] Enable bit of GPIO response etm task. %\label{fielddesc:GPIOSDETMTASKGPIO1SEL}- [GPIOSD_ETM_TASK_GPIO1_SEL] GPIO choose a etm task channel. %\label{fielddesc:GPIOSDETMTASKGPIO2EN}- [GPIOSD_ETM_TASK_GPIO2_EN] Enable bit of GPIO response etm task. %\label{fielddesc:GPIOSDETMTASKGPIO2SEL}- [GPIOSD_ETM_TASK_GPIO2_SEL] GPIO choose a etm task channel. %\label{fielddesc:GPIOSDETMTASKGPIO3EN}\item [GPIOSD_ETM_TASK_GPIO3_EN] Enable bit of GPIO response etm task. %\label{fielddesc:GPIOSDETMTASKGPIO3SEL}\item [GPIOSD_ETM_TASK_GPIO3_SEL] GPIO choose a etm task channel.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ETM_TASK_GPIO22_EN</name>
              <description>Configures whether or not to enable GPIO17 to response ETM task.\\
0: Not enable\\
1: Enable\\</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ETM_TASK_GPIO23_SEL</name>
              <description>Configures to select an ETM task channel for GPIO18.\\
0: Select channel 0\\
1: Select channel 1\\
......\\
7: Select channel 7\\%\label{fielddesc:GPIOSDETMTASKGPIO1EN}- [GPIOSD_ETM_TASK_GPIO1_EN] Enable bit of GPIO response etm task. %\label{fielddesc:GPIOSDETMTASKGPIO1SEL}- [GPIOSD_ETM_TASK_GPIO1_SEL] GPIO choose a etm task channel. %\label{fielddesc:GPIOSDETMTASKGPIO2EN}- [GPIOSD_ETM_TASK_GPIO2_EN] Enable bit of GPIO response etm task. %\label{fielddesc:GPIOSDETMTASKGPIO2SEL}- [GPIOSD_ETM_TASK_GPIO2_SEL] GPIO choose a etm task channel. %\label{fielddesc:GPIOSDETMTASKGPIO3EN}\item [GPIOSD_ETM_TASK_GPIO3_EN] Enable bit of GPIO response etm task. %\label{fielddesc:GPIOSDETMTASKGPIO3SEL}\item [GPIOSD_ETM_TASK_GPIO3_SEL] GPIO choose a etm task channel.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ETM_TASK_GPIO23_EN</name>
              <description>Configures whether or not to enable GPIO23 to response ETM task.\\
0: Not enable\\
1: Enable\\</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ETM_TASK_GPIO24_SEL</name>
              <description>Configures to select an ETM task channel for GPIO24.\\
0: Select channel 0\\
1: Select channel 1\\
......\\
7: Select channel 7\\%\label{fielddesc:GPIOSDETMTASKGPIO1EN}- [GPIOSD_ETM_TASK_GPIO1_EN] Enable bit of GPIO response etm task. %\label{fielddesc:GPIOSDETMTASKGPIO1SEL}- [GPIOSD_ETM_TASK_GPIO1_SEL] GPIO choose a etm task channel. %\label{fielddesc:GPIOSDETMTASKGPIO2EN}- [GPIOSD_ETM_TASK_GPIO2_EN] Enable bit of GPIO response etm task. %\label{fielddesc:GPIOSDETMTASKGPIO2SEL}- [GPIOSD_ETM_TASK_GPIO2_SEL] GPIO choose a etm task channel. %\label{fielddesc:GPIOSDETMTASKGPIO3EN}\item [GPIOSD_ETM_TASK_GPIO3_EN] Enable bit of GPIO response etm task. %\label{fielddesc:GPIOSDETMTASKGPIO3SEL}\item [GPIOSD_ETM_TASK_GPIO3_SEL] GPIO choose a etm task channel.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ETM_TASK_GPIO24_EN</name>
              <description>Configures whether or not to enable GPIO29 to response ETM task.\\
0: Not enable\\
1: Enable\\</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
