espressif/esp-bist/src/soc/esp32c5/esp32c5.svd
        <register>
          <name>ETM_TASK_P5_CFG</name>
          <description>GPIO selection register 5 for ETM</description>
          <addressOffset>0x16C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>ETM_TASK_GPIO25_SEL</name>
              <description>Configures to select an ETM task channel for GPIO0.\\
0: Select channel 0\\
1: Select channel 1\\
......\\
7: Select channel 7\\%\label{fielddesc:GPIOSDETMTASKGPIO1EN}- [GPIOSD_ETM_TASK_GPIO1_EN] Enable bit of GPIO response etm task. %\label{fielddesc:GPIOSDETMTASKGPIO1SEL}- [GPIOSD_ETM_TASK_GPIO1_SEL] GPIO choose a etm task channel. %\label{fielddesc:GPIOSDETMTASKGPIO2EN}- [GPIOSD_ETM_TASK_GPIO2_EN] Enable bit of GPIO response etm task. %\label{fielddesc:GPIOSDETMTASKGPIO2SEL}- [GPIOSD_ETM_TASK_GPIO2_SEL] GPIO choose a etm task channel. %\label{fielddesc:GPIOSDETMTASKGPIO3EN}\item [GPIOSD_ETM_TASK_GPIO3_EN] Enable bit of GPIO response etm task. %\label{fielddesc:GPIOSDETMTASKGPIO3SEL}\item [GPIOSD_ETM_TASK_GPIO3_SEL] GPIO choose a etm task channel.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ETM_TASK_GPIO25_EN</name>
              <description>Configures whether or not to enable GPIO5 to response ETM task.\\
0: Not enable\\
1: Enable\\</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ETM_TASK_GPIO26_SEL</name>
              <description>Configures to select an ETM task channel for GPIO6.\\
0: Select channel 0\\
1: Select channel 1\\
......\\
7: Select channel 7\\%\label{fielddesc:GPIOSDETMTASKGPIO1EN}- [GPIOSD_ETM_TASK_GPIO1_EN] Enable bit of GPIO response etm task. %\label{fielddesc:GPIOSDETMTASKGPIO1SEL}- [GPIOSD_ETM_TASK_GPIO1_SEL] GPIO choose a etm task channel. %\label{fielddesc:GPIOSDETMTASKGPIO2EN}- [GPIOSD_ETM_TASK_GPIO2_EN] Enable bit of GPIO response etm task. %\label{fielddesc:GPIOSDETMTASKGPIO2SEL}- [GPIOSD_ETM_TASK_GPIO2_SEL] GPIO choose a etm task channel. %\label{fielddesc:GPIOSDETMTASKGPIO3EN}\item [GPIOSD_ETM_TASK_GPIO3_EN] Enable bit of GPIO response etm task. %\label{fielddesc:GPIOSDETMTASKGPIO3SEL}\item [GPIOSD_ETM_TASK_GPIO3_SEL] GPIO choose a etm task channel.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ETM_TASK_GPIO26_EN</name>
              <description>Configures whether or not to enable GPIO11 to response ETM task.\\
0: Not enable\\
1: Enable\\</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ETM_TASK_GPIO27_SEL</name>
              <description>Configures to select an ETM task channel for GPIO12.\\
0: Select channel 0\\
1: Select channel 1\\
......\\
7: Select channel 7\\%\label{fielddesc:GPIOSDETMTASKGPIO1EN}- [GPIOSD_ETM_TASK_GPIO1_EN] Enable bit of GPIO response etm task. %\label{fielddesc:GPIOSDETMTASKGPIO1SEL}- [GPIOSD_ETM_TASK_GPIO1_SEL] GPIO choose a etm task channel. %\label{fielddesc:GPIOSDETMTASKGPIO2EN}- [GPIOSD_ETM_TASK_GPIO2_EN] Enable bit of GPIO response etm task. %\label{fielddesc:GPIOSDETMTASKGPIO2SEL}- [GPIOSD_ETM_TASK_GPIO2_SEL] GPIO choose a etm task channel. %\label{fielddesc:GPIOSDETMTASKGPIO3EN}\item [GPIOSD_ETM_TASK_GPIO3_EN] Enable bit of GPIO response etm task. %\label{fielddesc:GPIOSDETMTASKGPIO3SEL}\item [GPIOSD_ETM_TASK_GPIO3_SEL] GPIO choose a etm task channel.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ETM_TASK_GPIO27_EN</name>
              <description>Configures whether or not to enable GPIO17 to response ETM task.\\
0: Not enable\\
1: Enable\\</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ETM_TASK_GPIO28_SEL</name>
              <description>Configures to select an ETM task channel for GPIO18.\\
0: Select channel 0\\
1: Select channel 1\\
......\\
7: Select channel 7\\%\label{fielddesc:GPIOSDETMTASKGPIO1EN}- [GPIOSD_ETM_TASK_GPIO1_EN] Enable bit of GPIO response etm task. %\label{fielddesc:GPIOSDETMTASKGPIO1SEL}- [GPIOSD_ETM_TASK_GPIO1_SEL] GPIO choose a etm task channel. %\label{fielddesc:GPIOSDETMTASKGPIO2EN}- [GPIOSD_ETM_TASK_GPIO2_EN] Enable bit of GPIO response etm task. %\label{fielddesc:GPIOSDETMTASKGPIO2SEL}- [GPIOSD_ETM_TASK_GPIO2_SEL] GPIO choose a etm task channel. %\label{fielddesc:GPIOSDETMTASKGPIO3EN}\item [GPIOSD_ETM_TASK_GPIO3_EN] Enable bit of GPIO response etm task. %\label{fielddesc:GPIOSDETMTASKGPIO3SEL}\item [GPIOSD_ETM_TASK_GPIO3_SEL] GPIO choose a etm task channel.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ETM_TASK_GPIO28_EN</name>
              <description>Configures whether or not to enable GPIO23 to response ETM task.\\
0: Not enable\\
1: Enable\\</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_RAW</name>
          <description>GPIO_EXT interrupt raw register</description>
          <addressOffset>0x1D0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>COMP_NEG_0_INT_RAW</name>
              <description>analog comparator pos edge interrupt raw</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>COMP_POS_0_INT_RAW</name>
              <description>analog comparator neg edge interrupt raw</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>COMP_ALL_0_INT_RAW</name>
              <description>analog comparator neg or pos edge interrupt raw</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_ST</name>
          <description>GPIO_EXT interrupt masked register</description>
          <addressOffset>0x1D4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>COMP_NEG_0_INT_ST</name>
              <description>analog comparator pos edge interrupt status</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>COMP_POS_0_INT_ST</name>
              <description>analog comparator neg edge interrupt status</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>COMP_ALL_0_INT_ST</name>
              <description>analog comparator neg or pos edge interrupt status</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_ENA</name>
          <description>GPIO_EXT interrupt enable register</description>
          <addressOffset>0x1D8</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000007</resetValue>
          <fields>
            <field>
              <name>COMP_NEG_0_INT_ENA</name>
              <description>analog comparator pos edge interrupt enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COMP_POS_0_INT_ENA</name>
              <description>analog comparator neg edge interrupt enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COMP_ALL_0_INT_ENA</name>
              <description>analog comparator neg or pos edge interrupt enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_CLR</name>
          <description>GPIO_EXT interrupt clear register</description>
          <addressOffset>0x1DC</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>COMP_NEG_0_INT_CLR</name>
              <description>analog comparator pos edge interrupt clear</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>COMP_POS_0_INT_CLR</name>
              <description>analog comparator neg edge interrupt clear</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>COMP_ALL_0_INT_CLR</name>
              <description>analog comparator neg or pos edge interrupt clear</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PIN_CTRL</name>
          <description>Clock Output Configuration Register</description>
          <addressOffset>0x1E0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CLK_OUT1</name>
              <description>If you want to output clock for I2S to CLK_OUT_out1, set this register to 0x0. CLK_OUT_out1 can be found in peripheral output signals.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CLK_OUT2</name>
              <description>If you want to output clock for I2S to CLK_OUT_out2, set this register to 0x0. CLK_OUT_out2 can be found in peripheral output signals.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CLK_OUT3</name>
              <description>If you want to output clock for I2S to CLK_OUT_out3, set this register to 0x0. CLK_OUT_out3 can be found in peripheral output signals.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register derivedFrom="AES.DATE">
          <name>VERSION</name>
          <description>Version Control Register</description>
          <addressOffset>0x1FC</addressOffset>
        </register>
