espressif/esp-bist/src/soc/esp32c5/esp32c5.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>HP_APM</name>
      <description>HP_APM Peripheral</description>
      <groupName>HP_APM</groupName>
      <baseAddress>0x60099000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x124</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>HP_APM_M0</name>
        <value>36</value>
      </interrupt>
      <interrupt>
        <name>HP_APM_M1</name>
        <value>37</value>
      </interrupt>
      <interrupt>
        <name>HP_APM_M2</name>
        <value>38</value>
      </interrupt>
      <interrupt>
        <name>HP_APM_M3</name>
        <value>39</value>
      </interrupt>
      <interrupt>
        <name>HP_APM_M4</name>
        <value>40</value>
      </interrupt>
      <registers>
        <register>
          <name>REGION_FILTER_EN</name>
          <description>Region filter enable register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>REGION_FILTER_EN</name>
              <description>Configure bit 0 (0-15) to enable region 0.\\
0: disable \\
1: enable  \\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>16</dim>
          <dimIncrement>0xC</dimIncrement>
          <name>REGION%s_ADDR_START</name>
          <description>Region address register</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>REGION_ADDR_START</name>
              <description>Configures start address of region %s.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>16</dim>
          <dimIncrement>0xC</dimIncrement>
          <name>REGION%s_ADDR_END</name>
          <description>Region address register</description>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <resetValue>0xFFFFFFFF</resetValue>
          <fields>
            <field>
              <name>REGION_ADDR_END</name>
              <description>Configures end address of region %s.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>16</dim>
          <dimIncrement>0xC</dimIncrement>
          <name>REGION%s_ATTR</name>
          <description>Region access authority attribute register</description>
          <addressOffset>0xC</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>REGION_R0_X</name>
              <description>Configures the execution authority of REE_MODE 0 in region %s.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REGION_R0_W</name>
              <description>Configures the write authority of REE_MODE 0 in region %s.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REGION_R0_R</name>
              <description>Configures the read authority of REE_MODE 0 in region %s.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REGION_R1_X</name>
              <description>Configures the execution authority of REE_MODE 1 in region %s.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REGION_R1_W</name>
              <description>Configures the write authority of REE_MODE 1 in region %s.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REGION_R1_R</name>
              <description>Configures the read authority of REE_MODE 1 in region %s.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REGION_R2_X</name>
              <description>Configures the execution authority of REE_MODE 2 in region %s.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REGION_R2_W</name>
              <description>Configures the write authority of REE_MODE 2 in region %s.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REGION_R2_R</name>
              <description>Configures the read authority of REE_MODE 2 in region %s.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REGION_LOCK</name>
              <description>Set 1 to lock region0 configuration</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FUNC_CTRL</name>
          <description>APM function control register</description>
          <addressOffset>0xC4</addressOffset>
          <size>0x20</size>
          <resetValue>0x0000001F</resetValue>
          <fields>
            <field>
              <dim>5</dim>
              <dimIncrement>0x1</dimIncrement>
              <dimIndex>0-4</dimIndex>
              <name>M%s_FUNC_EN</name>
              <description>PMS M%s function enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <cluster>
          <dim>5</dim>
          <dimIncrement>0x10</dimIncrement>
          <dimIndex>0-4</dimIndex>
          <name>M%s</name>
          <description>Cluster M%s, containing M?_STATUS, M?_STATUS_CLR, M?_EXCEPTION_INFO0, M?_EXCEPTION_INFO1</description>
          <addressOffset>0xC8</addressOffset>
          <register>
            <name>STATUS</name>
            <description>M0 status register</description>
            <addressOffset>0x0</addressOffset>
            <size>0x20</size>
            <fields>
              <field>
                <name>EXCEPTION_STATUS</name>
                <description>Represents exception status.\\
bit0: 1 represents authority_exception \\
bit1: 1 represents space_exception  \\</description>
                <bitOffset>0</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>STATUS_CLR</name>
            <description>M0 status clear register</description>
            <addressOffset>0x4</addressOffset>
            <size>0x20</size>
            <fields>
              <field>
                <name>EXCEPTION_STATUS_CLR</name>
                <description>Configures to clear exception status.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>write-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>EXCEPTION_INFO0</name>
            <description>M0 exception_info0 register</description>
            <addressOffset>0x8</addressOffset>
            <size>0x20</size>
            <fields>
              <field>
                <name>EXCEPTION_REGION</name>
                <description>Represents exception region.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>16</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>EXCEPTION_MODE</name>
                <description>Represents exception mode.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>EXCEPTION_ID</name>
                <description>Represents exception id information.</description>
                <bitOffset>18</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>EXCEPTION_INFO1</name>
            <description>M0 exception_info1 register</description>
            <addressOffset>0xC</addressOffset>
            <size>0x20</size>
            <fields>
              <field>
                <name>EXCEPTION_ADDR</name>
                <description>Represents exception addr.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
        </cluster>
        <register>
          <name>INT_EN</name>
          <description>APM interrupt enable register</description>
          <addressOffset>0x118</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <dim>5</dim>
              <dimIncrement>0x1</dimIncrement>
              <dimIndex>0-4</dimIndex>
              <name>M%s_APM</name>
              <description>Configures to enable APM M%s interrupt.\\
0: disable \\
1: enable  \\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CLOCK_GATE</name>
          <description>Clock gating register</description>
          <addressOffset>0x7F8</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>CLK_EN</name>
              <description>Configures whether to keep the clock always on.\\
0: enable automatic clock gating \\
1: keep the clock always on  \\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register derivedFrom="AES.DATE">
          <name>DATE</name>
          <description>Version control register</description>
          <addressOffset>0x7FC</addressOffset>
        </register>
