espressif/esp-bist/src/soc/esp32c5/esp32c5.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>INTERRUPT_CORE0</name>
      <description>Interrupt Controller (Core 0)</description>
      <groupName>INTERRUPT_CORE0</groupName>
      <baseAddress>0x60010000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x154</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>WIFI_MAC</name>
        <value>0</value>
      </interrupt>
      <interrupt>
        <name>WIFI_MAC_NMI</name>
        <value>1</value>
      </interrupt>
      <interrupt>
        <name>WIFI_PWR</name>
        <value>2</value>
      </interrupt>
      <interrupt>
        <name>WIFI_BB</name>
        <value>3</value>
      </interrupt>
      <interrupt>
        <name>BT_MAC</name>
        <value>4</value>
      </interrupt>
      <interrupt>
        <name>BT_BB</name>
        <value>5</value>
      </interrupt>
      <interrupt>
        <name>BT_BB_NMI</name>
        <value>6</value>
      </interrupt>
      <interrupt>
        <name>LP_TIMER</name>
        <value>7</value>
      </interrupt>
      <interrupt>
        <name>COEX</name>
        <value>8</value>
      </interrupt>
      <interrupt>
        <name>BLE_TIMER</name>
        <value>9</value>
      </interrupt>
      <interrupt>
        <name>BLE_SEC</name>
        <value>10</value>
      </interrupt>
      <interrupt>
        <name>ZB_MAC</name>
        <value>12</value>
      </interrupt>
      <interrupt>
        <name>FROM_CPU_INTR0</name>
        <value>23</value>
      </interrupt>
      <interrupt>
        <name>FROM_CPU_INTR1</name>
        <value>24</value>
      </interrupt>
      <interrupt>
        <name>FROM_CPU_INTR2</name>
        <value>25</value>
      </interrupt>
      <interrupt>
        <name>FROM_CPU_INTR3</name>
        <value>26</value>
      </interrupt>
      <interrupt>
        <name>CACHE</name>
        <value>29</value>
      </interrupt>
      <interrupt>
        <name>CPU_PERI_TIMEOUT</name>
        <value>30</value>
      </interrupt>
      <interrupt>
        <name>CPU_APM_M0</name>
        <value>42</value>
      </interrupt>
      <interrupt>
        <name>CPU_APM_M1</name>
        <value>43</value>
      </interrupt>
      <registers>
        <register>
          <dim>84</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>CORE_0_INTR_MAP%s</name>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>MAP</name>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PASS_IN_SEC</name>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>3</dim>
          <dimIncrement>0x4</dimIncrement>
          <dimIndex>0-2</dimIndex>
          <name>CORE_0_INTR_STATUS%s</name>
          <description>Represents the status of the interrupt sources. Each bit corresponds to one interrupt source</description>
          <addressOffset>0x150</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>INT_STATUS_0</name>
              <description>Represents the status of the interrupt sources numbered from .Each bit corresponds to one interrupt source
0:The corresponding interrupt source triggered an interrupt
1:No interrupt triggered</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register derivedFrom="AES.DATE">
          <name>INTERRUPT_DATE</name>
          <description>Version control register</description>
          <addressOffset>0x7FC</addressOffset>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>INTPRI</name>
      <description>INTPRI Peripheral</description>
      <groupName>INTPRI</groupName>
      <baseAddress>0x600C5000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x24</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <dim>4</dim>
          <dimIncrement>0x4</dimIncrement>
          <dimIndex>0-3</dimIndex>
          <name>CPU_INTR_FROM_CPU%s</name>
          <description>CPU_INTR_FROM_CPU_%s mapping register</description>
          <addressOffset>0x90</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CPU_INTR</name>
              <description>CPU_INTR_FROM_CPU_0 mapping register.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register derivedFrom="AES.DATE">
          <name>DATE</name>
          <description>Version control register</description>
          <addressOffset>0xA0</addressOffset>
        </register>
        <register>
          <name>CLOCK_GATE</name>
          <description>register description</description>
          <addressOffset>0xA4</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>CLK_EN</name>
              <description>Need add description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RND_ECO</name>
          <description>redcy eco register.</description>
          <addressOffset>0xAC</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>REDCY_ENA</name>
              <description>Only reserved for ECO.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REDCY_RESULT</name>
              <description>Only reserved for ECO.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RND_ECO_LOW</name>
          <description>redcy eco low register.</description>
          <addressOffset>0xB0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>REDCY_LOW</name>
              <description>Only reserved for ECO.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RND_ECO_HIGH</name>
          <description>redcy eco high register.</description>
          <addressOffset>0x3FC</addressOffset>
          <size>0x20</size>
          <resetValue>0xFFFFFFFF</resetValue>
          <fields>
            <field>
              <name>REDCY_HIGH</name>
              <description>Only reserved for ECO.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
