espressif/esp-bist/src/soc/esp32c5/esp32c5.svd
        <register>
          <name>SYNC_CTRL</name>
          <description>Sync-class operation control register</description>
          <addressOffset>0x94</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>INVALIDATE_ENA</name>
              <description>The bit is used to enable invalidate operation. It will be cleared by hardware after invalidate operation done. Note that this bit and the other sync-bits (clean_ena, writeback_ena, writeback_invalidate_ena) are mutually exclusive, that is, those bits can not be set to 1 at the same time.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CLEAN_ENA</name>
              <description>The bit is used to enable clean operation. It will be cleared by hardware after clean operation done. Note that this bit and the other sync-bits (invalidate_ena, writeback_ena, writeback_invalidate_ena) are mutually exclusive, that is, those bits can not be set to 1 at the same time.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITEBACK_ENA</name>
              <description>The bit is used to enable writeback operation. It will be cleared by hardware after writeback operation done. Note that this bit and the other sync-bits (invalidate_ena, clean_ena, writeback_invalidate_ena) are mutually exclusive, that is, those bits can not be set to 1 at the same time.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITEBACK_INVALIDATE_ENA</name>
              <description>The bit is used to enable writeback-invalidate operation. It will be cleared by hardware after writeback-invalidate operation done. Note that this bit and the other sync-bits (invalidate_ena, clean_ena, writeback_ena) are mutually exclusive, that is, those bits can not be set to 1 at the same time.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SYNC_DONE</name>
              <description>The bit is used to indicate whether sync operation (invalidate, clean, writeback, writeback_invalidate) is finished or not. 0: not finished. 1: finished.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SYNC_RGID</name>
              <description>The bit is used to set the gid of cache sync operation (invalidate, clean, writeback, writeback_invalidate)</description>
              <bitOffset>5</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYNC_MAP</name>
          <description>Sync map configure register</description>
          <addressOffset>0x98</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>SYNC_MAP</name>
              <description>Those bits are used to indicate which caches in the two-level cache structure will apply the sync operation. [4]: Cache</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYNC_ADDR</name>
          <description>Sync address configure register</description>
          <addressOffset>0x9C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>SYNC_ADDR</name>
              <description>Those bits are used to configure the start address of the sync operation, which should be used together with CACHE_SYNC_SIZE_REG</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYNC_SIZE</name>
          <description>Sync size configure register</description>
          <addressOffset>0xA0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>SYNC_SIZE</name>
              <description>Those bits are used to configure the size of the sync operation, which should be used together with CACHE_SYNC_ADDR_REG</description>
              <bitOffset>0</bitOffset>
              <bitWidth>25</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ICACHE2_PRELOAD_CTRL</name>
          <description>Instruction Cache 2 preload-operation control register</description>
          <addressOffset>0xBC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ICACHE2_PRELOAD_ENA</name>
              <description>The bit is used to enable preload operation on ICache2. It will be cleared by hardware automatically after preload operation is done.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ICACHE2_PRELOAD_DONE</name>
              <description>The bit is used to indicate whether preload operation is finished or not. 0: not finished. 1: finished.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ICACHE2_PRELOAD_ORDER</name>
              <description>The bit is used to configure the direction of preload operation. 0: ascending, 1: descending.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ICACHE2_PRELOAD_RGID</name>
              <description>The bit is used to set the gid of icache2 preload.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ICACHE2_PRELOAD_ADDR</name>
          <description>Instruction Cache 2 preload address configure register</description>
          <addressOffset>0xC0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ICACHE2_PRELOAD_ADDR</name>
              <description>Those bits are used to configure the start address of preload on ICache2, which should be used together with ICACHE2_PRELOAD_SIZE_REG</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ICACHE2_PRELOAD_SIZE</name>
          <description>Instruction Cache 2 preload size configure register</description>
          <addressOffset>0xC4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ICACHE2_PRELOAD_SIZE</name>
              <description>Those bits are used to configure the size of the first section of prelock on ICache2, which should be used together with ICACHE2_PRELOAD_ADDR_REG</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CACHE_PRELOAD_CTRL</name>
          <description>Cache preload-operation control register</description>
          <addressOffset>0xD4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CACHE_PRELOAD_ENA</name>
              <description>The bit is used to enable preload operation on Cache. It will be cleared by hardware automatically after preload operation is done.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CACHE_PRELOAD_DONE</name>
              <description>The bit is used to indicate whether preload operation is finished or not. 0: not finished. 1: finished.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CACHE_PRELOAD_ORDER</name>
              <description>The bit is used to configure the direction of preload operation. 0: ascending, 1: descending.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CACHE_PRELOAD_RGID</name>
              <description>The bit is used to set the gid of cache preload.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DCACHE_PRELOAD_ADDR</name>
          <description>Cache preload address configure register</description>
          <addressOffset>0xD8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CACHE_PRELOAD_ADDR</name>
              <description>Those bits are used to configure the start address of preload on Cache, which should be used together with CACHE_PRELOAD_SIZE_REG</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DCACHE_PRELOAD_SIZE</name>
          <description>Cache preload size configure register</description>
          <addressOffset>0xDC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CACHE_PRELOAD_SIZE</name>
              <description>Those bits are used to configure the size of the first section of prelock on Cache, which should be used together with CACHE_PRELOAD_ADDR_REG</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ICACHE2_AUTOLOAD_CTRL</name>
          <description>Instruction Cache 2 autoload-operation control register</description>
          <addressOffset>0x108</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ICACHE2_AUTOLOAD_ENA</name>
              <description>The bit is used to enable and disable autoload operation on ICache2. 1: enable, 0: disable.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ICACHE2_AUTOLOAD_DONE</name>
              <description>The bit is used to indicate whether autoload operation on ICache2 is finished or not. 0: not finished. 1: finished.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ICACHE2_AUTOLOAD_ORDER</name>
              <description>The bit is used to configure the direction of autoload operation on ICache2. 0: ascending. 1: descending.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ICACHE2_AUTOLOAD_TRIGGER_MODE</name>
              <description>The field is used to configure trigger mode of autoload operation on ICache2. 0/3: miss-trigger, 1: hit-trigger, 2: miss-hit-trigger.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ICACHE2_AUTOLOAD_SCT0_ENA</name>
              <description>The bit is used to enable the first section for autoload operation on ICache2.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ICACHE2_AUTOLOAD_SCT1_ENA</name>
              <description>The bit is used to enable the second section for autoload operation on ICache2.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ICACHE2_AUTOLOAD_RGID</name>
              <description>The bit is used to set the gid of icache2 autoload.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ICACHE2_AUTOLOAD_SCT0_ADDR</name>
          <description>Instruction Cache 2 autoload section 0 address configure register</description>
          <addressOffset>0x10C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ICACHE2_AUTOLOAD_SCT0_ADDR</name>
              <description>Those bits are used to configure the start address of the first section for autoload operation on ICache2. Note that it should be used together with ICACHE2_AUTOLOAD_SCT0_SIZE and ICACHE_AUTOLOAD_SCT0_ENA.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ICACHE2_AUTOLOAD_SCT0_SIZE</name>
          <description>Instruction Cache 2 autoload section 0 size configure register</description>
          <addressOffset>0x110</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ICACHE2_AUTOLOAD_SCT0_SIZE</name>
              <description>Those bits are used to configure the size of the first section for autoload operation on ICache2. Note that it should be used together with ICACHE2_AUTOLOAD_SCT0_ADDR and ICACHE_AUTOLOAD_SCT0_ENA.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>28</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ICACHE2_AUTOLOAD_SCT1_ADDR</name>
          <description>Instruction Cache 2 autoload section 1 address configure register</description>
          <addressOffset>0x114</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ICACHE2_AUTOLOAD_SCT1_ADDR</name>
              <description>Those bits are used to configure the start address of the second section for autoload operation on ICache2. Note that it should be used together with ICACHE2_AUTOLOAD_SCT1_SIZE and ICACHE_AUTOLOAD_SCT1_ENA.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ICACHE2_AUTOLOAD_SCT1_SIZE</name>
          <description>Instruction Cache 2 autoload section 1 size configure register</description>
          <addressOffset>0x118</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ICACHE2_AUTOLOAD_SCT1_SIZE</name>
              <description>Those bits are used to configure the size of the second section for autoload operation on ICache2. Note that it should be used together with ICACHE2_AUTOLOAD_SCT1_ADDR and ICACHE_AUTOLOAD_SCT1_ENA.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>28</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CACHE_AUTOLOAD_CTRL</name>
          <description>Cache autoload-operation control register</description>
          <addressOffset>0x130</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CACHE_AUTOLOAD_ENA</name>
              <description>The bit is used to enable and disable autoload operation on Cache. 1: enable, 0: disable.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CACHE_AUTOLOAD_DONE</name>
              <description>The bit is used to indicate whether autoload operation on Cache is finished or not. 0: not finished. 1: finished.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CACHE_AUTOLOAD_ORDER</name>
              <description>The bit is used to configure the direction of autoload operation on Cache. 0: ascending. 1: descending.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CACHE_AUTOLOAD_TRIGGER_MODE</name>
              <description>The field is used to configure trigger mode of autoload operation on Cache. 0/3: miss-trigger, 1: hit-trigger, 2: miss-hit-trigger.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CACHE_AUTOLOAD_SCT0_ENA</name>
              <description>The bit is used to enable the first section for autoload operation on Cache.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CACHE_AUTOLOAD_SCT1_ENA</name>
              <description>The bit is used to enable the second section for autoload operation on Cache.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CACHE_AUTOLOAD_SCT0_ADDR</name>
          <description>Cache autoload section 0 address configure register</description>
          <addressOffset>0x134</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CACHE_AUTOLOAD_SCT0_ADDR</name>
              <description>Those bits are used to configure the start address of the first section for autoload operation on Cache. Note that it should be used together with CACHE_AUTOLOAD_SCT0_SIZE and CACHE_AUTOLOAD_SCT0_ENA.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CACHE_AUTOLOAD_SCT0_SIZE</name>
          <description>Cache autoload section 0 size configure register</description>
          <addressOffset>0x138</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CACHE_AUTOLOAD_SCT0_SIZE</name>
              <description>Those bits are used to configure the size of the first section for autoload operation on Cache. Note that it should be used together with CACHE_AUTOLOAD_SCT0_ADDR and CACHE_AUTOLOAD_SCT0_ENA.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>25</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CACHE_AUTOLOAD_SCT1_ADDR</name>
          <description>Cache autoload section 1 address configure register</description>
          <addressOffset>0x13C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CACHE_AUTOLOAD_SCT1_ADDR</name>
              <description>Those bits are used to configure the start address of the second section for autoload operation on Cache. Note that it should be used together with CACHE_AUTOLOAD_SCT1_SIZE and CACHE_AUTOLOAD_SCT1_ENA.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CACHE_AUTOLOAD_SCT1_SIZE</name>
          <description>Cache autoload section 1 size configure register</description>
          <addressOffset>0x140</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CACHE_AUTOLOAD_SCT1_SIZE</name>
              <description>Those bits are used to configure the size of the second section for autoload operation on Cache. Note that it should be used together with CACHE_AUTOLOAD_SCT1_ADDR and CACHE_AUTOLOAD_SCT1_ENA.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>25</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
