espressif/esp-bist/src/soc/esp32c5/esp32c5.svd
        <register>
          <name>CACHE_ACS_CNT_INT_ENA</name>
          <description>Cache Access Counter Interrupt enable register</description>
          <addressOffset>0x154</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>IBUS2_OVF_INT_ENA</name>
              <description>Reserved</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IBUS3_OVF_INT_ENA</name>
              <description>Reserved</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BUS0_OVF_INT_ENA</name>
              <description>The bit is used to enable interrupt of one of counters overflow that occurs in DCache due to bus0 accesses DCache.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BUS1_OVF_INT_ENA</name>
              <description>The bit is used to enable interrupt of one of counters overflow that occurs in DCache due to bus1 accesses DCache.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CACHE_ACS_CNT_INT_CLR</name>
          <description>Cache Access Counter Interrupt clear register</description>
          <addressOffset>0x158</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>IBUS2_OVF_INT_CLR</name>
              <description>Reserved</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>IBUS3_OVF_INT_CLR</name>
              <description>Reserved</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>BUS0_OVF_INT_CLR</name>
              <description>The bit is used to clear counters overflow interrupt and counters in DCache due to bus0 accesses DCache.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>BUS1_OVF_INT_CLR</name>
              <description>The bit is used to clear counters overflow interrupt and counters in DCache due to bus1 accesses DCache.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CACHE_ACS_CNT_INT_RAW</name>
          <description>Cache Access Counter Interrupt raw register</description>
          <addressOffset>0x15C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>IBUS2_OVF_INT_RAW</name>
              <description>The raw bit of the interrupt of one of counters overflow that occurs in ICache2 due to bus2 accesses ICache2.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IBUS3_OVF_INT_RAW</name>
              <description>The raw bit of the interrupt of one of counters overflow that occurs in ICache3 due to bus3 accesses ICache3.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BUS0_OVF_INT_RAW</name>
              <description>The raw bit of the interrupt of one of counters overflow that occurs in DCache due to bus0 accesses DCache.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BUS1_OVF_INT_RAW</name>
              <description>The raw bit of the interrupt of one of counters overflow that occurs in DCache due to bus1 accesses DCache.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CACHE_ACS_CNT_INT_ST</name>
          <description>Cache Access Counter Interrupt status register</description>
          <addressOffset>0x160</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>IBUS2_OVF_INT_ST</name>
              <description>Reserved</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>IBUS3_OVF_INT_ST</name>
              <description>Reserved</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>BUS0_OVF_INT_ST</name>
              <description>The bit indicates the interrupt status of one of counters overflow that occurs in DCache due to bus0 accesses DCache.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>BUS1_OVF_INT_ST</name>
              <description>The bit indicates the interrupt status of one of counters overflow that occurs in DCache due to bus1 accesses DCache.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CACHE_ACS_FAIL_CTRL</name>
          <description>Cache Access Fail Configuration register</description>
          <addressOffset>0x164</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ICACHE2_ACS_FAIL_CHECK_MODE</name>
              <description>The bit is used to configure icache2 access fail check mode. 0: the access fail is not propagated to the request, 1: the access fail is propagated to the request</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CACHE_ACS_FAIL_CHECK_MODE</name>
              <description>The bit is used to configure cache access fail check mode. 0: the access fail is not propagated to the request, 1: the access fail is propagated to the request</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CACHE_ACS_FAIL_INT_ENA</name>
          <description>Cache Access Fail Interrupt enable register</description>
          <addressOffset>0x168</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ICACHE2_FAIL_INT_ENA</name>
              <description>Reserved</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CACHE_FAIL_INT_ENA</name>
              <description>The bit is used to enable interrupt of access fail that occurs in DCache due to cpu accesses DCache.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CACHE_ACS_FAIL_INT_CLR</name>
          <description>Cache Access Fail Interrupt clear register</description>
          <addressOffset>0x16C</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>ICACHE2_FAIL_INT_CLR</name>
              <description>Reserved</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CACHE_FAIL_INT_CLR</name>
              <description>The bit is used to clear interrupt of access fail that occurs in DCache due to cpu accesses DCache.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CACHE_ACS_FAIL_INT_RAW</name>
          <description>Cache Access Fail Interrupt raw register</description>
          <addressOffset>0x170</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ICACHE2_FAIL_INT_RAW</name>
              <description>The raw bit of the interrupt of access fail that occurs in ICache2.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CACHE_FAIL_INT_RAW</name>
              <description>The raw bit of the interrupt of access fail that occurs in DCache.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CACHE_ACS_FAIL_INT_ST</name>
          <description>Cache Access Fail Interrupt status register</description>
          <addressOffset>0x174</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>ICACHE2_FAIL_INT_ST</name>
              <description>Reserved</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CACHE_FAIL_INT_ST</name>
              <description>The bit indicates the interrupt status of access fail that occurs in DCache due to cpu accesses DCache.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CACHE_ACS_CNT_CTRL</name>
          <description>Cache Access Counter enable and clear register</description>
          <addressOffset>0x178</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>IBUS2_CNT_ENA</name>
              <description>Reserved</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IBUS3_CNT_ENA</name>
              <description>Reserved</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BUS0_CNT_ENA</name>
              <description>The bit is used to enable dbus0 counter in DCache.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BUS1_CNT_ENA</name>
              <description>The bit is used to enable dbus1 counter in DCache.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IBUS2_CNT_CLR</name>
              <description>Reserved</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>IBUS3_CNT_CLR</name>
              <description>Reserved</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>BUS0_CNT_CLR</name>
              <description>The bit is used to clear dbus0 counter in DCache.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>BUS1_CNT_CLR</name>
              <description>The bit is used to clear dbus1 counter in DCache.</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IBUS2_ACS_HIT_CNT</name>
          <description>ICache bus2 Hit-Access Counter register</description>
          <addressOffset>0x19C</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>IBUS2_HIT_CNT</name>
              <description>The register records the number of hits when bus2 accesses ICache2.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IBUS2_ACS_MISS_CNT</name>
          <description>ICache bus2 Miss-Access Counter register</description>
          <addressOffset>0x1A0</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>IBUS2_MISS_CNT</name>
              <description>The register records the number of missing when bus2 accesses ICache2.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IBUS2_ACS_CONFLICT_CNT</name>
          <description>ICache bus2 Conflict-Access Counter register</description>
          <addressOffset>0x1A4</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>IBUS2_CONFLICT_CNT</name>
              <description>The register records the number of access-conflicts when bus2 accesses ICache2.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IBUS2_ACS_NXTLVL_RD_CNT</name>
          <description>ICache bus2 Next-Level-Access Counter register</description>
          <addressOffset>0x1A8</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>IBUS2_NXTLVL_RD_CNT</name>
              <description>The register records the number of times that ICache accesses L2-Cache due to bus2 accessing ICache2.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IBUS3_ACS_HIT_CNT</name>
          <description>ICache bus3 Hit-Access Counter register</description>
          <addressOffset>0x1AC</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>IBUS3_HIT_CNT</name>
              <description>The register records the number of hits when bus3 accesses ICache3.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IBUS3_ACS_MISS_CNT</name>
          <description>ICache bus3 Miss-Access Counter register</description>
          <addressOffset>0x1B0</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>IBUS3_MISS_CNT</name>
              <description>The register records the number of missing when bus3 accesses ICache3.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IBUS3_ACS_CONFLICT_CNT</name>
          <description>ICache bus3 Conflict-Access Counter register</description>
          <addressOffset>0x1B4</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>IBUS3_CONFLICT_CNT</name>
              <description>The register records the number of access-conflicts when bus3 accesses ICache3.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IBUS3_ACS_NXTLVL_RD_CNT</name>
          <description>ICache bus3 Next-Level-Access Counter register</description>
          <addressOffset>0x1B8</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>IBUS3_NXTLVL_RD_CNT</name>
              <description>The register records the number of times that ICache accesses L2-Cache due to bus3 accessing ICache3.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BUS0_ACS_HIT_CNT</name>
          <description>Cache bus0 Hit-Access Counter register</description>
          <addressOffset>0x1BC</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>BUS0_HIT_CNT</name>
              <description>The register records the number of hits when bus0 accesses Cache.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BUS0_ACS_MISS_CNT</name>
          <description>Cache bus0 Miss-Access Counter register</description>
          <addressOffset>0x1C0</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>BUS0_MISS_CNT</name>
              <description>The register records the number of missing when bus0 accesses Cache.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BUS0_ACS_CONFLICT_CNT</name>
          <description>Cache bus0 Conflict-Access Counter register</description>
          <addressOffset>0x1C4</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>BUS0_CONFLICT_RD_CNT</name>
              <description>The register records the number of access-conflicts when bus0 accesses Cache.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DBUS0_ACS_NXTLVL_RD_CNT</name>
          <description>Cache bus0 Next-Level-Access Counter register</description>
          <addressOffset>0x1C8</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>BUS0_NXTLVL_RD_CNT</name>
              <description>The register records the number of times that Cache accesses L2-Cache due to bus0 accessing Cache.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DBUS0_ACS_NXTLVL_WR_CNT</name>
          <description>DCache bus0 WB-Access Counter register</description>
          <addressOffset>0x1CC</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>BUS0_NXTLVL_WR_CNT</name>
              <description>The register records the number of write back when bus0 accesses Cache.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BUS1_ACS_HIT_CNT</name>
          <description>Cache bus1 Hit-Access Counter register</description>
          <addressOffset>0x1D0</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>BUS1_HIT_CNT</name>
              <description>The register records the number of hits when bus1 accesses Cache.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BUS1_ACS_MISS_CNT</name>
          <description>Cache bus1 Miss-Access Counter register</description>
          <addressOffset>0x1D4</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>BUS1_MISS_CNT</name>
              <description>The register records the number of missing when bus1 accesses Cache.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BUS1_ACS_CONFLICT_CNT</name>
          <description>Cache bus1 Conflict-Access Counter register</description>
          <addressOffset>0x1D8</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>BUS1_CONFLICT_CNT</name>
              <description>The register records the number of access-conflicts when bus1 accesses Cache.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
