espressif/esp-bist/src/soc/esp32c5/esp32c5.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>LEDC</name>
      <description>LED Control PWM (Pulse Width Modulation)</description>
      <groupName>LEDC</groupName>
      <baseAddress>0x60007000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0xF4</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>LEDC</name>
        <value>49</value>
      </interrupt>
      <registers>
        <cluster>
          <dim>6</dim>
          <dimIncrement>0x14</dimIncrement>
          <dimIndex>0-5</dimIndex>
          <name>CH%s</name>
          <description>Cluster CH%s, containing CH?_CONF0, CH?_HPOINT, CH?_DUTY, CH?_CONF1, CH?_DUTY_R</description>
          <addressOffset>0x0</addressOffset>
          <register>
            <name>CONF0</name>
            <description>Configuration register 0 for channel 0</description>
            <addressOffset>0x0</addressOffset>
            <size>0x20</size>
            <fields>
              <field>
                <name>TIMER_SEL</name>
                <description>Configures which timer is channel %s selected.\\0: Select timer0\\1: Select timer1\\2: Select timer2\\3: Select timer3</description>
                <bitOffset>0</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>SIG_OUT_EN</name>
                <description>Configures whether or not to enable signal output on channel %s.\\0: Signal output disable\\1: Signal output enable</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>IDLE_LV</name>
                <description>Configures the output value when channel %s is inactive. Valid only when  LEDC_SIG_OUT_EN_CH%s is 0.\\0: Output level is low\\1: Output level is high</description>
                <bitOffset>3</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>PARA_UP</name>
                <description>Configures whether or not to update LEDC_HPOINT_CH%s, LEDC_DUTY_START_CH%s, LEDC_SIG_OUT_EN_CH%s, LEDC_TIMER_SEL_CH%s, LEDC_OVF_CNT_EN_CH%s fields and duty cycle range configuration for channel %s, and will be automatically cleared by hardware.\\0: Invalid. No effect\\1: Update</description>
                <bitOffset>4</bitOffset>
                <bitWidth>1</bitWidth>
                <access>write-only</access>
              </field>
              <field>
                <name>OVF_NUM</name>
                <description>Configures the maximum times of overflow minus 1.The LEDC_OVF_CNT_CH%s_INT interrupt will be triggered when channel %s overflows for (LEDC_OVF_NUM_CH%s + 1) times.</description>
                <bitOffset>5</bitOffset>
                <bitWidth>10</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>OVF_CNT_EN</name>
                <description>Configures whether or not to enable the ovf_cnt of channel %s.\\0: Disable\\1: Enable</description>
                <bitOffset>15</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>OVF_CNT_RESET</name>
                <description>Configures whether or not to reset the  ovf_cnt of channel %s.\\0: Invalid. No effect\\1: Reset the ovf_cnt</description>
                <bitOffset>16</bitOffset>
                <bitWidth>1</bitWidth>
                <access>write-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>HPOINT</name>
            <description>High point register for channel 0</description>
            <addressOffset>0x4</addressOffset>
            <size>0x20</size>
            <fields>
              <field>
                <name>HPOINT</name>
                <description>Configures high point of signal output on channel %s. The output value changes to high when the selected timers has reached the value specified by this register.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>20</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>DUTY</name>
            <description>Initial duty cycle register for channel 0</description>
            <addressOffset>0x8</addressOffset>
            <size>0x20</size>
            <fields>
              <field>
                <name>DUTY</name>
                <description>Configures the duty of signal output on channel %s.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>25</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>CONF1</name>
            <description>Configuration register 1 for channel 0</description>
            <addressOffset>0xC</addressOffset>
            <size>0x20</size>
            <fields>
              <field>
                <name>DUTY_START</name>
                <description>Configures whether the duty cycle fading configurations take effect.\\0: Not take effect\\1: Take effect</description>
                <bitOffset>31</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>DUTY_R</name>
            <description>Current duty cycle register for channel 0</description>
            <addressOffset>0x10</addressOffset>
            <size>0x20</size>
            <fields>
              <field>
                <name>DUTY_R</name>
                <description>Represents the current duty of output signal on channel %s.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>25</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <dim>4</dim>
          <dimIncrement>0x8</dimIncrement>
          <dimIndex>0-3</dimIndex>
          <name>TIMER%s</name>
          <description>Cluster TIMER%s, containing TIMER?_CONF, TIMER?_VALUE</description>
          <addressOffset>0xA0</addressOffset>
          <register>
            <name>CONF</name>
            <description>Timer 0 configuration register</description>
            <addressOffset>0x0</addressOffset>
            <size>0x20</size>
            <resetValue>0x01000000</resetValue>
            <fields>
              <field>
                <name>DUTY_RES</name>
                <description>Configures the bit width of the counter in timer %s. Valid values are 1 to 20.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>CLK_DIV</name>
                <description>Configures the divisor for the divider in timer %s.The least significant eight bits represent the fractional part.</description>
                <bitOffset>5</bitOffset>
                <bitWidth>18</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>PAUSE</name>
                <description>Configures whether or not to pause the counter in timer %s.\\0: Normal\\1: Pause</description>
                <bitOffset>23</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>RST</name>
                <description>Configures whether or not to reset timer %s. The counter will show 0 after reset.\\0: Not reset\\1: Reset</description>
                <bitOffset>24</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>TICK_SEL</name>
                <description>Configures which clock is timer %s selected. Unused.</description>
                <bitOffset>25</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>PARA_UP</name>
                <description>Configures whether or not to update LEDC_CLK_DIV_TIMER%s and LEDC_TIMER%s_DUTY_RES.\\0: Invalid. No effect\\1: Update</description>
                <bitOffset>26</bitOffset>
                <bitWidth>1</bitWidth>
                <access>write-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>VALUE</name>
            <description>Timer 0 current counter value register</description>
            <addressOffset>0x4</addressOffset>
            <size>0x20</size>
            <fields>
              <field>
                <name>CNT</name>
                <description>Represents the current counter value of timer %s.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>20</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
        </cluster>
        <register>
          <name>INT_RAW</name>
          <description>Interrupt raw status register</description>
          <addressOffset>0xC0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <dim>4</dim>
              <dimIncrement>0x1</dimIncrement>
              <dimIndex>0-3</dimIndex>
              <name>TIMER%s_OVF</name>
              <description>Triggered when the timer%s has reached its maximum counter value.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <dim>6</dim>
              <dimIncrement>0x1</dimIncrement>
              <dimIndex>0-5</dimIndex>
              <name>DUTY_CHNG_END_CH%s</name>
              <description>Interrupt raw bit for channel %s. Triggered when the gradual change of duty has finished.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <dim>6</dim>
              <dimIncrement>0x1</dimIncrement>
              <dimIndex>0-5</dimIndex>
              <name>OVF_CNT_CH%s</name>
              <description>Interrupt raw bit for channel %s. Triggered when the OVF_CNT has reached the value specified by LEDC.CHx.CONF0.OVF_NUM.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_ST</name>
          <description>Interrupt masked status register</description>
          <addressOffset>0xC4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <dim>4</dim>
              <dimIncrement>0x1</dimIncrement>
              <dimIndex>0-3</dimIndex>
              <name>TIMER%s_OVF</name>
              <description>This is the masked interrupt status bit for the TIMER%s_OVF interrupt when LEDC.INT_ENA.TIMERx_OVF is set to 1.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <dim>6</dim>
              <dimIncrement>0x1</dimIncrement>
              <dimIndex>0-5</dimIndex>
              <name>DUTY_CHNG_END_CH%s</name>
              <description>This is the masked interrupt status bit for the DUTY_CHNG_END_CH%s interrupt when LEDC.INT_ENA.DUTY_CHNG_END_CHx is set to 1.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <dim>6</dim>
              <dimIncrement>0x1</dimIncrement>
              <dimIndex>0-5</dimIndex>
              <name>OVF_CNT_CH%s</name>
              <description>This is the masked interrupt status bit for the LEDC.INT_RAW.OVF_CNT_CH%s interrupt when LEDC.INT_ENA.OVF_CNT_CHx is set to 1.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_ENA</name>
          <description>Interrupt enable register</description>
          <addressOffset>0xC8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <dim>4</dim>
              <dimIncrement>0x1</dimIncrement>
              <dimIndex>0-3</dimIndex>
              <name>TIMER%s_OVF</name>
              <description>The interrupt enable bit for the TIMER%s_OVF interrupt.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <dim>6</dim>
              <dimIncrement>0x1</dimIncrement>
              <dimIndex>0-5</dimIndex>
              <name>DUTY_CHNG_END_CH%s</name>
              <description>The interrupt enable bit for the DUTY_CHNG_END_CH%s interrupt.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <dim>6</dim>
              <dimIncrement>0x1</dimIncrement>
              <dimIndex>0-5</dimIndex>
              <name>OVF_CNT_CH%s</name>
              <description>The interrupt enable bit for the OVF_CNT_CH%s interrupt.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_CLR</name>
          <description>Interrupt clear register</description>
          <addressOffset>0xCC</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <dim>4</dim>
              <dimIncrement>0x1</dimIncrement>
              <dimIndex>0-3</dimIndex>
              <name>TIMER%s_OVF</name>
              <description>Set this bit to clear the TIMER%s_OVF interrupt.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <dim>6</dim>
              <dimIncrement>0x1</dimIncrement>
              <dimIndex>0-5</dimIndex>
              <name>DUTY_CHNG_END_CH%s</name>
              <description>Set this bit to clear the DUTY_CHNG_END_CH%s interrupt.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <dim>6</dim>
              <dimIncrement>0x1</dimIncrement>
              <dimIndex>0-5</dimIndex>
              <name>OVF_CNT_CH%s</name>
              <description>Set this bit to clear the OVF_CNT_CH%s interrupt.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
          </fields>
        </register>
        <register>
          <dim>6</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>CH%s_GAMMA_CONF</name>
          <description>Ledc ch%s gamma config register.</description>
          <addressOffset>0x100</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CH_GAMMA_ENTRY_NUM</name>
              <description>Configures the number of duty cycle fading rages for LEDC ch%s.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH_GAMMA_PAUSE</name>
              <description>Configures whether or not to pause duty cycle fading of LEDC ch%s.\\0: Invalid. No effect\\1: Pause</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CH_GAMMA_RESUME</name>
              <description>Configures whether or nor to resume duty cycle fading of LEDC ch%s.\\0: Invalid. No effect\\1: Resume</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
