espressif/esp-bist/src/soc/esp32c5/esp32c5.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>LPPERI</name>
      <description>LPPERI Peripheral</description>
      <groupName>LPPERI</groupName>
      <baseAddress>0x600B2800</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x30</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CLK_EN</name>
          <description>configure peri in lp system clk enable</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <resetValue>0x7F000000</resetValue>
          <fields>
            <field>
              <name>RNG_CK_EN</name>
              <description>lp rng clk enable
1: enable clock
0: disable clock</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OTP_DBG_CK_EN</name>
              <description>lp optdebug clk enable
1: enable clock
0: disable clock</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_UART_CK_EN</name>
              <description>lp uart clk enable
1: enable clock
0: disable clock</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_IO_CK_EN</name>
              <description>lp io clk enable
1: enable clock
0: disable clock</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_EXT_I2C_CK_EN</name>
              <description>lp ext i2c clk enable
1: enable clock
0: disable clock</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_ANA_I2C_CK_EN</name>
              <description>lp analog peri clk enable
1: enable clock
0: disable clock</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EFUSE_CK_EN</name>
              <description>efuse core clk enable
1: enable clock
0: disable clock</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_CPU_CK_EN</name>
              <description>force on lp cpu clk enable
1: enable cpu clock
0: cpu clock is controlled by pmu</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RESET_EN</name>
          <description>configure peri in lp system reset enable</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>BUS_RESET_EN</name>
              <description>lp bus reset enable
1: enable reset
0: disable reset</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>LP_RNG_RESET_EN</name>
              <description>lp rng reset enable
1: enable reset
0: disable reset</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OTP_DBG_RESET_EN</name>
              <description>lp optdebug reset enable
1: enable reset
0: disable reset</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_UART_RESET_EN</name>
              <description>lp uart reset enable
1: enable reset
0: disable reset</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_IO_RESET_EN</name>
              <description>lp io reset enable
1: enable reset
0: disable reset</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_EXT_I2C_RESET_EN</name>
              <description>lp ext i2c reset enable
1: enable reset
0: disable reset</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_ANA_I2C_RESET_EN</name>
              <description>lp analog peri reset enable
1: enable reset
0: disable reset</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EFUSE_RESET_EN</name>
              <description>efuse core reset enable
1: enable reset
0: disable reset</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_CPU_RESET_EN</name>
              <description>force on lp cpu reset enable
1: enable cpu reset
0: cpu reset is controlled by pmu</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RNG_DATA</name>
          <description>RNG result register</description>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>RND_DATA</name>
              <description>get rng data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CPU</name>
          <description>configure lp cpu dbg enable</description>
          <addressOffset>0xC</addressOffset>
          <size>0x20</size>
          <resetValue>0x80000000</resetValue>
          <fields>
            <field>
              <name>LPCORE_DBGM_UNAVALIABLE</name>
              <description>disable lp cpu dbg bus
1: disable
0: enable</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BUS_TIMEOUT</name>
          <description>configure lp bus timeout</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <resetValue>0xBFFFC000</resetValue>
          <fields>
            <field>
              <name>LP_PERI_TIMEOUT_THRES</name>
              <description>the timeout thres which bus access time, the timeout clk is lp_aon_fast</description>
              <bitOffset>14</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_PERI_TIMEOUT_INT_CLEAR</name>
              <description>clear lp bus timeout interrupt</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>LP_PERI_TIMEOUT_PROTECT_EN</name>
              <description>enable lp bus timeout or not,when bus timeout, the ready will been force high by fsm
1: enable
0: disable</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BUS_TIMEOUT_ADDR</name>
          <description>the timeout address register</description>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>LP_PERI_TIMEOUT_ADDR</name>
              <description>when bus timeout, this register will record the timeout address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BUS_TIMEOUT_UID</name>
          <description>the timeout master id register</description>
          <addressOffset>0x18</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>LP_PERI_TIMEOUT_UID</name>
              <description>when bus timeout, this register will record the timeout master device</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MEM_CTRL</name>
          <description>configure uart memory power mode</description>
          <addressOffset>0x1C</addressOffset>
          <size>0x20</size>
          <resetValue>0x80000000</resetValue>
          <fields>
            <field>
              <name>UART_WAKEUP_FLAG_CLR</name>
              <description>clear uart wakeup latch
1: clear
0: no operation</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>UART_WAKEUP_FLAG</name>
              <description>latch uart wakeup event</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UART_WAKEUP_EN</name>
              <description>enable uart wakeup not not</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UART_MEM_FORCE_PD</name>
              <description>force off uart memory</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UART_MEM_FORCE_PU</name>
              <description>force on uart memory</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INTERRUPT_SOURCE</name>
          <description>record the lp cpu interrupt</description>
          <addressOffset>0x20</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>LP_INTERRUPT_SOURCE</name>
              <description>BIT5~BIT0: pmu_lp_int, modem_lp_int, lp_timer_lp_int, lp_uart_int, lp_i2c_int, lp_io_int</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RNG_CFG</name>
          <description>configure rng register</description>
          <addressOffset>0x24</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000FFE</resetValue>
          <fields>
            <field>
              <name>RNG_SAMPLE_ENABLE</name>
              <description>enable rng RO
1: enable RO
0: disable RO</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RNG_TIMER_PSCALE</name>
              <description>configure rng timer clk div</description>
              <bitOffset>1</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RNG_TIMER_EN</name>
              <description>enable rng xor async rng timer</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RTC_TIMER_EN</name>
              <description>enable rng xor rtc timer:
bit(0) : enable rtc timer before crc
Bit(1): enable rtc timer after crc</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RNG_SAMPLE_CNT</name>
              <description>get rng RO sample cnt</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RNG_DATA_SYNC</name>
          <description>rng result sync register</description>
          <addressOffset>0x28</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>RND_SYNC_DATA</name>
              <description>get rng sync result</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register derivedFrom="AES.DATE">
          <name>DATE</name>
          <description>version register</description>
          <addressOffset>0x3FC</addressOffset>
        </register>
