espressif/esp-bist/src/soc/esp32c5/esp32c5.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>LP_ANA</name>
      <description>LP_ANA Peripheral</description>
      <groupName>LP_ANA</groupName>
      <baseAddress>0x600B2C00</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x34</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>BOD_MODE0_CNTL</name>
          <description>Configure brownout mode0</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <resetValue>0x0FFC0100</resetValue>
          <fields>
            <field>
              <name>BOD_MODE0_CLOSE_FLASH_ENA</name>
              <description>enable suspend spi when brownout interrupt or not
1:enable
0:disable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BOD_MODE0_PD_RF_ENA</name>
              <description>enable power down RF when brownout interrupt or not
1:enable
0:disable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BOD_MODE0_INTR_WAIT</name>
              <description>set the undervoltage hold time for triggering brownout interrupt</description>
              <bitOffset>8</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BOD_MODE0_RESET_WAIT</name>
              <description>set the undervoltage hold time for triggering brownout reset</description>
              <bitOffset>18</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BOD_MODE0_CNT_CLR</name>
              <description>clear brownout count or not
1: clear
0: no operation</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BOD_MODE0_INTR_ENA</name>
              <description>enable brownout interrupt or not
1: enable
0: disable</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BOD_MODE0_RESET_SEL</name>
              <description>select brownout reset level
1: system reset
0: chip reset</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BOD_MODE0_RESET_ENA</name>
              <description>enable brownout reset or not
1: enable
0: disable</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BOD_MODE1_CNTL</name>
          <description>Configure brownout mode1</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>BOD_MODE1_RESET_ENA</name>
              <description>enable brownout mode1 reset or not
1: enable
0: disable</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CK_GLITCH_CNTL</name>
          <description>Configure power glitch</description>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>PWR_GLITCH_RESET_ENA</name>
              <description>enable powerglitch or not</description>
              <bitOffset>27</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CK_GLITCH_RESET_ENA</name>
              <description>reserved</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FIB_ENABLE</name>
          <description>configure FIB REG</description>
          <addressOffset>0xC</addressOffset>
          <size>0x20</size>
          <resetValue>0xFFFFFFFF</resetValue>
          <fields>
            <field>
              <name>ANA_FIB_ENA</name>
              <description>configure analog fib by software</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_RAW</name>
          <description>interrpt raw register</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>BOD_MODE0_INT_RAW</name>
              <description>brownout mode0 interrupt raw register</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_ST</name>
          <description>interrpt status register</description>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>BOD_MODE0_INT_ST</name>
              <description>brownout mode0 interrupt status register</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_ENA</name>
          <description>interrpt enable register</description>
          <addressOffset>0x18</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>BOD_MODE0_INT_ENA</name>
              <description>brownout mode0 interrupt enable register</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_CLR</name>
          <description>interrpt clear register</description>
          <addressOffset>0x1C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>BOD_MODE0_INT_CLR</name>
              <description>brownout mode0 interrupt clear register</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LP_INT_RAW</name>
          <description>lp interrupt raw register</description>
          <addressOffset>0x20</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>BOD_MODE0_LP_INT_RAW</name>
              <description>brownout mode0 lp interrupt raw register</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LP_INT_ST</name>
          <description>lp interrupt status register</description>
          <addressOffset>0x24</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>BOD_MODE0_LP_INT_ST</name>
              <description>brownout mode0 lp interrupt status register</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LP_INT_ENA</name>
          <description>lp interrupt enable register</description>
          <addressOffset>0x28</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>BOD_MODE0_LP_INT_ENA</name>
              <description>brownout mode0 lp interrupt enable register</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LP_INT_CLR</name>
          <description>lp interrupt clear register</description>
          <addressOffset>0x2C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>BOD_MODE0_LP_INT_CLR</name>
              <description>brownout mode0 lp interrupt clear register</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register derivedFrom="AES.DATE">
          <name>DATE</name>
          <description>version register</description>
          <addressOffset>0x3FC</addressOffset>
        </register>
