espressif/esp-bist/src/soc/esp32c5/esp32c5.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>LP_APM</name>
      <description>LP_APM Peripheral</description>
      <baseAddress>0x600B3800</baseAddress>
      <interrupt>
        <name>LP_APM_M0</name>
        <value>20</value>
      </interrupt>
      <interrupt>
        <name>LP_APM_M1</name>
        <value>21</value>
      </interrupt>
      <interrupt>
        <name>LP_APM0</name>
        <value>41</value>
      </interrupt>
      <registers>
        <register>
          <name>REGION_FILTER_EN</name>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>REGION_FILTER_EN</name>
              <description>Configure bit $n (0-7) to enable region $n (0-7).
0: Disable
1: Enable
</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <cluster>
          <dim>8</dim>
          <dimIncrement>0xC</dimIncrement>
          <dimIndex>0-7</dimIndex>
          <name>REGION%s</name>
          <description>Cluster REGION%s, containing REGION*_ADDR_START, REGION*_ADDR_END, REGION*_ATTR</description>
          <addressOffset>0x4</addressOffset>
          <register>
            <name>ADDR_START</name>
            <description>Region address register</description>
            <addressOffset>0x0</addressOffset>
            <size>0x20</size>
            <fields>
              <field>
                <name>ADDR_START</name>
                <description>Configures the start address of region 0.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>ADDR_END</name>
            <description>Region address register</description>
            <addressOffset>0x4</addressOffset>
            <size>0x20</size>
            <fields>
              <field>
                <name>ADDR_END</name>
                <description>Configures the end address of region 0.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>ATTR</name>
            <description>Region access permissions configuration register</description>
            <addressOffset>0x8</addressOffset>
            <size>0x20</size>
            <fields>
              <field>
                <dim>3</dim>
                <dimIncrement>0x4</dimIncrement>
                <dimIndex>0-2</dimIndex>
                <name>R%s_X</name>
                <description>Configures the execution permission in region X</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <dim>3</dim>
                <dimIncrement>0x4</dimIncrement>
                <dimIndex>0-2</dimIndex>
                <name>R%s_W</name>
                <description>Configures the write permission in region X</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <dim>3</dim>
                <dimIncrement>0x4</dimIncrement>
                <dimIndex>0-2</dimIndex>
                <name>R%s_R</name>
                <description>Configures the write permission in region X</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>LOCK</name>
                <description>Configures to lock the value of region 0 configuration registers
(LP_APM_REGION0_ADDR_START_REG, LP_APM_REGION0_ADDR_END_REG and
LP_APM_REGION0_ATTR_REG).
0: Do not lock
1: Lock
</description>
                <bitOffset>11</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
        </cluster>
        <register>
          <name>FUNC_CTRL</name>
          <description>APM access path permission management register</description>
          <addressOffset>0xC4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <dim>2</dim>
              <dimIncrement>0x1</dimIncrement>
              <dimIndex>0-1</dimIndex>
              <name>M%s_FUNC_EN</name>
              <description>Configures to enable permission management for LP_APM_CTRL M%s.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <cluster>
          <dim>2</dim>
          <dimIncrement>0x10</dimIncrement>
          <dimIndex>0-1</dimIndex>
          <name>M%s</name>
          <description>Cluster M%s, containing M?_STATUS, M?_STATUS_CLR, M?_EXCEPTION_INFO0, M?_EXCEPTION_INFO1</description>
          <addressOffset>0xC8</addressOffset>
          <register>
            <name>STATUS</name>
            <description>LP_APM_CTRL M0 status register</description>
            <addressOffset>0x0</addressOffset>
            <size>0x20</size>
            <fields>
              <field>
                <name>EXCEPTION_STATUS</name>
                <description>Represents exception status.
bit0: 1 represents permission restrictions
bit1: 1 represents address out of bounds
</description>
                <bitOffset>0</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>STATUS_CLR</name>
            <description>LP_APM_CTRL M0 status clear register</description>
            <addressOffset>0x4</addressOffset>
            <size>0x20</size>
            <fields>
              <field>
                <name>EXCEPTION_STATUS_CLR</name>
                <description>Configures to clear exception status.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>write-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>EXCEPTION_INFO0</name>
            <description>LP_APM_CTRL M0 exception information register</description>
            <addressOffset>0x8</addressOffset>
            <size>0x20</size>
            <fields>
              <field>
                <name>EXCEPTION_REGION</name>
                <description>Represents the region where an exception occurs.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>EXCEPTION_MODE</name>
                <description>Represents the master's security mode when an exception occurs.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>EXCEPTION_ID</name>
                <description>Represents master ID when an exception occurs.</description>
                <bitOffset>18</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>EXCEPTION_INFO1</name>
            <description>LP_APM_CTRL M0 exception information register</description>
            <addressOffset>0xC</addressOffset>
            <size>0x20</size>
            <fields>
              <field>
                <name>EXCEPTION_ADDR</name>
                <description>Represents the access address when an exception occurs.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
        </cluster>
        <register>
          <name>INT_EN</name>
          <description>LP_APM_CTRL M0/1 interrupt enable register</description>
          <addressOffset>0xE8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <dim>2</dim>
              <dimIncrement>0x1</dimIncrement>
              <dimIndex>0-1</dimIndex>
              <name>M%s_APM</name>
              <description>Configures to enable LP_APM_CTRL M%s interrupt.
0: Disable
1: Enable
</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CLOCK_GATE</name>
          <description>Clock gating register</description>
          <addressOffset>0xEC</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CLK_EN</name>
              <description>Configures whether to keep the clock always on.
0: Enable automatic clock gating
1: Keep the clock always on
</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register derivedFrom="AES.DATE">
          <name>DATE</name>
          <description>Version control register</description>
          <addressOffset>0xFC</addressOffset>
        </register>
