espressif/esp-bist/src/soc/esp32c5/esp32c5.svd
        <register>
          <name>INT_RAW</name>
          <description>Interrupt raw status register</description>
          <addressOffset>0x114</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>TIMER0_STOP</name>
              <description>Raw status bit: The raw interrupt status of the interrupt triggered when the timer 0 stops.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMER1_STOP</name>
              <description>Raw status bit: The raw interrupt status of the interrupt triggered when the timer 1 stops.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMER2_STOP</name>
              <description>Raw status bit: The raw interrupt status of the interrupt triggered when the timer 2 stops.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMER0_TEZ</name>
              <description>Raw status bit: The raw interrupt status of the interrupt triggered by a PWM timer 0 TEZ event.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMER1_TEZ</name>
              <description>Raw status bit: The raw interrupt status of the interrupt triggered by a PWM timer 1 TEZ event.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMER2_TEZ</name>
              <description>Raw status bit: The raw interrupt status of the interrupt triggered by a PWM timer 2 TEZ event.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMER0_TEP</name>
              <description>Raw status bit: The raw interrupt status of the interrupt triggered by a PWM timer 0 TEP event.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMER1_TEP</name>
              <description>Raw status bit: The raw interrupt status of the interrupt triggered by a PWM timer 1 TEP event.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMER2_TEP</name>
              <description>Raw status bit: The raw interrupt status of the interrupt triggered by a PWM timer 2 TEP event.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FAULT0</name>
              <description>Raw status bit: The raw interrupt status of the interrupt triggered when event_f0 starts.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FAULT1</name>
              <description>Raw status bit: The raw interrupt status of the interrupt triggered when event_f1 starts.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FAULT2</name>
              <description>Raw status bit: The raw interrupt status of the interrupt triggered when event_f2 starts.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FAULT0_CLR</name>
              <description>Raw status bit: The raw interrupt status of the interrupt triggered when event_f0 clears.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FAULT1_CLR</name>
              <description>Raw status bit: The raw interrupt status of the interrupt triggered when event_f1 clears.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FAULT2_CLR</name>
              <description>Raw status bit: The raw interrupt status of the interrupt triggered when event_f2 clears.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CMPR0_TEA</name>
              <description>Raw status bit: The raw interrupt status of the interrupt triggered by a PWM operator 0 TEA event</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CMPR1_TEA</name>
              <description>Raw status bit: The raw interrupt status of the interrupt triggered by a PWM operator 1 TEA event</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CMPR2_TEA</name>
              <description>Raw status bit: The raw interrupt status of the interrupt triggered by a PWM operator 2 TEA event</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CMPR0_TEB</name>
              <description>Raw status bit: The raw interrupt status of the interrupt triggered by a PWM operator 0 TEB event</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CMPR1_TEB</name>
              <description>Raw status bit: The raw interrupt status of the interrupt triggered by a PWM operator 1 TEB event</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CMPR2_TEB</name>
              <description>Raw status bit: The raw interrupt status of the interrupt triggered by a PWM operator 2 TEB event</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TZ0_CBC</name>
              <description>Raw status bit: The raw interrupt status of the interrupt triggered by a cycle-by-cycle mode action on PWM0.</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TZ1_CBC</name>
              <description>Raw status bit: The raw interrupt status of the interrupt triggered by a cycle-by-cycle mode action on PWM1.</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TZ2_CBC</name>
              <description>Raw status bit: The raw interrupt status of the interrupt triggered by a cycle-by-cycle mode action on PWM2.</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TZ0_OST</name>
              <description>Raw status bit: The raw interrupt status of the interrupt triggered by a one-shot mode action on PWM0.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TZ1_OST</name>
              <description>Raw status bit: The raw interrupt status of the interrupt triggered by a one-shot mode action on PWM1.</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TZ2_OST</name>
              <description>Raw status bit: The raw interrupt status of the interrupt triggered by a one-shot mode action on PWM2.</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CAP0</name>
              <description>Raw status bit: The raw interrupt status of the interrupt triggered by capture on CAP0.</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CAP1</name>
              <description>Raw status bit: The raw interrupt status of the interrupt triggered by capture on CAP1.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CAP2</name>
              <description>Raw status bit: The raw interrupt status of the interrupt triggered by capture on CAP2.</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_ST</name>
          <description>Interrupt masked status register</description>
          <addressOffset>0x118</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>TIMER0_STOP</name>
              <description>Masked status bit: The masked interrupt status of the interrupt triggered when the timer 0 stops.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TIMER1_STOP</name>
              <description>Masked status bit: The masked interrupt status of the interrupt triggered when the timer 1 stops.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TIMER2_STOP</name>
              <description>Masked status bit: The masked interrupt status of the interrupt triggered when the timer 2 stops.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TIMER0_TEZ</name>
              <description>Masked status bit: The masked interrupt status of the interrupt triggered by a PWM timer 0 TEZ event.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TIMER1_TEZ</name>
              <description>Masked status bit: The masked interrupt status of the interrupt triggered by a PWM timer 1 TEZ event.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TIMER2_TEZ</name>
              <description>Masked status bit: The masked interrupt status of the interrupt triggered by a PWM timer 2 TEZ event.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TIMER0_TEP</name>
              <description>Masked status bit: The masked interrupt status of the interrupt triggered by a PWM timer 0 TEP event.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TIMER1_TEP</name>
              <description>Masked status bit: The masked interrupt status of the interrupt triggered by a PWM timer 1 TEP event.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TIMER2_TEP</name>
              <description>Masked status bit: The masked interrupt status of the interrupt triggered by a PWM timer 2 TEP event.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>FAULT0</name>
              <description>Masked status bit: The masked interrupt status of the interrupt triggered when event_f0 starts.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>FAULT1</name>
              <description>Masked status bit: The masked interrupt status of the interrupt triggered when event_f1 starts.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>FAULT2</name>
              <description>Masked status bit: The masked interrupt status of the interrupt triggered when event_f2 starts.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>FAULT0_CLR</name>
              <description>Masked status bit: The masked interrupt status of the interrupt triggered when event_f0 clears.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>FAULT1_CLR</name>
              <description>Masked status bit: The masked interrupt status of the interrupt triggered when event_f1 clears.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>FAULT2_CLR</name>
              <description>Masked status bit: The masked interrupt status of the interrupt triggered when event_f2 clears.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CMPR0_TEA</name>
              <description>Masked status bit: The masked interrupt status of the interrupt triggered by a PWM operator 0 TEA event</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CMPR1_TEA</name>
              <description>Masked status bit: The masked interrupt status of the interrupt triggered by a PWM operator 1 TEA event</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CMPR2_TEA</name>
              <description>Masked status bit: The masked interrupt status of the interrupt triggered by a PWM operator 2 TEA event</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CMPR0_TEB</name>
              <description>Masked status bit: The masked interrupt status of the interrupt triggered by a PWM operator 0 TEB event</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CMPR1_TEB</name>
              <description>Masked status bit: The masked interrupt status of the interrupt triggered by a PWM operator 1 TEB event</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CMPR2_TEB</name>
              <description>Masked status bit: The masked interrupt status of the interrupt triggered by a PWM operator 2 TEB event</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TZ0_CBC</name>
              <description>Masked status bit: The masked interrupt status of the interrupt triggered by a cycle-by-cycle mode action on PWM0.</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TZ1_CBC</name>
              <description>Masked status bit: The masked interrupt status of the interrupt triggered by a cycle-by-cycle mode action on PWM1.</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TZ2_CBC</name>
              <description>Masked status bit: The masked interrupt status of the interrupt triggered by a cycle-by-cycle mode action on PWM2.</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TZ0_OST</name>
              <description>Masked status bit: The masked interrupt status of the interrupt triggered by a one-shot mode action on PWM0.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TZ1_OST</name>
              <description>Masked status bit: The masked interrupt status of the interrupt triggered by a one-shot mode action on PWM1.</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TZ2_OST</name>
              <description>Masked status bit: The masked interrupt status of the interrupt triggered by a one-shot mode action on PWM2.</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CAP0</name>
              <description>Masked status bit: The masked interrupt status of the interrupt triggered by capture on CAP0.</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CAP1</name>
              <description>Masked status bit: The masked interrupt status of the interrupt triggered by capture on CAP1.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CAP2</name>
              <description>Masked status bit: The masked interrupt status of the interrupt triggered by capture on CAP2.</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
