espressif/esp-bist/src/soc/esp32c5/esp32c5.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>PARL_IO</name>
      <description>Parallel IO Controller</description>
      <groupName>PARL_IO</groupName>
      <baseAddress>0x60015000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x54</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>PARL_IO_TX</name>
        <value>67</value>
      </interrupt>
      <interrupt>
        <name>PARL_IO_RX</name>
        <value>68</value>
      </interrupt>
      <registers>
        <register>
          <name>RX_MODE_CFG</name>
          <description>Parallel RX Sampling mode configuration register.</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <resetValue>0x00E00000</resetValue>
          <fields>
            <field>
              <name>RX_EXT_EN_SEL</name>
              <description>Configures rx external enable signal selection from IO PAD.</description>
              <bitOffset>21</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RX_SW_EN</name>
              <description>Write 1 to enable data sampling by software.</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RX_EXT_EN_INV</name>
              <description>Write 1 to invert the external enable signal.</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RX_PULSE_SUBMODE_SEL</name>
              <description>Configures the rxd pulse sampling submode.
0: positive pulse start(data bit included) &amp;&amp;  positive pulse end(data bit included)
1: positive pulse start(data bit included) &amp;&amp; positive pulse end (data bit excluded)
2: positive pulse start(data bit excluded) &amp;&amp; positive pulse end (data bit included)
3: positive pulse start(data bit excluded) &amp;&amp; positive pulse end (data bit excluded)
4: positive pulse start(data bit included) &amp;&amp; length end
5: positive pulse start(data bit excluded) &amp;&amp; length end</description>
              <bitOffset>27</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RX_SMP_MODE_SEL</name>
              <description>Configures the rxd sampling mode.
0: external level enable mode
1: external pulse enable mode
2: internal software enable mode</description>
              <bitOffset>30</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RX_DATA_CFG</name>
          <description>Parallel RX data configuration register.</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <resetValue>0x60000000</resetValue>
          <fields>
            <field>
              <name>RX_BITLEN</name>
              <description>Configures expected byte number of received data.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>19</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RX_DATA_ORDER_INV</name>
              <description>Write 1 to invert bit order of one byte sent from RX_FIFO to DMA.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RX_BUS_WID_SEL</name>
              <description>Configures the rxd bus width.
0: bus width is 1.
1: bus width is 2.
2: bus width is 4.
3: bus width is 8.</description>
              <bitOffset>29</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RX_GENRL_CFG</name>
          <description>Parallel RX general configuration register.</description>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <resetValue>0x21FFE000</resetValue>
          <fields>
            <field>
              <name>RX_GATING_EN</name>
              <description>Write 1 to enable the clock gating of output rx clock.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RX_TIMEOUT_THRES</name>
              <description>Configures threshold of timeout counter.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RX_TIMEOUT_EN</name>
              <description>Write 1 to enable timeout function to generate error eof.</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RX_EOF_GEN_SEL</name>
              <description>Configures the DMA eof generated mechanism. 1'b0: eof generated by data bit length. 1'b1: eof generated by external enable signal.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RX_START_CFG</name>
          <description>Parallel RX Start configuration register.</description>
          <addressOffset>0xC</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>RX_START</name>
              <description>Write 1 to start rx data sampling.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TX_DATA_CFG</name>
          <description>Parallel TX data configuration register.</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <resetValue>0x60000000</resetValue>
          <fields>
            <field>
              <name>TX_BITLEN</name>
              <description>Configures expected byte number of sent data.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>19</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TX_DATA_ORDER_INV</name>
              <description>Write 1 to invert bit order of one byte sent from TX_FIFO to IO data.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TX_BUS_WID_SEL</name>
              <description>Configures the txd bus width.
0: bus width is 1.
1: bus width is 2.
2: bus width is 4.
3: bus width is 8.</description>
              <bitOffset>29</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TX_START_CFG</name>
          <description>Parallel TX Start configuration register.</description>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>TX_START</name>
              <description>Write 1 to start tx data transmit.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TX_GENRL_CFG</name>
          <description>Parallel TX general configuration register.</description>
          <addressOffset>0x18</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>TX_EOF_GEN_SEL</name>
              <description>Configures the tx eof generated mechanism. 1'b0: eof generated by data bit length. 1'b1: eof generated by DMA eof.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TX_IDLE_VALUE</name>
              <description>Configures bus value of transmitter in IDLE state.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TX_GATING_EN</name>
              <description>Write 1 to enable the clock gating of output tx clock.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TX_VALID_OUTPUT_EN</name>
              <description>Write 1 to enable the output of tx data valid signal.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FIFO_CFG</name>
          <description>Parallel IO FIFO configuration register.</description>
          <addressOffset>0x1C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>TX_FIFO_SRST</name>
              <description>Write 1 to reset async fifo in tx module.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RX_FIFO_SRST</name>
              <description>Write 1 to reset async fifo in rx module.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_UPDATE</name>
          <description>Parallel IO FIFO configuration register.</description>
          <addressOffset>0x20</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>RX_REG_UPDATE</name>
              <description>Write 1 to update rx register configuration.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ST</name>
          <description>Parallel IO module status register0.</description>
          <addressOffset>0x24</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>TX_READY</name>
              <description>Represents the status that tx is ready to transmit.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_ENA</name>
          <description>Parallel IO interrupt enable singal configuration register.</description>
          <addressOffset>0x28</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>TX_FIFO_REMPTY</name>
              <description>Write 1 to enable TX_FIFO_REMPTY_INT.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RX_FIFO_WOVF</name>
              <description>Write 1 to enable RX_FIFO_WOVF_INT.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TX_EOF</name>
              <description>Write 1 to enable TX_EOF_INT.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_RAW</name>
          <description>Parallel IO interrupt raw singal status register.</description>
          <addressOffset>0x2C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>TX_FIFO_REMPTY</name>
              <description>The raw interrupt status of TX_FIFO_REMPTY_INT.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RX_FIFO_WOVF</name>
              <description>The raw interrupt status of RX_FIFO_WOVF_INT.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TX_EOF</name>
              <description>The raw interrupt status of TX_EOF_INT.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_ST</name>
          <description>Parallel IO interrupt singal status register.</description>
          <addressOffset>0x30</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>TX_FIFO_REMPTY</name>
              <description>The masked interrupt status of TX_FIFO_REMPTY_INT.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RX_FIFO_WOVF</name>
              <description>The masked interrupt status of RX_FIFO_WOVF_INT.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TX_EOF</name>
              <description>The masked interrupt status of TX_EOF_INT.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_CLR</name>
          <description>Parallel IO interrupt  clear singal configuration register.</description>
          <addressOffset>0x34</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>TX_FIFO_REMPTY</name>
              <description>Write 1 to clear TX_FIFO_REMPTY_INT.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>RX_FIFO_WOVF</name>
              <description>Write 1 to clear RX_FIFO_WOVF_INT.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>TX_EOF</name>
              <description>Write 1 to clear TX_EOF_INT.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
          </fields>
        </register>
        <register>
          <name>RX_ST0</name>
          <description>Parallel IO RX status register0</description>
          <addressOffset>0x38</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>RX_CNT</name>
              <description>Indicates the cycle number of reading Rx FIFO.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RX_FIFO_WR_BIT_CNT</name>
              <description>Indicates the current written bit number into Rx FIFO.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>19</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RX_ST1</name>
          <description>Parallel IO RX status register1</description>
          <addressOffset>0x3C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>RX_FIFO_RD_BIT_CNT</name>
              <description>Indicates the current read bit number from Rx FIFO.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>19</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TX_ST0</name>
          <description>Parallel IO TX status register0</description>
          <addressOffset>0x40</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>TX_CNT</name>
              <description>Indicates the cycle number of reading Tx FIFO.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TX_FIFO_RD_BIT_CNT</name>
              <description>Indicates the current read bit number from Tx FIFO.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>19</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RX_CLK_CFG</name>
          <description>Parallel IO RX clk configuration register</description>
          <addressOffset>0x44</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>RX_CLK_I_INV</name>
              <description>Write 1 to invert the input Rx core clock.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RX_CLK_O_INV</name>
              <description>Write 1 to invert the output Rx core clock.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TX_CLK_CFG</name>
          <description>Parallel IO TX clk configuration register</description>
          <addressOffset>0x48</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>TX_CLK_I_INV</name>
              <description>Write 1 to invert the input Tx core clock.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TX_CLK_O_INV</name>
              <description>Write 1 to invert the output Tx core clock.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CLK</name>
          <description>Parallel IO clk configuration register</description>
          <addressOffset>0x120</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>EN</name>
              <description>Force clock on for this register file</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register derivedFrom="AES.DATE">
          <name>VERSION</name>
          <description>Version register.</description>
          <addressOffset>0x3FC</addressOffset>
        </register>
