espressif/esp-bist/src/soc/esp32c5/esp32c5.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>SLC</name>
      <description>SDIO SLC</description>
      <groupName>SDIO</groupName>
      <baseAddress>0x60017000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>SLCCONF0</name>
          <description>DMA configuration</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0xFF3CFF00</resetValue>
          <fields>
            <field>
              <name>SDIO_SLC0_TX_RST</name>
              <description>Configures whether to reset TX (host to slave) FSM (finite state machine) in SLC0.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SDIO_SLC0_RX_RST</name>
              <description>Configures whether to reset RX (slave to host) FSM in SCL0.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SDIO_SLC0_TX_LOOP_TEST</name>
              <description>Configures whether SCL0 loops around when the slave buffer finishes receiving packets from the host.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SDIO_SLC0_RX_LOOP_TEST</name>
              <description>Configures whether SCL0 loops around when the slave buffer finishes sending packets to the host.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SDIO_SLC0_RX_AUTO_WRBACK</name>
              <description>Configures whether SCL0 changes the owner bit of RX linked list.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SDIO_SLC0_RX_NO_RESTART_CLR</name>
              <description>Please initialize to 1, and do not modify it.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SDIO_SLC0_RXDSCR_BURST_EN</name>
              <description>Configures whether SCL0 can use AHB burst operation when reading the RX linked list from memory.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SDIO_SLC0_RXDATA_BURST_EN</name>
              <description>Configures whether SCL0 can use AHB burst operation when read data from memory.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SDIO_SLC0_TXDSCR_BURST_EN</name>
              <description>Configures whether SCL0 can use AHB burst operation when read the TX linked list from memory.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SDIO_SLC0_TXDATA_BURST_EN</name>
              <description>Configures whether SCL0 can use AHB burst operation when send data to memory.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SDIO_SLC0_TOKEN_AUTO_CLR</name>
              <description>Please initialize to 0, and do not modify it.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SDIO_SLC1_TX_RST</name>
              <description>Configures whether to reset TX FSM in SLC1.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SDIO_SLC1_RX_RST</name>
              <description>Configures whether to reset RX FSM in SLC1.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SDIO_SLC1_TX_LOOP_TEST</name>
              <description>Configures whether SCL1 loops around when the slave buffer finishes receiving packets from the host.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SDIO_SLC1_RX_LOOP_TEST</name>
              <description>Configures whether SCL1 loops around when the slave buffer finishes sending packets to the host.</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SDIO_SLC1_RX_AUTO_WRBACK</name>
              <description>Configures whether SCL1 changes the owner bit of the RX linked list.</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SDIO_SLC1_RX_NO_RESTART_CLR</name>
              <description>Please initialize to 1, and do not modify it.</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SDIO_SLC1_RXDSCR_BURST_EN</name>
              <description>Configures whether SCL1 can use AHB burst operation when read the RX linked list from memory.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SDIO_SLC1_RXDATA_BURST_EN</name>
              <description>Configures whether SCL1 can use AHB burst operation when reading data from memory.</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SDIO_SLC1_TXDSCR_BURST_EN</name>
              <description>Configures whether SCL1 can use AHB burst operation when read the TX linked list from memory.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SDIO_SLC1_TXDATA_BURST_EN</name>
              <description>Configures whether SCL1 can use AHB burst operation when send data to memory.</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SDIO_SLC1_TOKEN_AUTO_CLR</name>
              <description>Please initialize to 0, and do not modify it.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SLC0RX_LINK</name>
          <description>SLC0 RX linked list configuration</description>
          <addressOffset>0x3C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x80000000</resetValue>
          <fields>
            <field>
              <name>SDIO_SLC0_RXLINK_STOP</name>
              <description>Configures whether to stop SLC0 RX linked list operation.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SDIO_SLC0_RXLINK_START</name>
              <description>Configures whether to start SLC0 RX linked list operation from the address indicated by SDIO_SLC0_RXLINK_ADDR.</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SDIO_SLC0_RXLINK_RESTART</name>
              <description>Configures whether to restart and continue SLC0 RX linked list operation.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SDIO_SLC0_RXLINK_PARK</name>
              <description>Represents SLC0 RX linked list FSM state.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SLC0RX_LINK_ADDR</name>
          <description>SLC0 RX linked list address</description>
          <addressOffset>0x40</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SDIO_SLC0_RXLINK_ADDR</name>
              <description>Configures SLC0 RX linked list initial address.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SLC0TX_LINK</name>
          <description>SLC0 TX linked list configuration</description>
          <addressOffset>0x44</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x80000000</resetValue>
          <fields>
            <field>
              <name>SDIO_SLC0_TXLINK_STOP</name>
              <description>Configures whether to stop SLC0 TX linked list operation.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SDIO_SLC0_TXLINK_START</name>
              <description>Configures whether to start SLC0 TX linked list operation from the address indicated by SDIO_SLC0_TXLINK_ADDR.</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SDIO_SLC0_TXLINK_RESTART</name>
              <description>Configures whether to restart and continue SLC0 TX linked list operation.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SDIO_SLC0_TXLINK_PARK</name>
              <description>Represents SLC0 TX linked list FSM state.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SLC0TX_LINK_ADDR</name>
          <description>SLC0 TX linked list address</description>
          <addressOffset>0x48</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SDIO_SLC0_TXLINK_ADDR</name>
              <description>Configures SLC0 TX linked list initial address.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SLC1RX_LINK</name>
          <description>SLC1 RX linked list configuration</description>
          <addressOffset>0x4C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x80000000</resetValue>
          <fields>
            <field>
              <name>SDIO_SLC1_RXLINK_STOP</name>
              <description>Configures whether to stop SLC1 RX linked list operation.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SDIO_SLC1_RXLINK_START</name>
              <description>Configures whether to start SLC1 RX linked list operation from the address indicated by SDIO_SLC1_RXLINK_ADDR.</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SDIO_SLC1_RXLINK_RESTART</name>
              <description>Configures whether to restart and continue SLC1 RX linked list operation.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SDIO_SLC1_RXLINK_PARK</name>
              <description>Represents SLC1 RX linked list FSM state.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SLC1RX_LINK_ADDR</name>
          <description>SLC1 RX linked list address</description>
          <addressOffset>0x50</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SDIO_SLC1_RXLINK_ADDR</name>
              <description>Configures SLC1 RX linked list initial address.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SLC1TX_LINK</name>
          <description>SLC1 TX linked list configuration</description>
          <addressOffset>0x54</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x80000000</resetValue>
          <fields>
            <field>
              <name>SDIO_SLC1_TXLINK_STOP</name>
              <description>Configures whether to stop SLC1 TX linked list operation.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SDIO_SLC1_TXLINK_START</name>
              <description>Configures whether to start SLC1 TX linked list operation from the address indicated by SDIO_SLC1_TXLINK_ADDR.</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SDIO_SLC1_TXLINK_RESTART</name>
              <description>Configures whether to restart and continue SLC1 TX linked list operation.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SDIO_SLC1_TXLINK_PARK</name>
              <description>Represents SLC1 TX linked list FSM state.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SLC1TX_LINK_ADDR</name>
          <description>SLC1 TX linked list address</description>
          <addressOffset>0x58</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SDIO_SLC1_TXLINK_ADDR</name>
              <description>Configures SLC1 TX linked list initial address.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SLC0TOKEN1</name>
          <description>SLC0 receiving buffer configuration</description>
          <addressOffset>0x64</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SDIO_SLC0_TOKEN1_WDATA</name>
              <description>Configures SLC0 token 1 value.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>11</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>SDIO_SLC0_TOKEN1_WR</name>
              <description>Configures this bit to 1 to write SDIO_SLC0_TOKEN1_WDATA into SDIO_SLC0_TOKEN1.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>SDIO_SLC0_TOKEN1_INC</name>
              <description>Configures this bit to 1 to add 1 to SDIO_SLC0_TOKEN1.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>SDIO_SLC0_TOKEN1_INC_MORE</name>
              <description>Configures this bit to 1 to add the value of SDIO_SLC0_TOKEN1_WDATA to SDIO_SLC0_TOKEN1.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>SDIO_SLC0_TOKEN1</name>
              <description>Represents the SLC0 accumulated number of buffers for receiving packets.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SLC1TOKEN1</name>
          <description>SLC1 receiving buffer configuration</description>
          <addressOffset>0x6C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SDIO_SLC1_TOKEN1_WDATA</name>
              <description>Configures SLC1 token1 value.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>11</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>SDIO_SLC0_TOKEN1_WR</name>
              <description>Configures this bit to 1 to write SDIO_SLC1_TOKEN1_WDATA into SDIO_SLC1_TOKEN1.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>SDIO_SLC0_TOKEN1_INC</name>
              <description>Configures this bit to 1 to add 1 to SDIO_SLC1_TOKEN1.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>SDIO_SLC0_TOKEN1_INC_MORE</name>
              <description>Configures this bit to 1 to add the value of SDIO_SLC1_TOKEN1_WDATA to SDIO_SLC1_TOKEN1.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>SDIO_SLC0_TOKEN1</name>
              <description>Represents the SLC1 accumulated number of buffers for receiving packets.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SLCCONF1</name>
          <description>DMA configuration</description>
          <addressOffset>0x70</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00300078</resetValue>
          <fields>
            <field>
              <name>SDIO_SDIO_CMD_HOLD_EN</name>
              <description>Please initialize to 0, and do not modify it.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SDIO_SLC0_LEN_AUTO_CLR</name>
              <description>Please initialize to 0, and do not modify it.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SDIO_SLC0_TX_STITCH_EN</name>
              <description>Please initialize to 0, and do not modify it.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SDIO_SLC0_RX_STITCH_EN</name>
              <description>Please initialize to 0, and do not modify it.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SDIO_HOST_INT_LEVEL_SEL</name>
              <description>Configures the polarity of interrupt to host.</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SDIO_SLC1_TX_STITCH_EN</name>
              <description>Please initialize to 0, and do not modify it.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SDIO_SLC1_RX_STITCH_EN</name>
              <description>Please initialize to 0, and do not modify it.</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SLC_RX_DSCR_CONF</name>
          <description>DMA slave to host configuration register</description>
          <addressOffset>0xA8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0203701A</resetValue>
          <fields>
            <field>
              <name>SDIO_SLC0_TOKEN_NO_REPLACE</name>
              <description>Please initialize to 1, and do not modify it.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SLC0_LEN_CONF</name>
          <description>Length control of transmitting packets</description>
          <addressOffset>0xF4</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <resetValue>0x20000000</resetValue>
          <fields>
            <field>
              <name>SDIO_SLC0_LEN_WDATA</name>
              <description>Configures the length of the data that the slave wants to send.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>20</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>SDIO_SLC0_LEN_WR</name>
              <description>Configures this bit to 1 to write SDIO_SLC0_LEN_WDATA into SDIO_SLC0_LEN and SLCHOST_HOSTSLCHOST_SLC0_LEN.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>SDIO_SLC0_LEN_INC</name>
              <description>Configures this bit to 1 to add 1 to SDIO_SLC0_LEN and SLCHOST_HOSTSLCHOST_SLC0_LEN.</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>SDIO_SLC0_LEN_INC_MORE</name>
              <description>Configures this bit to 1 to add the value of SDIO_SLC0_LEN_WDATA to SDIO_SLC0_LEN and SLCHOST_HOSTSLCHOST_SLC0_LEN.</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
