espressif/esp-bist/src/soc/esp32c5/esp32c5.svd
        <register>
          <name>COMB_PD_SITE3_UNIT1_VT2_CONF1</name>
          <description>needs desc</description>
          <addressOffset>0x11C</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000050</resetValue>
          <fields>
            <field>
              <name>MONITOR_EN_VT2_PD_SITE3_UNIT1</name>
              <description>needs field desc</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TIMING_ERR_CNT_CLR_VT2_PD_SITE3_UNIT1</name>
              <description>needs field desc</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DELAY_LIMIT_VT2_PD_SITE3_UNIT1</name>
              <description>needs field desc</description>
              <bitOffset>2</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DELAY_NUM_O_VT2_PD_SITE3_UNIT1</name>
              <description>needs field desc</description>
              <bitOffset>23</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TIMING_ERR_VT2_PD_SITE3_UNIT1</name>
              <description>needs field desc</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>COMB_PD_SITE3_UNIT2_VT2_CONF1</name>
          <description>needs desc</description>
          <addressOffset>0x120</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000050</resetValue>
          <fields>
            <field>
              <name>MONITOR_EN_VT2_PD_SITE3_UNIT2</name>
              <description>needs field desc</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TIMING_ERR_CNT_CLR_VT2_PD_SITE3_UNIT2</name>
              <description>needs field desc</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DELAY_LIMIT_VT2_PD_SITE3_UNIT2</name>
              <description>needs field desc</description>
              <bitOffset>2</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DELAY_NUM_O_VT2_PD_SITE3_UNIT2</name>
              <description>needs field desc</description>
              <bitOffset>23</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TIMING_ERR_VT2_PD_SITE3_UNIT2</name>
              <description>needs field desc</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>COMB_PD_SITE3_UNIT3_VT2_CONF1</name>
          <description>needs desc</description>
          <addressOffset>0x124</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000050</resetValue>
          <fields>
            <field>
              <name>MONITOR_EN_VT2_PD_SITE3_UNIT3</name>
              <description>needs field desc</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TIMING_ERR_CNT_CLR_VT2_PD_SITE3_UNIT3</name>
              <description>needs field desc</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DELAY_LIMIT_VT2_PD_SITE3_UNIT3</name>
              <description>needs field desc</description>
              <bitOffset>2</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DELAY_NUM_O_VT2_PD_SITE3_UNIT3</name>
              <description>needs field desc</description>
              <bitOffset>23</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TIMING_ERR_VT2_PD_SITE3_UNIT3</name>
              <description>needs field desc</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>COMB_PD_SITE0_UNIT0_VT0_CONF2</name>
          <description>needs desc</description>
          <addressOffset>0x128</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>MONITOR_EDG_MOD_VT0_PD_SITE0_UNIT0</name>
              <description>needs field desc</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DELAY_OVF_VT0_PD_SITE0_UNIT0</name>
              <description>needs field desc</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TIMING_ERR_CNT_O_VT0_PD_SITE0_UNIT0</name>
              <description>needs field desc</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>COMB_PD_SITE0_UNIT1_VT0_CONF2</name>
          <description>needs desc</description>
          <addressOffset>0x12C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>MONITOR_EDG_MOD_VT0_PD_SITE0_UNIT1</name>
              <description>needs field desc</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DELAY_OVF_VT0_PD_SITE0_UNIT1</name>
              <description>needs field desc</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TIMING_ERR_CNT_O_VT0_PD_SITE0_UNIT1</name>
              <description>needs field desc</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>COMB_PD_SITE0_UNIT2_VT0_CONF2</name>
          <description>needs desc</description>
          <addressOffset>0x130</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>MONITOR_EDG_MOD_VT0_PD_SITE0_UNIT2</name>
              <description>needs field desc</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DELAY_OVF_VT0_PD_SITE0_UNIT2</name>
              <description>needs field desc</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TIMING_ERR_CNT_O_VT0_PD_SITE0_UNIT2</name>
              <description>needs field desc</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>COMB_PD_SITE0_UNIT3_VT0_CONF2</name>
          <description>needs desc</description>
          <addressOffset>0x134</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>MONITOR_EDG_MOD_VT0_PD_SITE0_UNIT3</name>
              <description>needs field desc</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DELAY_OVF_VT0_PD_SITE0_UNIT3</name>
              <description>needs field desc</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TIMING_ERR_CNT_O_VT0_PD_SITE0_UNIT3</name>
              <description>needs field desc</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>COMB_PD_SITE0_UNIT0_VT1_CONF2</name>
          <description>needs desc</description>
          <addressOffset>0x138</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>MONITOR_EDG_MOD_VT1_PD_SITE0_UNIT0</name>
              <description>needs field desc</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DELAY_OVF_VT1_PD_SITE0_UNIT0</name>
              <description>needs field desc</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TIMING_ERR_CNT_O_VT1_PD_SITE0_UNIT0</name>
              <description>needs field desc</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>COMB_PD_SITE0_UNIT1_VT1_CONF2</name>
          <description>needs desc</description>
          <addressOffset>0x13C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>MONITOR_EDG_MOD_VT1_PD_SITE0_UNIT1</name>
              <description>needs field desc</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DELAY_OVF_VT1_PD_SITE0_UNIT1</name>
              <description>needs field desc</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TIMING_ERR_CNT_O_VT1_PD_SITE0_UNIT1</name>
              <description>needs field desc</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>COMB_PD_SITE0_UNIT2_VT1_CONF2</name>
          <description>needs desc</description>
          <addressOffset>0x140</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>MONITOR_EDG_MOD_VT1_PD_SITE0_UNIT2</name>
              <description>needs field desc</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DELAY_OVF_VT1_PD_SITE0_UNIT2</name>
              <description>needs field desc</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TIMING_ERR_CNT_O_VT1_PD_SITE0_UNIT2</name>
              <description>needs field desc</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>COMB_PD_SITE0_UNIT3_VT1_CONF2</name>
          <description>needs desc</description>
          <addressOffset>0x144</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>MONITOR_EDG_MOD_VT1_PD_SITE0_UNIT3</name>
              <description>needs field desc</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DELAY_OVF_VT1_PD_SITE0_UNIT3</name>
              <description>needs field desc</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TIMING_ERR_CNT_O_VT1_PD_SITE0_UNIT3</name>
              <description>needs field desc</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>COMB_PD_SITE0_UNIT0_VT2_CONF2</name>
          <description>needs desc</description>
          <addressOffset>0x148</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>MONITOR_EDG_MOD_VT2_PD_SITE0_UNIT0</name>
              <description>needs field desc</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DELAY_OVF_VT2_PD_SITE0_UNIT0</name>
              <description>needs field desc</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TIMING_ERR_CNT_O_VT2_PD_SITE0_UNIT0</name>
              <description>needs field desc</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>COMB_PD_SITE0_UNIT1_VT2_CONF2</name>
          <description>needs desc</description>
          <addressOffset>0x14C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>MONITOR_EDG_MOD_VT2_PD_SITE0_UNIT1</name>
              <description>needs field desc</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DELAY_OVF_VT2_PD_SITE0_UNIT1</name>
              <description>needs field desc</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TIMING_ERR_CNT_O_VT2_PD_SITE0_UNIT1</name>
              <description>needs field desc</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>COMB_PD_SITE0_UNIT2_VT2_CONF2</name>
          <description>needs desc</description>
          <addressOffset>0x150</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>MONITOR_EDG_MOD_VT2_PD_SITE0_UNIT2</name>
              <description>needs field desc</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DELAY_OVF_VT2_PD_SITE0_UNIT2</name>
              <description>needs field desc</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TIMING_ERR_CNT_O_VT2_PD_SITE0_UNIT2</name>
              <description>needs field desc</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>COMB_PD_SITE0_UNIT3_VT2_CONF2</name>
          <description>needs desc</description>
          <addressOffset>0x154</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>MONITOR_EDG_MOD_VT2_PD_SITE0_UNIT3</name>
              <description>needs field desc</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DELAY_OVF_VT2_PD_SITE0_UNIT3</name>
              <description>needs field desc</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TIMING_ERR_CNT_O_VT2_PD_SITE0_UNIT3</name>
              <description>needs field desc</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>COMB_PD_SITE1_UNIT0_VT0_CONF2</name>
          <description>needs desc</description>
          <addressOffset>0x158</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>MONITOR_EDG_MOD_VT0_PD_SITE1_UNIT0</name>
              <description>needs field desc</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DELAY_OVF_VT0_PD_SITE1_UNIT0</name>
              <description>needs field desc</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TIMING_ERR_CNT_O_VT0_PD_SITE1_UNIT0</name>
              <description>needs field desc</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>COMB_PD_SITE1_UNIT1_VT0_CONF2</name>
          <description>needs desc</description>
          <addressOffset>0x15C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>MONITOR_EDG_MOD_VT0_PD_SITE1_UNIT1</name>
              <description>needs field desc</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DELAY_OVF_VT0_PD_SITE1_UNIT1</name>
              <description>needs field desc</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TIMING_ERR_CNT_O_VT0_PD_SITE1_UNIT1</name>
              <description>needs field desc</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>COMB_PD_SITE1_UNIT2_VT0_CONF2</name>
          <description>needs desc</description>
          <addressOffset>0x160</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>MONITOR_EDG_MOD_VT0_PD_SITE1_UNIT2</name>
              <description>needs field desc</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DELAY_OVF_VT0_PD_SITE1_UNIT2</name>
              <description>needs field desc</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TIMING_ERR_CNT_O_VT0_PD_SITE1_UNIT2</name>
              <description>needs field desc</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>COMB_PD_SITE1_UNIT3_VT0_CONF2</name>
          <description>needs desc</description>
          <addressOffset>0x164</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>MONITOR_EDG_MOD_VT0_PD_SITE1_UNIT3</name>
              <description>needs field desc</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DELAY_OVF_VT0_PD_SITE1_UNIT3</name>
              <description>needs field desc</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TIMING_ERR_CNT_O_VT0_PD_SITE1_UNIT3</name>
              <description>needs field desc</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>COMB_PD_SITE1_UNIT0_VT1_CONF2</name>
          <description>needs desc</description>
          <addressOffset>0x168</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>MONITOR_EDG_MOD_VT1_PD_SITE1_UNIT0</name>
              <description>needs field desc</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DELAY_OVF_VT1_PD_SITE1_UNIT0</name>
              <description>needs field desc</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TIMING_ERR_CNT_O_VT1_PD_SITE1_UNIT0</name>
              <description>needs field desc</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
