espressif/esp-bist/src/soc/esp32c5/esp32c5.svd
        <register>
          <name>COMB_PD_SITE3_UNIT3_VT0_CONF2</name>
          <description>needs desc</description>
          <addressOffset>0x1C4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>MONITOR_EDG_MOD_VT0_PD_SITE3_UNIT3</name>
              <description>needs field desc</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DELAY_OVF_VT0_PD_SITE3_UNIT3</name>
              <description>needs field desc</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TIMING_ERR_CNT_O_VT0_PD_SITE3_UNIT3</name>
              <description>needs field desc</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>COMB_PD_SITE3_UNIT0_VT1_CONF2</name>
          <description>needs desc</description>
          <addressOffset>0x1C8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>MONITOR_EDG_MOD_VT1_PD_SITE3_UNIT0</name>
              <description>needs field desc</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DELAY_OVF_VT1_PD_SITE3_UNIT0</name>
              <description>needs field desc</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TIMING_ERR_CNT_O_VT1_PD_SITE3_UNIT0</name>
              <description>needs field desc</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>COMB_PD_SITE3_UNIT1_VT1_CONF2</name>
          <description>needs desc</description>
          <addressOffset>0x1CC</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>MONITOR_EDG_MOD_VT1_PD_SITE3_UNIT1</name>
              <description>needs field desc</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DELAY_OVF_VT1_PD_SITE3_UNIT1</name>
              <description>needs field desc</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TIMING_ERR_CNT_O_VT1_PD_SITE3_UNIT1</name>
              <description>needs field desc</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>COMB_PD_SITE3_UNIT2_VT1_CONF2</name>
          <description>needs desc</description>
          <addressOffset>0x1D0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>MONITOR_EDG_MOD_VT1_PD_SITE3_UNIT2</name>
              <description>needs field desc</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DELAY_OVF_VT1_PD_SITE3_UNIT2</name>
              <description>needs field desc</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TIMING_ERR_CNT_O_VT1_PD_SITE3_UNIT2</name>
              <description>needs field desc</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>COMB_PD_SITE3_UNIT3_VT1_CONF2</name>
          <description>needs desc</description>
          <addressOffset>0x1D4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>MONITOR_EDG_MOD_VT1_PD_SITE3_UNIT3</name>
              <description>needs field desc</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DELAY_OVF_VT1_PD_SITE3_UNIT3</name>
              <description>needs field desc</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TIMING_ERR_CNT_O_VT1_PD_SITE3_UNIT3</name>
              <description>needs field desc</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>COMB_PD_SITE3_UNIT0_VT2_CONF2</name>
          <description>needs desc</description>
          <addressOffset>0x1D8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>MONITOR_EDG_MOD_VT2_PD_SITE3_UNIT0</name>
              <description>needs field desc</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DELAY_OVF_VT2_PD_SITE3_UNIT0</name>
              <description>needs field desc</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TIMING_ERR_CNT_O_VT2_PD_SITE3_UNIT0</name>
              <description>needs field desc</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>COMB_PD_SITE3_UNIT1_VT2_CONF2</name>
          <description>needs desc</description>
          <addressOffset>0x1DC</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>MONITOR_EDG_MOD_VT2_PD_SITE3_UNIT1</name>
              <description>needs field desc</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DELAY_OVF_VT2_PD_SITE3_UNIT1</name>
              <description>needs field desc</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TIMING_ERR_CNT_O_VT2_PD_SITE3_UNIT1</name>
              <description>needs field desc</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>COMB_PD_SITE3_UNIT2_VT2_CONF2</name>
          <description>needs desc</description>
          <addressOffset>0x1E0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>MONITOR_EDG_MOD_VT2_PD_SITE3_UNIT2</name>
              <description>needs field desc</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DELAY_OVF_VT2_PD_SITE3_UNIT2</name>
              <description>needs field desc</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TIMING_ERR_CNT_O_VT2_PD_SITE3_UNIT2</name>
              <description>needs field desc</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>COMB_PD_SITE3_UNIT3_VT2_CONF2</name>
          <description>needs desc</description>
          <addressOffset>0x1E4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>MONITOR_EDG_MOD_VT2_PD_SITE3_UNIT3</name>
              <description>needs field desc</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DELAY_OVF_VT2_PD_SITE3_UNIT3</name>
              <description>needs field desc</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TIMING_ERR_CNT_O_VT2_PD_SITE3_UNIT3</name>
              <description>needs field desc</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>VALUE_UPDATE</name>
          <description>needs field desc</description>
          <addressOffset>0x1E8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>VALUE_UPDATE</name>
              <description>needs field desc</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>BYPASS</name>
              <description>needs field desc</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BYPASS_CHAIN</name>
          <description>needs field desc</description>
          <addressOffset>0x1EC</addressOffset>
          <size>0x20</size>
          <resetValue>0xFFFFFFFF</resetValue>
          <fields>
            <field>
              <name>CLK_CHAIN_EN</name>
              <description>needs field desc</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register derivedFrom="AES.DATE">
          <name>DATE</name>
          <description>version register</description>
          <addressOffset>0xFFC</addressOffset>
        </register>
