espressif/esp-bist/src/soc/esp32c5/esp32c5.svd
        <register>
          <name>SYS_CONF</name>
          <description>RMT apb configuration register</description>
          <addressOffset>0x68</addressOffset>
          <size>0x20</size>
          <resetValue>0x05000010</resetValue>
          <fields>
            <field>
              <name>APB_FIFO_MASK</name>
              <description>1'h1: access memory directly.   1'h0: access memory by FIFO.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MEM_CLK_FORCE_ON</name>
              <description>Set this bit to enable the clock for RMT memory.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MEM_FORCE_PD</name>
              <description>Set this bit to power down RMT memory.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MEM_FORCE_PU</name>
              <description>1: Disable RMT memory light sleep power down function. 0: Power down RMT memory when RMT is in light sleep mode.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CLK_EN</name>
              <description>RMT register clock gate enable signal. 1: Power up the drive clock of registers. 0: Power down the drive clock of registers</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TX_SIM</name>
          <description>RMT TX synchronous register</description>
          <addressOffset>0x6C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CH0</name>
              <description>Set this bit to enable CHANNEL0 to start sending data synchronously with other enabled channels.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH1</name>
              <description>Set this bit to enable CHANNEL1 to start sending data synchronously with other enabled channels.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EN</name>
              <description>This register is used to enable multiple of channels to start sending data synchronously.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REF_CNT_RST</name>
          <description>RMT clock divider reset register</description>
          <addressOffset>0x70</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>TX_REF_CNT_RST</name>
              <description>This register is used to reset the clock divider of CHANNEL0.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>TX_REF_CNT_RST_CH1</name>
              <description>This register is used to reset the clock divider of CHANNEL1.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>RX_REF_CNT_RST_CH2</name>
              <description>This register is used to reset the clock divider of CHANNEL2.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>RX_REF_CNT_RST_CH3</name>
              <description>This register is used to reset the clock divider of CHANNEL3.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register derivedFrom="AES.DATE">
          <name>DATE</name>
          <description>RMT version register</description>
          <addressOffset>0xCC</addressOffset>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>RSA</name>
      <description>RSA (Rivest Shamir Adleman) Accelerator</description>
      <groupName>RSA</groupName>
      <baseAddress>0x6008A000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x74</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>RSA</name>
        <value>80</value>
      </interrupt>
      <registers>
        <register>
          <dim>96</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>M_MEM[%s]</name>
          <description>Represents M</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <dim>96</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>Z_MEM[%s]</name>
          <description>Represents Z</description>
          <addressOffset>0x200</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <dim>96</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>Y_MEM[%s]</name>
          <description>Represents Y</description>
          <addressOffset>0x400</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <dim>96</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>X_MEM[%s]</name>
          <description>Represents X</description>
          <addressOffset>0x600</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>M_PRIME</name>
          <description>Represents M'</description>
          <addressOffset>0x800</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>M_PRIME</name>
              <description>Represents M'</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MODE</name>
          <description>Configures RSA length</description>
          <addressOffset>0x804</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>MODE</name>
              <description>Configures the RSA length.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>QUERY_CLEAN</name>
          <description>RSA initialization status</description>
          <addressOffset>0x808</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>QUERY_CLEAN</name>
              <description>Represents whether or not the RSA memory completes initialization.\\
0: Not complete\\
1: Completed\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SET_START_MODEXP</name>
          <description>Starts modular exponentiation</description>
          <addressOffset>0x80C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SET_START_MODEXP</name>
              <description>Configures whether or not to starts the modular exponentiation. \\
0: No effect\\
1: Start\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SET_START_MODMULT</name>
          <description>Starts modular multiplication</description>
          <addressOffset>0x810</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SET_START_MODMULT</name>
              <description>Configures whether or not to start the modular multiplication.\\
0: No effect\\
1: Start\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SET_START_MULT</name>
          <description>Starts multiplication</description>
          <addressOffset>0x814</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SET_START_MULT</name>
              <description>Configures whether or not to start the multiplication.\\
0: No effect\\
1: Start\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>QUERY_IDLE</name>
          <description>Represents the RSA status</description>
          <addressOffset>0x818</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>QUERY_IDLE</name>
              <description>Represents the RSA status.\\
0: Busy\\
1: Idle\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_CLR</name>
          <description>Clears RSA interrupt</description>
          <addressOffset>0x81C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>INT_CLR</name>
              <description>Write 1 to clear the RSA interrupt.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CONSTANT_TIME</name>
          <description>Configures the constant_time option</description>
          <addressOffset>0x820</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>CONSTANT_TIME</name>
              <description>Configures the constant_time option. \\
0: Acceleration\\
1: No acceleration (default)\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEARCH_ENABLE</name>
          <description>Configures the search option</description>
          <addressOffset>0x824</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SEARCH_ENABLE</name>
              <description>Configures the search option. \\
0: No acceleration (default)\\
1: Acceleration\\
This option should be used together with RSA_SEARCH_POS_REG.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEARCH_POS</name>
          <description>Configures the search position</description>
          <addressOffset>0x828</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SEARCH_POS</name>
              <description>Configures the starting address to start search. This field should be used together with RSA_SEARCH_ENABLE_REG. The field is only valid when RSA_SEARCH_ENABLE is high.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_ENA</name>
          <description>Enables the RSA interrupt</description>
          <addressOffset>0x82C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>INT_ENA</name>
              <description>Write 1 to enable the RSA interrupt.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register derivedFrom="AES.DATE">
          <name>DATE</name>
          <description>Version control register</description>
          <addressOffset>0x830</addressOffset>
        </register>
