espressif/esp-bist/src/soc/esp32c5/esp32c5.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>TEE</name>
      <description>TEE Peripheral</description>
      <groupName>TEE</groupName>
      <baseAddress>0x60098000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x88</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <dim>32</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>M%s_MODE_CTRL</name>
          <description>TEE mode control register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>MODE</name>
              <description>Configures M%s security level mode.\\
0: tee_mode \\
1: ree_mode0 \\
2: ree_mode1 \\
3: ree_mode2  \\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <name>SecurityMode</name>
                <enumeratedValue>
                  <name>Tee</name>
                  <description>Tee mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Ree0</name>
                  <description>Ree0 mode</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Ree1</name>
                  <description>Ree1 mode</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Ree2</name>
                  <description>Ree2 mode</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LOCK</name>
              <description>Set 1 to lock m0 tee configuration</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CLOCK_GATE</name>
          <description>Clock gating register</description>
          <addressOffset>0x80</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>CLK_EN</name>
              <description>Configures whether to keep the clock always on.\\
0: enable automatic clock gating \\
1: keep the clock always on  \\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register derivedFrom="AES.DATE">
          <name>DATE</name>
          <description>Version control register</description>
          <addressOffset>0xFFC</addressOffset>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>TIMG0</name>
      <description>Timer Group 0</description>
      <groupName>TIMG</groupName>
      <baseAddress>0x60008000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x8C</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>TG0_T0_LEVEL</name>
        <value>57</value>
      </interrupt>
      <interrupt>
        <name>TG0_WDT_LEVEL</name>
        <value>58</value>
      </interrupt>
      <registers>
        <cluster>
          <dim>2</dim>
          <dimIncrement>0x24</dimIncrement>
          <dimIndex>0-1</dimIndex>
          <name>T%s</name>
          <description>Cluster T%s, containing T?CONFIG, T?LO, T?HI, T?UPDATE, T?ALARMLO, T?ALARMHI, T?LOADLO, T?LOADHI, T?LOAD</description>
          <addressOffset>0x0</addressOffset>
          <register>
            <name>CONFIG</name>
            <description>Timer 0 configuration register</description>
            <addressOffset>0x0</addressOffset>
            <size>0x20</size>
            <resetValue>0x60002000</resetValue>
            <fields>
              <field>
                <name>USE_XTAL</name>
                <description>1: Use XTAL_CLK as the source clock of timer group. 0: Use APB_CLK as the source clock of timer group.</description>
                <bitOffset>9</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>ALARM_EN</name>
                <description>Configures whether or not to enable the timer 0 alarm function. This bit will be automatically cleared once an alarm occurs.\\
0: Disable \\
1: Enable  \\</description>
                <bitOffset>10</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DIVCNT_RST</name>
                <description>Configures whether or not to reset the timer 0 's clock divider counter. \\
0: No effect \\
1: Reset \\</description>
                <bitOffset>12</bitOffset>
                <bitWidth>1</bitWidth>
                <access>write-only</access>
              </field>
              <field>
                <name>DIVIDER</name>
                <description>Represents the timer 0 clock (T0_clk) prescaler value.</description>
                <bitOffset>13</bitOffset>
                <bitWidth>16</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>AUTORELOAD</name>
                <description>Configures whether or not to enable the timer 0 auto-reload function at the time of alarm. \\
0: No effect \\
1: Enable \\</description>
                <bitOffset>29</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>INCREASE</name>
                <description>Configures the counting direction of the timer 0 time-base counter. \\
0: Decrement \\
1: Increment \\</description>
                <bitOffset>30</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>EN</name>
                <description>Configures whether or not to enable the timer 0 time-base counter. \\
0: Disable \\
1: Enable \\</description>
                <bitOffset>31</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>LO</name>
            <description>Timer 0 current value, low 32 bits</description>
            <addressOffset>0x4</addressOffset>
            <size>0x20</size>
            <fields>
              <field>
                <name>LO</name>
                <description>Represents the low 32 bits of the time-base counter of timer 0. Valid only after writing to TIMG_T0UPDATE_REG. \\
Measurement unit: T0_clk \\</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>HI</name>
            <description>Timer 0 current value, high 22 bits</description>
            <addressOffset>0x8</addressOffset>
            <size>0x20</size>
            <fields>
              <field>
                <name>HI</name>
                <description>Represents the high 22 bits of the time-base counter of timer 0. Valid only after writing to TIMG_T0UPDATE_REG. \\
Measurement unit: T0_clk \\</description>
                <bitOffset>0</bitOffset>
                <bitWidth>22</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>UPDATE</name>
            <description>Write to copy current timer value to TIMGn_T0LO_REG or TIMGn_T0HI_REG</description>
            <addressOffset>0xC</addressOffset>
            <size>0x20</size>
            <fields>
              <field>
                <name>UPDATE</name>
                <description>Configures to latch the counter value. \\
0: Latch \\
1: Latch \\</description>
                <bitOffset>31</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>ALARMLO</name>
            <description>Timer 0 alarm value, low 32 bits</description>
            <addressOffset>0x10</addressOffset>
            <size>0x20</size>
            <fields>
              <field>
                <name>ALARM_LO</name>
                <description>Configures the low 32 bits of timer 0 alarm trigger time-base counter value. Valid only when TIMG_T0_ALARM_EN is 1. \\
Measurement unit: T0_clk \\</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>ALARMHI</name>
            <description>Timer 0 alarm value, high bits</description>
            <addressOffset>0x14</addressOffset>
            <size>0x20</size>
            <fields>
              <field>
                <name>ALARM_HI</name>
                <description>Configures the high 22 bits of timer 0 alarm trigger time-base counter value. Valid only when TIMG_T0_ALARM_EN is 1. \\
Measurement unit: T0_clk \\</description>
                <bitOffset>0</bitOffset>
                <bitWidth>22</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>LOADLO</name>
            <description>Timer 0 reload value, low 32 bits</description>
            <addressOffset>0x18</addressOffset>
            <size>0x20</size>
            <fields>
              <field>
                <name>LOAD_LO</name>
                <description>Configures low 32 bits of the value that a reload will load onto timer 0 time-base counter. \\
Measurement unit: T0_clk \\</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>LOADHI</name>
            <description>Timer 0 reload value, high 22 bits</description>
            <addressOffset>0x1C</addressOffset>
            <size>0x20</size>
            <fields>
              <field>
                <name>LOAD_HI</name>
                <description>Configures high 22 bits of the value that a reload will load onto timer 0 time-base counter. \\
Measurement unit: T0_clk \\</description>
                <bitOffset>0</bitOffset>
                <bitWidth>22</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>LOAD</name>
            <description>Write to reload timer from TIMG_T0LOADLO_REG or TIMG_T0LOADHI_REG</description>
            <addressOffset>0x20</addressOffset>
            <size>0x20</size>
            <fields>
              <field>
                <name>LOAD</name>
                <description>Write any value to trigger a timer 0 time-base counter reload.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>write-only</access>
              </field>
            </fields>
          </register>
        </cluster>
        <register>
          <name>WDTCONFIG0</name>
          <description>Watchdog timer configuration register</description>
          <addressOffset>0x48</addressOffset>
          <size>0x20</size>
          <resetValue>0x0004C000</resetValue>
          <fields>
            <field>
              <name>WDT_APPCPU_RESET_EN</name>
              <description>Configures whether to mask the CPU reset generated by MWDT. Valid only when write protection is disabled. \\
0: Mask \\
1: Unmask \\</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WDT_PROCPU_RESET_EN</name>
              <description>Configures whether to mask the CPU reset generated by MWDT. Valid only when write protection is disabled. \\
0: Mask \\
1: Unmask \\</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WDT_FLASHBOOT_MOD_EN</name>
              <description>Configures whether to enable flash boot protection.\\
0: Disable \\
1: Enable \\</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WDT_SYS_RESET_LENGTH</name>
              <description>Configures the system reset signal length. Valid only when write protection is disabled. \\
Measurement unit: mwdt_clk
\begin{multicols}{2}
0: 8 \\
1: 16 \\
2: 24 \\
3: 32 \\
4: 40 \\
5: 64 \\
6: 128 \\
7: 256 \\
\end{multicols}</description>
              <bitOffset>15</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WDT_CPU_RESET_LENGTH</name>
              <description>Configures the CPU reset signal length. Valid only when write protection is disabled.\\
Measurement unit: mwdt_clk \\
\begin{multicols}{2}
0: 8 \\
1: 16 \\
2: 24 \\
3: 32 \\
4: 40 \\
5: 64 \\
6: 128 \\
7: 256 \\
\end{multicols}</description>
              <bitOffset>18</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WDT_USE_XTAL</name>
              <description>choose WDT clock:0-apb_clk, 1-xtal_clk.</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WDT_CONF_UPDATE_EN</name>
              <description>Configures to update the WDT configuration registers.\\
0: No effect \\
1: Update \\</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>WDT_STG3</name>
              <description>Configures the timeout action of stage 3. See details in TIMG_WDT_STG0. Valid only when write protection is disabled.</description>
              <bitOffset>23</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WDT_STG2</name>
              <description>Configures the  timeout action of stage 2. See details in TIMG_WDT_STG0. Valid only when write protection is disabled.</description>
              <bitOffset>25</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WDT_STG1</name>
              <description>Configures the  timeout action of stage 1. See details in TIMG_WDT_STG0. Valid only when write protection is disabled.</description>
              <bitOffset>27</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WDT_STG0</name>
              <description>Configures the timeout action of stage 0. Valid only when write protection is disabled. \\
0: No effect \\
1: Interrupt \\
2: Reset CPU \\
3: Reset system \\</description>
              <bitOffset>29</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WDT_EN</name>
              <description>Configures whether or not to enable the MWDT. Valid only when write protection is disabled. \\
0: Disable \\
1: Enable \\</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>WDTCONFIG1</name>
          <description>Watchdog timer prescaler register</description>
          <addressOffset>0x4C</addressOffset>
          <size>0x20</size>
          <resetValue>0x00010000</resetValue>
          <fields>
            <field>
              <name>WDT_DIVCNT_RST</name>
              <description>Configures whether to reset WDT 's clock divider counter. \\
0: No effect \\
1: Reset \\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>WDT_CLK_PRESCALE</name>
              <description>Configures MWDT clock prescaler value. Valid only when write protection is disabled. \\
MWDT clock period = MWDT's clock source period * TIMG_WDT_CLK_PRESCALE. \\</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>4</dim>
          <dimIncrement>0x4</dimIncrement>
          <dimIndex>2-5</dimIndex>
          <name>WDTCONFIG%s</name>
          <description>Watchdog timer stage timeout value</description>
          <addressOffset>0x50</addressOffset>
          <size>0x20</size>
          <resetValue>0x018CBA80</resetValue>
          <fields>
            <field>
              <name>HOLD</name>
              <description>Configures the stage 0 timeout value. Valid only when write protection is disabled. \\
Measurement unit: mwdt_clk \\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>WDTFEED</name>
          <description>Write to feed the watchdog timer</description>
          <addressOffset>0x60</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>WDT_FEED</name>
              <description>Write any value to feed the MWDT. Valid only when write protection is disabled.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>WDTWPROTECT</name>
          <description>Watchdog write protect register</description>
          <addressOffset>0x64</addressOffset>
          <size>0x20</size>
          <resetValue>0x50D83AA1</resetValue>
          <fields>
            <field>
              <name>WDT_WKEY</name>
              <description>Configures a different value than its reset value to enable write protection.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RTCCALICFG</name>
          <description>RTC frequency calculation configuration register 0</description>
          <addressOffset>0x68</addressOffset>
          <size>0x20</size>
          <resetValue>0x00011000</resetValue>
          <fields>
            <field>
              <name>RTC_CALI_START_CYCLING</name>
              <description>Configures the frequency calculation mode.  \\
0: one-shot frequency calculation \\
1: periodic frequency calculation \\</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RTC_CALI_CLK_SEL</name>
              <description>Configures to select the clock to be calibrated\\
0: RTC_SLOW_CLK\\
1: RC_FAST_DIV_CLK\\
2: XTAL32K_CLK\\</description>
              <bitOffset>13</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RTC_CALI_RDY</name>
              <description>Represents whether one-shot frequency calculation is done.\\
0: Not done \\
1: Done \\</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RTC_CALI_MAX</name>
              <description>Configures the time to calculate RTC slow clock's frequency. \\
Measurement unit: XTAL_CLK \\</description>
              <bitOffset>16</bitOffset>
              <bitWidth>15</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RTC_CALI_START</name>
              <description>Configures whether to enable one-shot frequency calculation. \\
0: Disable \\
1: Enable \\</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RTCCALICFG1</name>
          <description>RTC frequency calculation configuration register 1</description>
          <addressOffset>0x6C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>RTC_CALI_CYCLING_DATA_VLD</name>
              <description>Represents whether periodic frequency calculation is done. \\
0: Not done \\
1: Done \\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RTC_CALI_VALUE</name>
              <description>Represents the value countered by XTAL_CLK when one-shot or periodic frequency calculation is done. It is used to calculate RTC slow clock's frequency.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>25</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_ENA</name>
          <description>Interrupt enable bits</description>
          <addressOffset>0x70</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <dim>2</dim>
              <dimIncrement>0x1</dimIncrement>
              <dimIndex>0-1</dimIndex>
              <name>T%s</name>
              <description>Write 1 to enable the TIMG_T%s_INT interrupt.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WDT</name>
              <description>Write 1 to enable the TIMG_WDT_INT interrupt.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
