espressif/esp-bist/src/soc/esp32c5/esp32c5.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>TWAI0</name>
      <description>Two-Wire Automotive Interface</description>
      <groupName>TWAIFD</groupName>
      <baseAddress>0x6000B000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0xC8</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>TWAI0</name>
        <value>50</value>
      </interrupt>
      <interrupt>
        <name>TWAI0_TIMER</name>
        <value>51</value>
      </interrupt>
      <registers>
        <register>
          <name>DEVICE_ID_VERSION</name>
          <description>TWAI FD device id status register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <resetValue>0x0204CAFD</resetValue>
          <fields>
            <field>
              <name>DEVICE_ID</name>
              <description>Represents whether CAN IP function is mapped correctly on its base address.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>VER_MINOR</name>
              <description>TWAI FD IP version</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>VER_MAJOR</name>
              <description>TWAI FD IP version</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MODE_SETTINGS</name>
          <description>TWAI FD mode setting register</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <resetValue>0x02000210</resetValue>
          <fields>
            <field>
              <name>RST</name>
              <description>Soft reset. Writing logic 1 resets CTU CAN FD. After writing logic 1, logic 0 does not need to be written, this bit
is automatically cleared.
0: invalid
1: reset.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>BMM</name>
              <description>Bus monitoring mode. In this mode CTU CAN FD only receives frames and sends only recessive bits on CAN
bus. When a dominant bit is sent, it is re-routed internally so that bus value is not changed. When this mode is
enabled, CTU CAN FD will not transmit any frame from TXT Buffers,
0b0 - BMM_DISABLED - Bus monitoring mode disabled.
0b1 - BMM_ENABLED - Bus monitoring mode enabled.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STM</name>
              <description>Self Test Mode. In this mode transmitted frame is considered valid even if dominant acknowledge was not received.
0b0 - STM_DISABLED - Self test mode disabled.
0b1 - STM_ENABLED - Self test mode enabled.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AFM</name>
              <description>Acceptance Filters Mode. If enabled, only RX frames which pass Frame filters are stored in RX buffer. If disabled,
every received frame is stored to RX buffer. This bit has meaning only if there is at least one filter available.
Otherwise, this bit is reserved.
0b0 - AFM_DISABLED - Acceptance filter mode disabled
0b1 - AFM_ENABLED - Acceptance filter mode enabled</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FDE</name>
              <description>Flexible data rate enable. When flexible data rate is enabled CTU CAN FD recognizes CAN FD frames (FDF bit
= 1).
0b0 - FDE_DISABLE - Flexible data-rate support disabled.
0b1 - FDE_ENABLE - Flexible data-rate support enabled.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TTTM</name>
              <description>Time triggered transmission mode.
0b0 - TTTM_DISABLED -
0b1 - TTTM_ENABLED -</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ROM</name>
              <description>Restricted operation mode.
0b0 - ROM_DISABLED - Restricted operation mode is disabled.
0b1 - ROM_ENABLED - Restricted operation mode is enabled.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ACF</name>
              <description>Acknowledge Forbidden Mode. When enabled, acknowledge is not sent even if received CRC matches the calculated
one.
0b0 - ACF_DISABLED - Acknowledge forbidden mode disabled.
0b1 - ACF_ENABLED - Acknowledge forbidden mode enabled.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TSTM</name>
              <description>Test Mode. In test mode several registers have special features. Reffer to description of Test mode for further
Details.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RXBAM</name>
              <description>RX Buffer automatic mode.
0b0 - RXBAM_DISABLED -
0b1 - RXBAM_ENABLED -</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TXBBM</name>
              <description>TXT Buffer Backup mode\\
0b0 - TXBBM_DISABLED - TXT Buffer Backup mode disabled\\
0b1 - TXBBM_ENABLED - TXT Buffer Backup mode enabled\\</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SAM</name>
              <description>Self-acknowledge mode.\\
0b0 - SAM_DISABLE - Do not send dominant ACK bit when CTU CAN FD sends Acknowledge bit.\\
0b1 - SAM_ENABLE - Send dominant ACK bit when CTU CAN FD transmits CAN frame.\\</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RTRLE</name>
              <description>Retransmitt Limit Enable. If enabled, CTU CAN FD only attempts to retransmitt each frame up to RTR_TH
times.
0b0 - RTRLE_DISABLED - Retransmitt limit is disabled.
0b1 - RTRLE_ENABLED - Retransmitt limit is enabled.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RTRTH</name>
              <description>Retransmitt Limit Threshold. Maximal amount of retransmission attempts when SETTINGS[RTRLE] is en-
Abled.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ILBP</name>
              <description>Internal Loop Back mode. When enabled, CTU CAN FD receives any frame it transmitts.
0b0 - INT_LOOP_DISABLED - Internal loop-back is disabled.
0b1 - INT_LOOP_ENABLED - Internal loop-back is enabled.</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ENA</name>
              <description>Main enable bit of CTU CAN FD. When enabled, CTU CAN FD communicates on CAN bus. When disabled, it
is bus-off and does not take part of CAN bus communication.
0b0 - CTU_CAN_DISABLED - The CAN Core is disabled.
0b1 - CTU_CAN_ENABLED - The CAN Core is enabled.</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NISOFD</name>
              <description>Non ISO FD. When this bit is set, CTU CAN FD is compliant to NON-ISO CAN FD specification (no stuff
count field). This bit should be modified only when SETTINGS[ENA]=0.
0b0 - ISO_FD - The CAN Controller conforms to ISO CAN FD specification.
0b1 - NON_ISO_FD - The CAN Controller conforms to NON ISO CAN FD specification. CANFD 1.0</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PEX</name>
              <description>Protocol exception handling. When this bit is set, CTU CAN FD will start integration upon detection of protocol
exception. This should be modified only when SETTINGS[ENA] = ’0’.
0b0 - PROTOCOL_EXCEPTION_DISABLED - Protocol exception handling is disabled.
0b1 - PROTOCOL_EXCEPTION_ENABLED - Protocol exception handling is enabled.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TBFBO</name>
              <description>All TXT buffers shall go to "TX failed" state when CTU CAN FD becomes bus-off.
0b0 - TXTBUF_FAILED_BUS_OFF_DISABLED - TXT Buffers dont go to "TX failed" state when CTU CAN
FD becomes bus-off.
0b1 - TXTBUF_FAILED_BUS_OFF_ENABLED - TXT Buffers go to "TX failed" state when CTU CAN FD
becomes bus-off.</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FDRF</name>
              <description>Frame filters drop Remote frames.
0b0 - DROP_RF_DISABLED - Frame filters accept RTR frames.
0b1 - DROP_RF_ENABLED - Frame filters drop RTR frames.</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PCHKE</name>
              <description>Enable Parity checks in TXT Buffers and RX Buffer.</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STATUS</name>
          <description>TWAI FD status register</description>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <resetValue>0x00070084</resetValue>
          <fields>
            <field>
              <name>RXNE</name>
              <description>RX buffer not empty. This bit is 1 when least one frame is stored in RX buffer.
0: empty
1: not empty</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DOR</name>
              <description>Data Overrun flag. This bit is set when frame was dropped due to lack of space in RX buffer. This bit can be
cleared by COMMAND[RRB].
0: not overrun
1: overrun</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TXNF</name>
              <description>TXT buffers status. This bit is set if at least one TXT buffer is in "Empty" state.
0: not full
1: full</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>EFT</name>
              <description>Error frame is being transmitted at the moment.
0: not being transmitted
1: being transmitted</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RXS</name>
              <description>CTU CAN FD is receiver of CAN Frame.
0: not receiving
1: receiving</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TXS</name>
              <description>CTU CAN FD is transmitter of CAN Frame.
0: not transmitting
1: transmitting</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>EWL</name>
              <description>TX Error counter (TEC) or RX Error counter (REC) is equal to, or higher than Error warning limit (EWL).
0: not reached
1: reached</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>IDLE</name>
              <description>Bus is idle (no frame is being transmitted/received) or CTU CAN FD is bus-off.
0: active
1: not active</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PEXS</name>
              <description>Protocol exception status (flag). Set when Protocol exception occurs. Cleared by writing COMMAND[CPEXS]=1.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RXPE</name>
              <description>Set when parity error is detected during read of CAN frame from RX Buffer via RX_DATA register.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TXPE</name>
              <description>TXT Buffers Parity Error flag. Set When Parity Error is detected in a TXT Buffer during transmission from this
Buffer.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TXDPE</name>
              <description>TXT Buffer double parity error. Set in TXT Buffer Backup mode when parity error is detected in "backup"
TXT Buffer.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>STCNT</name>
              <description>Support of Traffic counters. When this bit is 1, Traffic counters are present.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>STRGS</name>
              <description>Support of Test Registers for memory testability. When this bit is 1, Test Registers are present.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SPRT</name>
              <description>Support of Parity protection on each word of TXT Buffer RAM and RX Buffer RAM.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>COMMAND</name>
          <description>TWAI FD command register</description>
          <addressOffset>0xC</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>RXRPMV</name>
              <description>RX Buffer read pointer move.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>RRB</name>
              <description>Release RX Buffer. This command flushes RX buffer and resets its memory pointers.
0: invalid
1: delete</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CDO</name>
              <description>Clear Data Overrun flag in RX buffer.
0: invalid
1: clear</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>ERCRST</name>
              <description>Error Counters Reset. When unit is bus off, issuing this command will request erasing TEC, REC counters after
128 consecutive ocurrences of 11 recessive bits. Upon completion, TEC and REC are erased and fault confinement
State is set to error-active. When unit is not bus-off, or when unit is bus-off due to being disabled (SETTINGS[ENA]
= ’0’), this command has no effect.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>RXFCRST</name>
              <description>Clear RX bus traffic counter (RX_COUNTER register).</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>TXFCRST</name>
              <description>Clear TX bus traffic counter (TX_COUNTER register).</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CPEXS</name>
              <description>Clear Protocol exception status (STATUS[PEXS]).</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CRXPE</name>
              <description>Clear STATUS[RXPE] flag.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CTXPE</name>
              <description>Clear STATUS[TXPE] flag.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CTXDPE</name>
              <description>Clear STATUS[TXDPE] flag.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
