espressif/esp-bist/src/soc/esp32c5/esp32c5.svd
        <register>
          <name>EWL_ERP_FAULT_STATE</name>
          <description>TWAI FD error threshold and status register</description>
          <addressOffset>0x2C</addressOffset>
          <size>0x20</size>
          <resetValue>0x00048060</resetValue>
          <fields>
            <field>
              <name>EW_LIMIT</name>
              <description>Error warning limit. If error warning limit is reached interrupt can be generated. Error warning limit
indicates heavily disturbed bus.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ERP_LIMIT</name>
              <description>Error Passive Limit. When one of error counters (REC/TEC) exceeds this value, Fault confinement state
changes to error-passive.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ERA</name>
              <description>Represents the fault state of error active.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ERP</name>
              <description>Represents the fault state of error passive.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>BOF</name>
              <description>Represents the fault state of bus off.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REC_TEC</name>
          <description>TWAI FD error counters status register</description>
          <addressOffset>0x30</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>REC_VAL</name>
              <description>Represents the receiver error counter value.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TEC_VAL</name>
              <description>Represents the transmitter error counter value.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ERR_NORM_ERR_FD</name>
          <description>TWAI FD special error counters status register</description>
          <addressOffset>0x34</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>ERR_NORM_VAL</name>
              <description>Represents the number of error in the nominal bit time.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ERR_FD_VAL</name>
              <description>Represents the number of error in the data bit time.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CTR_PRES</name>
          <description>TWAI FD error counters pre-define configuration register</description>
          <addressOffset>0x38</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CTPV</name>
              <description>Configures the pre-defined value to set the error counter.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>PTX</name>
              <description>Configures whether or not to set the receiver error counter into the value of pre-defined value.
0: invalid
1: set</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>PRX</name>
              <description>Configures whether or not to set the transmitter error counter into the value of pre-defined value.
0: invalid
1: set</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>ENORM</name>
              <description>Configures whether or not to erase the error counter of nominal bit time.
0: invalid
1: erase</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>EFD</name>
              <description>Configures whether or not to erase the error counter of data bit time.
0: invalid
1: erase</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FILTER_A_MASK</name>
          <description>TWAI FD filter A mask value register</description>
          <addressOffset>0x3C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>BIT_MASK_A_VAL</name>
              <description>Filter A mask. The identifier format is the same as in IDENTIFIER_W of TXT buffer or RX
buffer. If filter A is not present, writes to this register have no effect and read will return all zeroes.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>29</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FILTER_A_VAL</name>
          <description>TWAI FD filter A bit value register</description>
          <addressOffset>0x40</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>BIT_VAL_A_VAL</name>
              <description>Filter A value. The identifier format is the same as in IDENTIFIER_W of TXT buffer or RX buffer.
If filter A is not present, writes to this register have no effect and read will return all zeroes.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>29</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FILTER_B_MASK</name>
          <description>TWAI FD filter B mask value register</description>
          <addressOffset>0x44</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>BIT_MASK_B_VAL</name>
              <description>Filter B mask. The identifier format is the same as in IDENTIFIER_W of TXT buffer or RX
buffer. If filter A is not present, writes to this register have no effect and read will return all zeroes.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>29</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FILTER_B_VAL</name>
          <description>TWAI FD filter B bit value register</description>
          <addressOffset>0x48</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>BIT_VAL_B_VAL</name>
              <description>Filter B value. The identifier format is the same as in IDENTIFIER_W of TXT buffer or RX buffer.
If filter A is not present, writes to this register have no effect and read will return all zeroes.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>29</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FILTER_C_MASK</name>
          <description>TWAI FD filter C mask value register</description>
          <addressOffset>0x4C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>BIT_MASK_C_VAL</name>
              <description>Filter C mask. The identifier format is the same as in IDENTIFIER_W of TXT buffer or RX
buffer. If filter A is not present, writes to this register have no effect and read will return all zeroes.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>29</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FILTER_C_VAL</name>
          <description>TWAI FD filter C bit value register</description>
          <addressOffset>0x50</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>BIT_VAL_C_VAL</name>
              <description>Filter C value. The identifier format is the same as in IDENTIFIER_W of TXT buffer or RX buffer.
If filter A is not present, writes to this register have no effect and read will return all zeroes.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>29</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FILTER_RAN_LOW</name>
          <description>TWAI FD filter range low value register</description>
          <addressOffset>0x54</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>BIT_RAN_LOW_VAL</name>
              <description>Filter Range Low threshold. The identifier format is the same as in IDENTIFIER_W of TXT
buffer or RX buffer. If Range filter is not supported, writes to this register have no effect and read will return all
Zeroes.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>29</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FILTER_RAN_HIGH</name>
          <description>TWAI FD filter range high value register</description>
          <addressOffset>0x58</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>BIT_RAN_HIGH_VAL</name>
              <description>Range filter High threshold. The identifier format is the same as in IDENTIFIER_W of TXT
buffer or RX buffer. If Range filter is not supported, writes to this register have no effect and read will return all
Zeroes.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>29</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FILTER_CONTROL_FILTER_STATUS</name>
          <description>TWAI FD filter control register</description>
          <addressOffset>0x5C</addressOffset>
          <size>0x20</size>
          <resetValue>0x000F000F</resetValue>
          <fields>
            <field>
              <name>FANB</name>
              <description>CAN Basic Frame is accepted by filter A.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FANE</name>
              <description>CAN Extended Frame is accepted by Filter A.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FAFB</name>
              <description>CAN FD Basic Frame is accepted by filter A.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FAFE</name>
              <description>CAN FD Extended Frame is accepted by filter A.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FBNB</name>
              <description>CAN Basic Frame is accepted by filter B.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FBNE</name>
              <description>CAN Extended Frame is accepted by Filter B.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FBFB</name>
              <description>CAN FD Basic Frame is accepted by filter B.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FBFE</name>
              <description>CAN FD Extended Frame is accepted by filter B.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FCNB</name>
              <description>CAN Basic Frame is accepted by filter C.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FCNE</name>
              <description>CAN Extended Frame is accepted by Filter C.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FCFB</name>
              <description>CAN FD Basic Frame is accepted by filter C.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FCFE</name>
              <description>CAN FD Extended Frame is accepted by filter C.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FRNB</name>
              <description>CAN Basic Frame is accepted by Range filter.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FRNE</name>
              <description>CAN Extended Frame is accepted by Range filter.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FRFB</name>
              <description>CAN FD Basic Frame is accepted by Range filter.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FRFE</name>
              <description>CAN FD Extended Frame is accepted by Range filter.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SFA</name>
              <description>Logic 1 when Filter A is available. Otherwise logic 0.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SFB</name>
              <description>Logic 1 when Filter B is available. Otherwise logic 0.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SFC</name>
              <description>Logic 1 when Filter C is available. Otherwise logic 0.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SFR</name>
              <description>Logic 1 when Range Filter is available. Otherwise logic 0.</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RX_MEM_INFO</name>
          <description>TWAI FD rx memory information register</description>
          <addressOffset>0x60</addressOffset>
          <size>0x20</size>
          <resetValue>0x00800080</resetValue>
          <fields>
            <field>
              <name>RX_BUFF_SIZE</name>
              <description>Size of RX buffer in 32-bit words.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>13</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RX_FREE</name>
              <description>Number of free 32 bit words in RX buffer.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>13</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RX_POINTERS</name>
          <description>TWAI FD rx memory pointer information register</description>
          <addressOffset>0x64</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>RX_WPP</name>
              <description>Write pointer position in RX buffer. Upon store of received frame write pointer is updated.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RX_RPP</name>
              <description>Read pointer position in RX buffer. Upon read of received frame read pointer is updated.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RX_STATUS_RX_SETTINGS</name>
          <description>TWAI FD rx status &amp; setting register</description>
          <addressOffset>0x68</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>RXE</name>
              <description>Represents whether or not the RX buffer is empty. RX buffer is empty. There is no CAN Frame stored in it.
0: not empty
1: empty</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RXF</name>
              <description>Represents whether or not the RX buffer is full. RX buffer is full, all memory words of RX buffer are occupied.
0: not full
1: full</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RXMOF</name>
              <description>Represents the number of received frame in RX buffer.
RX Buffer middle of frame. When RXMOF = 1, next read from RX_DATA register will return other than first
word (FRAME_FORMAT_W) of CAN frame.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RXFRC</name>
              <description>RX buffer frame count. Number of CAN frames stored in RX buffer.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RTSOP</name>
              <description>Receive buffer timestamp option. This register should be modified only when SETTINGS[ENA]=0.
0b0 - RTS_END - Timestamp of received frame in RX FIFO is captured in last bit of EOF field.
0b1 - RTS_BEG - Timestamp of received frame in RX FIFO is captured in SOF field.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RX_DATA</name>
          <description>TWAI FD received data register</description>
          <addressOffset>0x6C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>RX_DATA</name>
              <description>RX buffer data at read pointer position in FIFO. By reading from this register, read pointer is auto-
matically increased, as long as there is next data word stored in RX buffer. First stored word in the buffer is
FRAME_FORMAT_W, next IDENTIFIER_W etc. This register shall be read by 32 bit access.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
