espressif/esp-bist/src/soc/esp32c5/esp32c5.svd
        <register>
          <name>CONF1</name>
          <description>UHCI configuration register</description>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000033</resetValue>
          <fields>
            <field>
              <name>CHECK_SUM_EN</name>
              <description>Configures whether or not to enable header checksum validation when UHCI receives a data packet.\\
0: Disable\\
1: Enable\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CHECK_SEQ_EN</name>
              <description>Configures whether or not to enable the sequence number check when UHCI receives a data packet.\\
0: Disable\\
1: Enable\\</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CRC_DISABLE</name>
              <description>Configures whether or not to enable CRC calculation.\\
0: Disable\\
1: Enable\\
Valid only when the Data Integrity Check Present bit in UHCI packet is 1.\\</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SAVE_HEAD</name>
              <description>Configures whether or not to save the packet header when UHCI receives a data packet.\\
0: Not save\\
1: Save\\</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TX_CHECK_SUM_RE</name>
              <description>Configures whether or not to encode the data packet with a checksum.\\
0: Not use checksum\\
1: Use checksum\\</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TX_ACK_NUM_RE</name>
              <description>Configures whether or not to encode the data packet with an acknowledgment when a reliable packet is to be transmitted.\\
0: Not use acknowledgement\\
1: Use acknowledgement\\</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WAIT_SW_START</name>
              <description>Configures whether or not to put the UHCI encoder state machine to ST_SW_WAIT state.\\
0: No\\
1: Yes\\</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SW_START</name>
              <description>Write 1 to send data packets when the encoder state machine is in ST_SW_WAIT state.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STATE0</name>
          <description>UHCI receive status</description>
          <addressOffset>0x18</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>RX_ERR_CAUSE</name>
              <description>Represents the error type when DMA has received a packet with error.\\
0: Invalid. No effect\\
1: Checksum error in the HCI packet\\
2: Sequence number error in the HCI packet\\
3: CRC bit error in the HCI packet\\
4: 0xC0 is found but the received HCI packet is not complete\
5: 0xC0 is not found when the HCI packet has been received\\
6: CRC check error\\
7: Invalid. No effect\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DECODE_STATE</name>
              <description>Represents the UHCI decoder status.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STATE1</name>
          <description>UHCI transmit status</description>
          <addressOffset>0x1C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>ENCODE_STATE</name>
              <description>Represents the UHCI encoder status.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ESCAPE_CONF</name>
          <description>Escape character configuration</description>
          <addressOffset>0x20</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000033</resetValue>
          <fields>
            <field>
              <name>TX_C0_ESC_EN</name>
              <description>Configures whether or not to decode character 0xC0 when DMA receives data.\\
0: Not decode\\
1: Decode\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TX_DB_ESC_EN</name>
              <description>Configures whether or not to decode character 0xDB when DMA receives data.\\
0: Not decode\\
1: Decode\\</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TX_11_ESC_EN</name>
              <description>Configures whether or not to decode flow control character 0x11 when DMA receives data.\\
0: Not decode\\
1: Decode\\</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TX_13_ESC_EN</name>
              <description>Configures whether or not to decode flow control character 0x13 when DMA receives data.\\
0: Not decode\\
1: Decode\\</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RX_C0_ESC_EN</name>
              <description>Configures whether or not to replace 0xC0 by special characters when DMA sends data.\\
0: Not replace\\
1: Replace\\</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RX_DB_ESC_EN</name>
              <description>Configures whether or not to replace 0xDB by special characters when DMA sends data.\\
0: Not replace\\
1: Replace\\</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RX_11_ESC_EN</name>
              <description>Configures whether or not to replace flow control character 0x11 by special characters when DMA sends data.\\
0: Not replace\\
1: Replace\\</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RX_13_ESC_EN</name>
              <description>Configures whether or not to replace flow control character 0x13 by special characters when DMA sends data.\\
0: Not replace\\
1: Replace\\</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HUNG_CONF</name>
          <description>Timeout configuration</description>
          <addressOffset>0x24</addressOffset>
          <size>0x20</size>
          <resetValue>0x00810810</resetValue>
          <fields>
            <field>
              <name>TXFIFO_TIMEOUT</name>
              <description>Configures the timeout value for DMA data reception.\\Measurement unit: ms.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TXFIFO_TIMEOUT_SHIFT</name>
              <description>Configures the upper limit of the timeout counter for TX FIFO.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TXFIFO_TIMEOUT_ENA</name>
              <description>Configures whether or not to enable the data reception timeout for TX FIFO.\\
0: Disable\\
1: Enable\\</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RXFIFO_TIMEOUT</name>
              <description>Configures the timeout value for DMA to read data from RAM.\\Measurement unit: ms.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RXFIFO_TIMEOUT_SHIFT</name>
              <description>Configures the upper limit of the timeout counter for RX FIFO.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RXFIFO_TIMEOUT_ENA</name>
              <description>Configures whether or not to enable the DMA data transmission timeout.\\
0: Disable\\
1: Enable\\</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ACK_NUM</name>
          <description>UHCI ACK number configuration</description>
          <addressOffset>0x28</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>ACK_NUM</name>
              <description>Configures the number of acknowledgements used in software flow control.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LOAD</name>
              <description>Configures whether or not load acknowledgements.\\
0: Not load\\
1: Load\\</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RX_HEAD</name>
          <description>UHCI packet header register</description>
          <addressOffset>0x2C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>RX_HEAD</name>
              <description>Represents the header of the current received packet.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>QUICK_SENT</name>
          <description>UHCI quick send configuration register</description>
          <addressOffset>0x30</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SINGLE_SEND_NUM</name>
              <description>Configures the source of data to be transmitted in single_send mode.\\
0: Q0 register\\
1: Q1 register\\
2: Q2 register\\
3: Q3 register\\
4: Q4 register\\
5: Q5 register\\
6: Q6 register\\
7: Invalid. No effect\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SINGLE_SEND_EN</name>
              <description>Write 1 to enable single_send mode.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>ALWAYS_SEND_NUM</name>
              <description>Configures the source of data to be transmitted in always_send mode.\\
0: Q0 register\\
1: Q1 register\\
2: Q2 register\\
3: Q3 register\\
4: Q4 register\\
5: Q5 register\\
6: Q6 register\\
7: Invalid. No effect\\</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ALWAYS_SEND_EN</name>
              <description>Configures whether or not to enable always_send mode.\\
0: Disable\\
1: Enable\\</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_Q0_WORD0</name>
          <description>Q0 WORD0 quick send register</description>
          <addressOffset>0x34</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SEND_Q0_WORD0</name>
              <description>Data to be transmitted in Q0 register.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_Q0_WORD1</name>
          <description>Q0 WORD1 quick send register</description>
          <addressOffset>0x38</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SEND_Q0_WORD1</name>
              <description>Data to be transmitted in Q0 register.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_Q1_WORD0</name>
          <description>Q1 WORD0 quick send register</description>
          <addressOffset>0x3C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SEND_Q1_WORD0</name>
              <description>Data to be transmitted in Q1 register.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_Q1_WORD1</name>
          <description>Q1 WORD1 quick send register</description>
          <addressOffset>0x40</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SEND_Q1_WORD1</name>
              <description>Data to be transmitted in Q1 register.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_Q2_WORD0</name>
          <description>Q2 WORD0 quick send register</description>
          <addressOffset>0x44</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SEND_Q2_WORD0</name>
              <description>Data to be transmitted in Q2 register.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_Q2_WORD1</name>
          <description>Q2 WORD1 quick send register</description>
          <addressOffset>0x48</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SEND_Q2_WORD1</name>
              <description>Data to be transmitted in Q2 register.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_Q3_WORD0</name>
          <description>Q3 WORD0 quick send register</description>
          <addressOffset>0x4C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SEND_Q3_WORD0</name>
              <description>Data to be transmitted in Q3 register.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_Q3_WORD1</name>
          <description>Q3 WORD1 quick send register</description>
          <addressOffset>0x50</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SEND_Q3_WORD1</name>
              <description>Data to be transmitted in Q3 register.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_Q4_WORD0</name>
          <description>Q4 WORD0 quick send register</description>
          <addressOffset>0x54</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SEND_Q4_WORD0</name>
              <description>Data to be transmitted in Q4 register.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_Q4_WORD1</name>
          <description>Q4 WORD1 quick send register</description>
          <addressOffset>0x58</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SEND_Q4_WORD1</name>
              <description>Data to be transmitted in Q4 register.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_Q5_WORD0</name>
          <description>Q5 WORD0 quick send register</description>
          <addressOffset>0x5C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SEND_Q5_WORD0</name>
              <description>Data to be transmitted in Q5 register.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_Q5_WORD1</name>
          <description>Q5 WORD1 quick send register</description>
          <addressOffset>0x60</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SEND_Q5_WORD1</name>
              <description>Data to be transmitted in Q5 register.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_Q6_WORD0</name>
          <description>Q6 WORD0 quick send register</description>
          <addressOffset>0x64</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SEND_Q6_WORD0</name>
              <description>Data to be transmitted in Q6 register.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_Q6_WORD1</name>
          <description>Q6 WORD1 quick register</description>
          <addressOffset>0x68</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SEND_Q6_WORD1</name>
              <description>Data to be transmitted in Q6 register.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ESC_CONF0</name>
          <description>Escape sequence configuration register 0</description>
          <addressOffset>0x6C</addressOffset>
          <size>0x20</size>
          <resetValue>0x00DCDBC0</resetValue>
          <fields>
            <field>
              <name>SEPER_CHAR</name>
              <description>Configures separators to encode data packets. The default value is 0xC0.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEPER_ESC_CHAR0</name>
              <description>Configures the first character of SLIP escape sequence. The default value is 0xDB.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEPER_ESC_CHAR1</name>
              <description>Configures the second character of SLIP escape sequence. The default value is 0xDC.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ESC_CONF1</name>
          <description>Escape sequence configuration register 1</description>
          <addressOffset>0x70</addressOffset>
          <size>0x20</size>
          <resetValue>0x00DDDBDB</resetValue>
          <fields>
            <field>
              <name>ESC_SEQ0</name>
              <description>Configures the character that needs to be encoded. The default value is 0xDB used as the first character of SLIP escape sequence.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ESC_SEQ0_CHAR0</name>
              <description>Configures the first character of SLIP escape sequence. The default value is 0xDB.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ESC_SEQ0_CHAR1</name>
              <description>Configures the second character of SLIP escape sequence. The default value is 0xDD.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
